// AnimBlueprintGeneratedClass F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP.F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C
// Size: 0x3569 (Inherited: 0x520)
struct UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C : UCustomCharacterPartAnimInstance_RamirezHead {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x520(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x528(0x30)
	char pad_558[0x8]; // 0x558(0x08)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody_2; // 0x560(0x790)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0xcf0(0x118)
	char pad_E08[0x8]; // 0xe08(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0xe10(0x440)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x1250(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x1270(0x20)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x1290(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x16d0(0x440)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x1b10(0x440)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1f50(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1f70(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x20c8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x20f0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2190(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x21b8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x22c0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x22e0(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2300(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x23a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x23c8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x23f0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2548(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2570(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2610(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2630(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x2658(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2678(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2698(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x26b8(0x20)
	char pad_26D8[0x8]; // 0x26d8(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x26e0(0x440)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2b20(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2c28(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2d30(0xa0)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x2dd0(0x790)
	struct USkeletalMeshComponent* MeshToCopy; // 0x3560(0x08)
	bool GetPlayerListUsesCustomCharacterParts; // 0x3568(0x01)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink AnimGraph); // Function F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP.F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void BlueprintInitializeAnimation(); // Function F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP.F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void ExecuteUbergraph_F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP(int32_t EntryPoint); // Function F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP.F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C.ExecuteUbergraph_F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP // (Final|UbergraphFunction) // @ game+0xda7c34
};

