// Enum FortniteGame.ELinkToDirection
enum class ELinkToDirection : uint8 {
	Up,
	Down,
	Right,
	Left,
	Forward,
	Backward,
	ELinkToDirection_MAX,
};

// Enum FortniteGame.EFortDayPhase
enum class EFortDayPhase : uint8 {
	Morning,
	Day,
	Evening,
	Night,
	NumPhases,
	EFortDayPhase_MAX,
};

// Enum FortniteGame.EBuildingReplacementType
enum class EBuildingReplacementType : uint8 {
	BRT_None,
	BRT_Edited,
	BRT_Upgrade,
	BRT_MAX,
};

// Enum FortniteGame.EFortCustomPartType
enum class EFortCustomPartType : uint8 {
	Head,
	Body,
	Hat,
	Backpack,
	MiscOrTail,
	Face,
	Gameplay,
	NumTypes,
	EFortCustomPartType_MAX,
};

// Enum FortniteGame.EInteractionBeingAttempted
enum class EInteractionBeingAttempted : uint8 {
	FirstInteraction,
	SecondInteraction,
	AllInteraction,
	EInteractionBeingAttempted_MAX,
};

// Enum FortniteGame.EFortAIDirectorEvent
enum class EFortAIDirectorEvent : uint8 {
	PlayerAIEnemies,
	PlayerTakeDamage,
	PlayerHealth,
	PlayerDeath,
	PlayerLookAtAIEnemy,
	PlayerDamageAIEnemy,
	PlayerKillAIEnemy,
	PlayerHealingPotential,
	PlayerAmmoLight,
	PlayerAmmoMedium,
	PlayerAmmoHeavy,
	PlayerAmmoShells,
	PlayerAmmoEnergy,
	PlayerAINear,
	PlayerMovement,
	ObjectiveTakeDamage,
	ObjectiveHealth,
	ObjectiveDestroyed,
	TrapFired,
	TrapDamagedAIEnemy,
	ObjectivePathCost,
	PlayerPathCost,
	ObjectiveNearbyBuildingDamaged,
	Max_None,
	EFortAIDirectorEvent_MAX,
};

// Enum FortniteGame.EFortWeaponReloadType
enum class EFortWeaponReloadType : uint8 {
	ReloadWholeClip,
	ReloadIndividualBullets,
	ReloadBasedOnAmmoCostPerFire,
	ReloadBasedOnCartridgePerFire,
	EFortWeaponReloadType_MAX,
};

// Enum FortniteGame.EFortInventoryType
enum class EFortInventoryType : uint8 {
	World,
	Account,
	Outpost,
	MAX,
};

// Enum FortniteGame.EOfferPurchaseError
enum class EOfferPurchaseError : uint8 {
	NoError,
	PendingServerConfirmation,
	CannotAffordItem,
	InvalidOfferID,
	InvalidPriceIndex,
	NoneLeft,
	PurchaseAlreadyPending,
	NoConnection,
	AccountNotEligible,
	CannotGiftItem,
	MFANotEnabled,
	EOfferPurchaseError_MAX,
};

// Enum FortniteGame.EFortAlteration
enum class EFortAlteration : uint8 {
	AttributeSlot,
	GameplaySlot,
	ComplexCosmeticSlot,
	UserPickedCosmeticSlot,
	ColorSlot,
	HeroSpecializationTier1Slot,
	HeroSpecializationTier2Slot,
	HeroSpecializationTier3Slot,
	HeroSpecializationTier4Slot,
	HeroSpecializationTier5Slot,
	EFortAlteration_MAX,
};

// Enum FortniteGame.EPlayerCompetitiveBanReasons
enum class EPlayerCompetitiveBanReasons : uint8 {
	None,
	Cheating,
	Collusion,
	Toxicity,
	Harassment,
	Ringing,
	Gambling,
	Exploiting,
	IntentionalDisconnect,
	IllegalRestart,
	Other,
	AccountSharing,
	CircumventingRegionLock,
	CircumventingBan,
	Smurfing,
	CircumventingTeamLock,
	EPlayerCompetitiveBanReasons_MAX,
};

// Enum FortniteGame.EPlayerBanReasons
enum class EPlayerBanReasons : uint8 {
	Teaming,
	Afk_Leeching,
	Harassment,
	TradeScamming,
	Exploiting,
	Competitive,
	Creative,
	TeamingWithCheater,
	EPlayerBanReasons_MAX,
};

// Enum FortniteGame.EFortItemType
enum class EFortItemType : uint8 {
	WorldItem,
	Ammo,
	Badge,
	BackpackPickup,
	BuildingPiece,
	CharacterPart,
	Consumable,
	Deco,
	EditTool,
	Ingredient,
	ItemCache,
	Food,
	Gadget,
	AthenaGadget,
	HomebaseGadget,
	BattleLabDevice,
	SpyTechPerk,
	HeroAbility,
	MissionItem,
	Trap,
	MultiItem,
	Weapon,
	WeaponMelee,
	WeaponRanged,
	WeaponHarvest,
	WeaponCreativePhone,
	WeaponMod,
	WorldResource,
	CreativeUserPrefab,
	CreativePlayset,
	Vehicle,
	Npc,
	AccountItem,
	AccountResource,
	CollectedResource,
	Alteration,
	CardPack,
	Currency,
	Hero,
	Schematic,
	Worker,
	TeamPerk,
	PlayerTech,
	Token,
	DailyRewardScheduleToken,
	CodeToken,
	Stat,
	Buff,
	BuffCredit,
	Quest,
	Accolades,
	FriendChest,
	MedalsPunchCard,
	RepeatableDailiesCard,
	ChallengeBundle,
	ChallengeBundleSchedule,
	ChallengeBundleCompletionToken,
	GameplayModifier,
	Outpost,
	HomebaseNode,
	Defender,
	ConversionControl,
	DeployableBaseCloudSave,
	ConsumableAccountItem,
	Quota,
	Expedition,
	HomebaseBannerIcon,
	HomebaseBannerColor,
	AthenaSkyDiveContrail,
	PersonalVehicle,
	AthenaGlider,
	AthenaPickaxe,
	AthenaHat,
	AthenaBackpack,
	AthenaCharacter,
	AthenaDance,
	AthenaConsumableEmote,
	AthenaLoadingScreen,
	AthenaBattleBus,
	AthenaVehicleCosmetic,
	AthenaItemWrap,
	AthenaCallingCard,
	AthenaMapMarker,
	AthenaMusicPack,
	AthenaPetCosmetic,
	AthenaCharmCosmetic,
	AthenaVictoryPose,
	AthenaSeasonTreasure,
	AthenaSeason,
	AthenaRewardGraph,
	AthenaExtResource,
	EventDescription,
	BattleLabDeviceAccount,
	MatchAward,
	AthenaEventToken,
	EventPurchaseTracker,
	CosmeticVariantToken,
	CampaignHeroLoadout,
	Playset,
	PrerollData,
	CreativePlot,
	PlayerSurveyToken,
	CosmeticLocker,
	BannerToken,
	RestedXpBoosterToken,
	RewardEventGraphPurchaseToken,
	HardcoreModifier,
	EventDependentItem,
	ItemAccessToken,
	SpecialItem,
	Emote,
	Stack,
	CollectionBookPage,
	BGAConsumableWrapper,
	GiftBox,
	GiftBoxUnlock,
	PlaysetProp,
	RegCosmeticDef,
	Profile,
	Max_None,
	EFortItemType_MAX,
};

// Enum FortniteGame.EAthenaTravelLogPlayerType
enum class EAthenaTravelLogPlayerType : uint8 {
	Self,
	Ally,
	Enemy,
	Invalid,
	EAthenaTravelLogPlayerType_MAX,
};

// Enum FortniteGame.EAthenaTravelEventType
enum class EAthenaTravelEventType : uint8 {
	GroundMove,
	AirMove,
	BattleBusJump,
	LaunchJump,
	Landed,
	OpenChest,
	OpenAmmo,
	GotAssist,
	GotKnockdown,
	GotKill,
	PlayerDowned,
	PlayerDied,
	Won,
	DealtDamage,
	HealthChange,
	GotItem,
	DroppedItem,
	ShieldChange,
	WeaponExecuted,
	EnteredVehicle,
	ExitedVehicle,
	TrapBuilt,
	UsedItem,
	ZoneUpdate,
	PlacedBuilding,
	EmoteUsed,
	UpgradedBuilding,
	EditedBuilding,
	Count,
	EAthenaTravelEventType_MAX,
};

// Enum FortniteGame.ERewardSource
enum class ERewardSource : uint8 {
	Invalid,
	MinutesPlayed,
	FirstKill,
	TeamKills,
	FirstRevive,
	AdditionalRevives,
	Placement,
	Medals,
	FirstWin,
	SeasonLevelUp,
	BookLevelUp,
	MatchXP,
	MAX_COUNT,
	ERewardSource_MAX,
};

// Enum FortniteGame.EAthenaMatchXpMultiplierSource
enum class EAthenaMatchXpMultiplierSource : uint8 {
	Invalid,
	BattlePassSelf,
	BattlePassFriends,
	CosmeticSet,
	AntiAddictionPenalty,
	BonusXpEvent,
	MAX_COUNT,
	EAthenaMatchXpMultiplierSource_MAX,
};

// Enum FortniteGame.EFortAccoladeSubtype
enum class EFortAccoladeSubtype : uint8 {
	NotSet,
	Action,
	Discovery,
	XpToken,
	EFortAccoladeSubtype_MAX,
};

// Enum FortniteGame.EAlertLevel
enum class EAlertLevel : uint8 {
	Unaware,
	Alerted,
	LKP,
	Threatened,
	Count,
	EAlertLevel_MAX,
};

// Enum FortniteGame.EFortBudgetCategory
enum class EFortBudgetCategory : uint8 {
	Memory,
	Simulation,
	Rendering,
	Network,
	Audio,
	Max,
};

// Enum FortniteGame.EVolumeState
enum class EVolumeState : uint8 {
	Uninitialized,
	ReadOnly,
	Initializing,
	Ready,
	EVolumeState_MAX,
};

// Enum FortniteGame.EAthenaGameMsgType
enum class EAthenaGameMsgType : uint8 {
	None,
	DefaultIntro,
	DefaultMessage,
	DefaultCriticalMessage,
	CommIntro,
	CommMessage,
	CommCriticalMessage,
	CornerIntro,
	CornerMessage,
	CornerCriticalMessage,
	RespawnTurningOffWarning,
	RespawnOffWarning,
	CenterMessage,
	CenterImportantMessage,
	CenterCriticalMessage,
	EAthenaGameMsgType_MAX,
};

// Enum FortniteGame.EHUDMessagePlacement
enum class EHUDMessagePlacement : uint8 {
	None,
	BottomCenter,
	TopCenter,
	CenterRight,
	EHUDMessagePlacement_MAX,
};

// Enum FortniteGame.EFortVolumeType
enum class EFortVolumeType : uint8 {
	None,
	Island,
	Published,
	Featured,
	Prefab,
	Hub,
	EFortVolumeType_MAX,
};

// Enum FortniteGame.EVolumeShape
enum class EVolumeShape : uint8 {
	Sphere,
	Box,
	EVolumeShape_MAX,
};

// Enum FortniteGame.EFortBuildingType
enum class EFortBuildingType : uint8 {
	Wall,
	Floor,
	Corner,
	Deco,
	Prop,
	Stairs,
	Roof,
	Pillar,
	SpawnedItem,
	Container,
	Trap,
	GenericCenterCellActor,
	None,
	EFortBuildingType_MAX,
};

// Enum FortniteGame.EFortItemEntryState
enum class EFortItemEntryState : uint8 {
	NoneState,
	NewItemCount,
	ShouldShowItemToast,
	DurabilityInitialized,
	DoNotShowSpawnParticles,
	FromRecoveredBackpack,
	FromGift,
	PendingUpgradeCriteriaProgress,
	OwnerBuildingHandle,
	FromDroppedPickup,
	JustCrafted,
	CraftAndSlotTarget,
	GenericAttributeValueSet,
	PickupInstigatorHandle,
	RechargingWeaponServerTime,
	DisallowSwapOnNextPickUpAttempt,
	DroppedFromQuestSource,
	Tossed,
	EFortItemEntryState_MAX,
};

// Enum FortniteGame.EFortQuickBars
enum class EFortQuickBars : uint8 {
	Primary,
	Secondary,
	Creative,
	Max_None,
	EFortQuickBars_MAX,
};

// Enum FortniteGame.EAthenaCustomizationCategory
enum class EAthenaCustomizationCategory : uint8 {
	None,
	Glider,
	Pickaxe,
	Hat,
	Backpack,
	Character,
	LoadingScreen,
	BattleBus,
	VehicleDecoration,
	CallingCard,
	MapMarker,
	Dance,
	ConsumableEmote,
	VictoryPose,
	SkyDiveContrail,
	MusicPack,
	ItemWrap,
	PetSkin,
	Charm,
	RegCosmeticDef,
	Loadout,
	SaveLoadout,
	MAX,
};

// Enum FortniteGame.EFortObjectiveStatus
enum class EFortObjectiveStatus : uint8 {
	Created,
	InProgress,
	Succeeded,
	Failed,
	NeutralCompletion,
	Max_None,
	EFortObjectiveStatus_MAX,
};

// Enum FortniteGame.EStatCategory
enum class EStatCategory : uint8 {
	Combat,
	Building,
	Utility,
	Max_None,
	EStatCategory_MAX,
};

// Enum FortniteGame.EFortResourceType
enum class EFortResourceType : uint8 {
	Wood,
	Stone,
	Metal,
	Permanite,
	GoldCurrency,
	Ingredient,
	None,
	EFortResourceType_MAX,
};

// Enum FortniteGame.ERichPresenceStateChange
enum class ERichPresenceStateChange : uint8 {
	AutoUpdate,
	Idle,
	Active,
	Busy,
	NotBusy,
	ERichPresenceStateChange_MAX,
};

// Enum FortniteGame.ESubGame
enum class ESubGame : uint8 {
	Campaign,
	Athena,
	Invalid,
	Count,
	Creative,
	ESubGame_MAX,
};

// Enum FortniteGame.ELockOnState
enum class ELockOnState : uint8 {
	NoTarget,
	TargetAcquired,
	LockingOnToTarget,
	TargetLockedOn,
	Cooldown,
	COUNT,
	ELockOnState_MAX,
};

// Enum FortniteGame.EStatRecordingPeriod
enum class EStatRecordingPeriod : uint8 {
	Frame,
	Minute,
	AthenaSafeZonePhase,
	Life,
	Map,
	Campaign,
	Persistent,
	Max,
};

// Enum FortniteGame.EStatMod
enum class EStatMod : uint8 {
	Delta,
	Set,
	Maximum,
	EStatMod_MAX,
};

// Enum FortniteGame.EFortDamageZone
enum class EFortDamageZone : uint8 {
	Light,
	Normal,
	Critical,
	Vulnerability,
	Max,
};

// Enum FortniteGame.EFortEmotePlayMode
enum class EFortEmotePlayMode : uint8 {
	CheckIfOwned,
	ForcePlay,
	EFortEmotePlayMode_MAX,
};

// Enum FortniteGame.EFortItemTier
enum class EFortItemTier : uint8 {
	No_Tier,
	I,
	II,
	III,
	IV,
	V,
	VI,
	VII,
	VIII,
	IX,
	X,
	NumItemTierValues,
	EFortItemTier_MAX,
};

// Enum FortniteGame.EFortResourceLevel
enum class EFortResourceLevel : uint8 {
	First,
	Second,
	Third,
	Fourth,
	Fifth,
	Sixth,
	NumLevels,
	Invalid,
	EFortResourceLevel_MAX,
};

// Enum FortniteGame.EFortRequestedGameplayAction
enum class EFortRequestedGameplayAction : uint8 {
	ContinuePlaying,
	StartPlaying,
	StopPlaying,
	EnterZone,
	LeaveZone,
	ReturnToMainMenu,
	QuitGame,
	Invalid,
	EFortRequestedGameplayAction_MAX,
};

// Enum FortniteGame.EFortGameplayState
enum class EFortGameplayState : uint8 {
	NormalGameplay,
	WaitingToStart,
	EndOfZone,
	EnteringZone,
	LeavingZone,
	Invalid,
	EFortGameplayState_MAX,
};

// Enum FortniteGame.EBuildingHighlightType
enum class EBuildingHighlightType : uint8 {
	Primary,
	Interact,
	WillBeDestroyed,
	Quest,
	MAX_None,
	EBuildingHighlightType_MAX,
};

// Enum FortniteGame.EFortCollectedVariantClientUpdate
enum class EFortCollectedVariantClientUpdate : uint8 {
	NewVariant,
	CollectedCount,
	Improvement,
	HiddenImprovement,
	EFortCollectedVariantClientUpdate_MAX,
};

// Enum FortniteGame.EFortCollectedState
enum class EFortCollectedState : uint8 {
	Unknown,
	New,
	Known,
	NewlyCollected,
	Collected,
	NewBest,
	NewRecord,
	NewLocation,
	NewlyCompleted,
	Complete,
	EFortCollectedState_MAX,
};

// Enum FortniteGame.EFortPawnStasisMode
enum class EFortPawnStasisMode : uint8 {
	None,
	NoMovement,
	NoMovementOrTurning,
	NoMovementOrFalling,
	NoMovement_EmotesEnabled,
	NoMovementOrTurning_EmotesEnabled,
	NoMovementOrFalling_EmotesEnabled,
	EFortPawnStasisMode_MAX,
};

// Enum FortniteGame.EFortJumpStaminaCost
enum class EFortJumpStaminaCost : uint8 {
	None,
	Trigger,
	SprintTrigger,
	SprintAir,
	EFortJumpStaminaCost_MAX,
};

// Enum FortniteGame.EFortPCTutorialCompletedState
enum class EFortPCTutorialCompletedState : uint8 {
	Unknown,
	Incomplete,
	Complete,
	EFortPCTutorialCompletedState_MAX,
};

// Enum FortniteGame.EFortCompletionResult
enum class EFortCompletionResult : uint8 {
	Win,
	Loss,
	Draw,
	Undefined,
	EFortCompletionResult_MAX,
};

// Enum FortniteGame.EFortRewardActivityType
enum class EFortRewardActivityType : uint8 {
	General,
	MissionPrimary,
	MissionSecondary,
	AccountLevelUp,
	Max_None,
	EFortRewardActivityType_MAX,
};

// Enum FortniteGame.EFortDelayedQuickBarAction
enum class EFortDelayedQuickBarAction : uint8 {
	Add,
	Remove,
	Replace,
	Invalid,
	EFortDelayedQuickBarAction_MAX,
};

// Enum FortniteGame.EFortElementalDamageType
enum class EFortElementalDamageType : uint8 {
	None,
	Fire,
	Ice,
	Lightning,
	Energy,
	MAX,
};

// Enum FortniteGame.EFortDamageNumberType
enum class EFortDamageNumberType : uint8 {
	None,
	Pawn,
	Building,
	Player,
	Shield,
	Score,
	DBNO,
	Percent,
	EFortDamageNumberType_MAX,
};

// Enum FortniteGame.EFortCostInfoTypes
enum class EFortCostInfoTypes : uint8 {
	Placement,
	Repair,
	Conversion,
	Ability,
	None,
	EFortCostInfoTypes_MAX,
};

// Enum FortniteGame.EFortBuildPreviewMarkerOptionalAdjustment
enum class EFortBuildPreviewMarkerOptionalAdjustment : uint8 {
	None,
	FreeWallPieceOnTop,
	FreeWallPieceOnBottom,
	EFortBuildPreviewMarkerOptionalAdjustment_MAX,
};

// Enum FortniteGame.EFortVoteStatus
enum class EFortVoteStatus : uint8 {
	Begin,
	Update,
	End,
	BeginLockout,
	EndLockout,
	EFortVoteStatus_MAX,
};

// Enum FortniteGame.EFortVoteType
enum class EFortVoteType : uint8 {
	SurvivalVote,
	DifficultyIncrease,
	MissionActivation,
	ContinueOrExtract,
	EFortVoteType_MAX,
};

// Enum FortniteGame.EAthenaGamePhase
enum class EAthenaGamePhase : uint8 {
	None,
	Setup,
	Warmup,
	Aircraft,
	SafeZones,
	EndGame,
	Count,
	EAthenaGamePhase_MAX,
};

// Enum FortniteGame.EAthenaGamePhaseStep
enum class EAthenaGamePhaseStep : uint8 {
	None,
	Setup,
	Warmup,
	GetReady,
	BusLocked,
	BusFlying,
	StormForming,
	StormHolding,
	StormShrinking,
	Countdown,
	FinalCountdown,
	EndGame,
	Count,
	EAthenaGamePhaseStep_MAX,
};

// Enum FortniteGame.EAthenaStormCapState
enum class EAthenaStormCapState : uint8 {
	None,
	Clear,
	Warning,
	Damaging,
	EAthenaStormCapState_MAX,
};

// Enum FortniteGame.EFortIsFinalXpUpdate
enum class EFortIsFinalXpUpdate : uint8 {
	Uninitialized,
	NotFinal,
	Final,
	EFortIsFinalXpUpdate_MAX,
};

// Enum FortniteGame.EFortTeam
enum class EFortTeam : uint8 {
	Spectator,
	HumanCampaign,
	Monster,
	HumanPvP_Team1,
	HumanPvP_Team2,
	MAX,
};

// Enum FortniteGame.EFortVoteArbitratorType
enum class EFortVoteArbitratorType : uint8 {
	Invalid,
	Majority,
	Unanimous,
	EFortVoteArbitratorType_MAX,
};

// Enum FortniteGame.EWaveRules
enum class EWaveRules : uint8 {
	KillAllEnemies,
	Timed,
	KillPoints,
	KillSpecificEnemy,
	Mission,
	EWaveRules_MAX,
};

// Enum FortniteGame.EServerStability
enum class EServerStability : uint8 {
	Stable,
	LowUnstability,
	HighUnstability,
	Count,
	EServerStability_MAX,
};

// Enum FortniteGame.EFortPlaylistType
enum class EFortPlaylistType : uint8 {
	Default,
	Playground,
	Creative,
	Creative_LTM,
	BattleLab,
	EFortPlaylistType_MAX,
};

// Enum FortniteGame.EMapLocationStateType
enum class EMapLocationStateType : uint8 {
	Normal,
	Golden,
	Undiscovered,
	Max,
};

// Enum FortniteGame.ESpawnMachineState
enum class ESpawnMachineState : uint8 {
	Default,
	WaitingForUse,
	Active,
	Complete,
	OnCooldown,
	ESpawnMachineState_MAX,
};

// Enum FortniteGame.ESafeZoneStartUp
enum class ESafeZoneStartUp : uint8 {
	UseDefaultGameBehavior,
	StartsWithWarmUp,
	StartsWithAirCraft,
	StartsWithNoAirCraft,
	ESafeZoneStartUp_MAX,
};

// Enum FortniteGame.EEventTournamentRound
enum class EEventTournamentRound : uint8 {
	Open,
	Qualifiers,
	SemiFinals,
	Finals,
	Unknown,
	Arena,
	EEventTournamentRound_MAX,
};

// Enum FortniteGame.EFriendlyFireType
enum class EFriendlyFireType : uint8 {
	Off,
	On,
	EFriendlyFireType_MAX,
};

// Enum FortniteGame.EAirCraftBehavior
enum class EAirCraftBehavior : uint8 {
	Default,
	OpposingAirCraftForEachTeam,
	FlyTowardFirstCircleCenter,
	NoAircraft,
	EAirCraftBehavior_MAX,
};

// Enum FortniteGame.EAthenaScoringEvent
enum class EAthenaScoringEvent : uint8 {
	None,
	Elimination,
	ChestOpened,
	AmmoCanOpened,
	SupplyDropOpened,
	SupplyLlamaOpened,
	ForagedItemConsumed,
	SurvivalInMinutes,
	CollectedCoinBronze,
	CollectedCoinSilver,
	CollectedCoinGold,
	AIKilled,
	EAthenaScoringEvent_MAX,
};

// Enum FortniteGame.EMatchAbandonState
enum class EMatchAbandonState : uint8 {
	None,
	Joining,
	CanAbandon,
	TeamLocked,
	EMatchAbandonState_MAX,
};

// Enum FortniteGame.ETrustedPlatformType
enum class ETrustedPlatformType : uint8 {
	Unknown,
	Untrusted,
	PS4,
	PS5,
	XboxOne,
	Switch,
	ETrustedPlatformType_MAX,
};

// Enum FortniteGame.EReadyCheckState
enum class EReadyCheckState : uint8 {
	CheckStarted,
	Ready,
	NotReady,
	EReadyCheckState_MAX,
};

// Enum FortniteGame.EFortAppliedSwapItemAndVariantState
enum class EFortAppliedSwapItemAndVariantState : uint8 {
	None,
	Active,
	Inactive,
	EFortAppliedSwapItemAndVariantState_MAX,
};

// Enum FortniteGame.EFortCustomBodyType
enum class EFortCustomBodyType : uint8 {
	NONE,
	Small,
	Medium,
	MediumAndSmall,
	Large,
	LargeAndSmall,
	LargeAndMedium,
	All,
	Deprecated,
	EFortCustomBodyType_MAX,
};

// Enum FortniteGame.EFortCustomGender
enum class EFortCustomGender : uint8 {
	Invalid,
	Male,
	Female,
	Both,
	EFortCustomGender_MAX,
};

// Enum FortniteGame.EFortPlayerRole
enum class EFortPlayerRole : uint8 {
	Player,
	LiveSpectator,
	ReplaySpectator,
	InactivePlayer,
	EFortPlayerRole_MAX,
};

// Enum FortniteGame.EFortKickReason
enum class EFortKickReason : uint8 {
	NotKicked,
	GenericKick,
	WasBanned,
	EncryptionRequired,
	CrossPlayRestriction,
	ClientIdRestriction,
	EFortKickReason_MAX,
};

// Enum FortniteGame.EMessageDispatcherErrorMessageType
enum class EMessageDispatcherErrorMessageType : uint8 {
	FailedToSetTrigger_TooManyTriggers,
	FailedToSetReceiver_TooManyReceivers,
	FailedToSetReceiver_TooManyReceiversOnOneChannel,
	FailedToSetTriggerReceiver_InvalidChannel,
	FailedToEnqueueMessage,
	BuildLimitReached,
	UnknownError,
	EMessageDispatcherErrorMessageType_MAX,
};

// Enum FortniteGame.EDeathCause
enum class EDeathCause : uint8 {
	OutsideSafeZone,
	FallDamage,
	Pistol,
	Shotgun,
	Rifle,
	SMG,
	Sniper,
	SniperNoScope,
	Melee,
	InfinityBlade,
	Grenade,
	C4,
	GrenadeLauncher,
	RocketLauncher,
	Minigun,
	Bow,
	Trap,
	DBNOTimeout,
	Banhammer,
	RemovedFromGame,
	MassiveMelee,
	MassiveDiveBomb,
	MassiveRanged,
	Vehicle,
	ShoppingCart,
	ATK,
	QuadCrasher,
	Biplane,
	BiplaneGun,
	LMG,
	GasGrenade,
	InstantEnvironmental,
	InstantEnvironmentalFellOutOfWorld,
	InstantEnvironmentalUnderLandscape,
	Turret,
	ShipCannon,
	Cube,
	Balloon,
	StormSurge,
	Lava,
	BasicFiend,
	EliteFiend,
	RangedFiend,
	BasicBrute,
	EliteBrute,
	MegaBrute,
	SilentSwitchingToSpectate,
	LoggedOut,
	TeamSwitchSuicide,
	WonMatch,
	Unspecified,
	EDeathCause_MAX,
};

// Enum FortniteGame.ETeamMemberState
enum class ETeamMemberState : uint8 {
	None,
	FIRST_CHAT_MESSAGE,
	NeedAmmoHeavy,
	NeedAmmoLight,
	NeedAmmoMedium,
	NeedAmmoShells,
	NeedAmmoRocket,
	ChatBubble,
	EnemySpotted,
	NeedBandages,
	NeedMaterials,
	NeedShields,
	NeedWeapon,
	LAST_CHAT_MESSAGE,
	MAX,
};

// Enum FortniteGame.EFortWeaponOverheatState
enum class EFortWeaponOverheatState : uint8 {
	None,
	Heating,
	Cooling,
	Overheated,
	EFortWeaponOverheatState_MAX,
};

// Enum FortniteGame.EDialogMarkerInteractionState
enum class EDialogMarkerInteractionState : uint8 {
	Conversation,
	InteractionRange,
	IndicatorRange,
	None,
	EDialogMarkerInteractionState_MAX,
};

// Enum FortniteGame.EFortReportDayPhase
enum class EFortReportDayPhase : uint8 {
	Dawn,
	Dusk,
	ZoneFinished,
	PlayerLogout,
	EFortReportDayPhase_MAX,
};

// Enum FortniteGame.EXPEventPriorityType
enum class EXPEventPriorityType : uint8 {
	NearReticle,
	XPBarOnly,
	TopCenter,
	Feed,
	EXPEventPriorityType_MAX,
};

// Enum FortniteGame.EMatchmakingCancelReasonV2
enum class EMatchmakingCancelReasonV2 : uint8 {
	Explicit,
	JoinedParty,
	LeftParty,
	PartyMemberJoined,
	PartyMemberLeft,
	PartyMemberCanceled,
	PartyLeaderSwap,
	PlayReplay,
	UIDestroyed,
	PCDestroyed,
	AppBackgrounded,
	HotfixOutdated,
	TournamentOver,
	NotInParty,
	CrossplayBlocked,
	TournamentCrossplayBlocked,
	AccountLevelTooLow,
	FillNoCrossplay,
	CreativeCanceledByLeader,
	CreativeMemberLeftIsland,
	CreativeIslandStateChanged,
	JoinInProgressRejected,
	MatchmakingDisabled,
	NotLoggedIn,
	NoIdentityInterface,
	NoSessionInterface,
	TimedOut,
	InvalidPlaylist,
	AttemptedToQueueTooFrequently,
	TournamentBlackout,
	CellularDataRefusal,
	CancelledDownloadContent,
	Unknown,
	EMatchmakingCancelReasonV2_MAX,
};

// Enum FortniteGame.EPlayerControllerFollow
enum class EPlayerControllerFollow : uint8 {
	NextTeammate,
	PreviousTeammate,
	NextPlayer,
	PreviousPlayer,
	SpecialActor,
	EPlayerControllerFollow_MAX,
};

// Enum FortniteGame.EFortQuickTimeEventResult
enum class EFortQuickTimeEventResult : uint8 {
	None,
	Miss,
	Good,
	Great,
	Perfect,
	EFortQuickTimeEventResult_MAX,
};

// Enum FortniteGame.EVehicleSeats
enum class EVehicleSeats : uint8 {
	Driver,
	Passenger1,
	Passenger2,
	Passenger3,
	Passenger4,
	Passenger5,
	MaxCount,
	EVehicleSeats_MAX,
};

// Enum FortniteGame.ELeecherStatus
enum class ELeecherStatus : uint8 {
	NotReady,
	NonLeecher,
	Leecher,
	ELeecherStatus_MAX,
};

// Enum FortniteGame.EEndOfMatchReason
enum class EEndOfMatchReason : uint8 {
	LastManStanding,
	ScoreReached,
	TimeRanOut,
	WinEventOccurred,
	AllLoggedOut,
	AllEliminated,
	EEndOfMatchReason_MAX,
};

// Enum FortniteGame.EFortMarkedActorScreenClamping
enum class EFortMarkedActorScreenClamping : uint8 {
	Default,
	Clamp,
	ClampWhileNew,
	DontClamp,
	EFortMarkedActorScreenClamping_MAX,
};

// Enum FortniteGame.EFortWorldMarkerType
enum class EFortWorldMarkerType : uint8 {
	None,
	Location,
	Enemy,
	Item,
	Elimination,
	SpecialLocal,
	SpecialServer,
	MAX,
};

// Enum FortniteGame.EBuildingGameplayActorAircraftSpawnSide
enum class EBuildingGameplayActorAircraftSpawnSide : uint8 {
	None,
	Side1,
	Side2,
	EBuildingGameplayActorAircraftSpawnSide_MAX,
};

// Enum FortniteGame.EForceKickAfterDeathMode
enum class EForceKickAfterDeathMode : uint8 {
	Disabled,
	KickAll,
	KickPrivate,
	EForceKickAfterDeathMode_MAX,
};

// Enum FortniteGame.ECapturePointState
enum class ECapturePointState : uint8 {
	Idle,
	Capturing,
	Contested,
	Resetting,
	Captured,
	Reset,
	ECapturePointState_MAX,
};

// Enum FortniteGame.EAdHocSquads_InviteStatus
enum class EAdHocSquads_InviteStatus : uint8 {
	Unset,
	Inviting,
	InviteEnded_APlayerAcceptedTheInvite,
	InviteCancelled_SquadFull,
	InviteCancelled_ByInvitingPlayer,
	EAdHocSquads_MAX,
};

// Enum FortniteGame.EAdHocSquads_SquadUpResult
enum class EAdHocSquads_SquadUpResult : uint8 {
	Success,
	Failure_OneOrMorePlayersWereNull,
	Failure_BothPlayersAreInAdHocSquads,
	Failure_BothPlayersAreAlreadyInTheSameAdHocSquad,
	Failure_CouldNotCreateAdHocSquad,
	Failure_CalledOnClient,
	Failure_SquadIsAlreadyFull,
	Failure_TooManyPlayersToMergeSquads,
	Failure_MutatorIsDisabled,
	Failure_Unknown,
	Failure_Custom,
	EAdHocSquads_MAX,
};

// Enum FortniteGame.EAdHocSquads_LeaveSquadReason
enum class EAdHocSquads_LeaveSquadReason : uint8 {
	ManualLeave,
	MutatorDisabled,
	JoinedADifferentSquad,
	PlayerDiedAndCannotBeRevived,
	PlayerHasWonGame,
	EAdHocSquads_MAX,
};

// Enum FortniteGame.EMiniMapComponentDiscoverableVisibility
enum class EMiniMapComponentDiscoverableVisibility : uint8 {
	Unset,
	NotVisible,
	Visible_NotDiscovered,
	Discovered,
	EMiniMapComponentDiscoverableVisibility_MAX,
};

// Enum FortniteGame.EPlayerBountyThreatLevel
enum class EPlayerBountyThreatLevel : uint8 {
	Low,
	Medium,
	High,
	MAX,
};

// Enum FortniteGame.EBackupSaveState
enum class EBackupSaveState : uint8 {
	Ready,
	InProgress,
	OnCooldown,
	EBackupSaveState_MAX,
};

// Enum FortniteGame.EPropertyOverrideTargetType
enum class EPropertyOverrideTargetType : uint8 {
	None,
	Default,
	ImmutableTarget,
	EPropertyOverrideTargetType_MAX,
};

// Enum FortniteGame.TInteractionType
enum class TInteractionType : uint8 {
	IT_NoInteraction,
	IT_Simple,
	IT_LongPress,
	IT_BuildingEdit,
	IT_BuildingImprovement,
	IT_TrapPlacement,
	IT_MAX,
};

// Enum FortniteGame.EFortBuildingPersistentState
enum class EFortBuildingPersistentState : uint8 {
	Default,
	New,
	Constructed,
	Destroyed,
	Searched,
	None,
	EFortBuildingPersistentState_MAX,
};

// Enum FortniteGame.EFortBuildingInitializationReason
enum class EFortBuildingInitializationReason : uint8 {
	StaticallyPlaced,
	Spawned,
	Replaced,
	LoadedFromSave,
	DynamicBuilderPlaced,
	PlacementTool,
	TrapTool,
	None,
	EFortBuildingInitializationReason_MAX,
};

// Enum FortniteGame.ENavigationObstacleOverride
enum class ENavigationObstacleOverride : uint8 {
	UseMeshSettings,
	ForceEnabled,
	ForceDisabled,
	ENavigationObstacleOverride_MAX,
};

// Enum FortniteGame.EDynamicBuildingPlacementType
enum class EDynamicBuildingPlacementType : uint8 {
	CountsTowardsBounds,
	DestroyIfColliding,
	DestroyAnythingThatCollides,
	EDynamicBuildingPlacementType_MAX,
};

// Enum FortniteGame.EFortBaseWeaponDamage
enum class EFortBaseWeaponDamage : uint8 {
	Combat,
	Environmental,
	EFortBaseWeaponDamage_MAX,
};

// Enum FortniteGame.EBuildingActorComponentCreationPolicy
enum class EBuildingActorComponentCreationPolicy : uint8 {
	Never,
	Lazy,
	Always,
	EBuildingActorComponentCreationPolicy_MAX,
};

// Enum FortniteGame.EAttributeInitLevelSource
enum class EAttributeInitLevelSource : uint8 {
	WorldDifficulty,
	PlayerBuildingSkill,
	AthenaPlaylist,
	EAttributeInitLevelSource_MAX,
};

// Enum FortniteGame.EFortAbilityTargetingSource
enum class EFortAbilityTargetingSource : uint8 {
	Camera,
	PawnForward,
	PawnTowardsFocus,
	WeaponForward,
	WeaponTowardsFocus,
	Custom,
	Max_None,
	EFortAbilityTargetingSource_MAX,
};

// Enum FortniteGame.EFortDeliveryInfoBuildingActorSpecification
enum class EFortDeliveryInfoBuildingActorSpecification : uint8 {
	All,
	PlayerBuildable,
	NonPlayerBuildable,
	EFortDeliveryInfoBuildingActorSpecification_MAX,
};

// Enum FortniteGame.EFortTeamAffiliation
enum class EFortTeamAffiliation : uint8 {
	Friendly,
	Neutral,
	Hostile,
	EFortTeamAffiliation_MAX,
};

// Enum FortniteGame.EFortProximityBasedGEApplicationType
enum class EFortProximityBasedGEApplicationType : uint8 {
	ApplyOnProximityPulse,
	ApplyOnProximityTouch,
	ApplyOnlyDuringProximityTouch,
	ApplyOnProximityExit,
	ApplyOnProximityPrePulse,
	EFortProximityBasedGEApplicationType_MAX,
};

// Enum FortniteGame.EHudVisibilityState
enum class EHudVisibilityState : uint8 {
	FullyVisible,
	FullyHidden,
	GameOnly,
	ReplayOnly,
	MAX,
};

// Enum FortniteGame.EFortReplayEventType
enum class EFortReplayEventType : uint8 {
	Elimination,
	Eliminated,
	DBNO,
	UserPlaced,
	MAX,
};

// Enum FortniteGame.ESpectatorCameraType
enum class ESpectatorCameraType : uint8 {
	ThirdPerson,
	DroneFree,
	Gameplay,
	ReverseShot,
	FollowShot,
	DroneFollow,
	DroneAttach,
	BattleMap,
	ARDrone,
	MAX,
};

// Enum FortniteGame.EIntelStateEnum
enum class EIntelStateEnum : uint8 {
	None,
	OnGround,
	HeldByAttacker,
	HeldByDefender,
	Downloaded,
	Captured,
	Downloading,
	EIntelStateEnum_MAX,
};

// Enum FortniteGame.EEventResponderEventType
enum class EEventResponderEventType : uint8 {
	OneShotEvent,
	PersistentEventJoinInProgress,
	PersistentEventStart,
	PersistentEventChange,
	PersistentEventEnd,
	EEventResponderEventType_MAX,
};

// Enum FortniteGame.EMatchConditionMutatorTimingType
enum class EMatchConditionMutatorTimingType : uint8 {
	Round,
	MatchAtEndOfRound,
	MatchImmediate,
	COUNT,
	EMatchConditionMutatorTimingType_MAX,
};

// Enum FortniteGame.EAthenaRoundsMutatorPhase
enum class EAthenaRoundsMutatorPhase : uint8 {
	GamePhase_Setup,
	GamePhase_Warmup,
	FadeOutToNextRound,
	RoundSetup,
	RoundPlay,
	RoundEnd,
	RoundEndUI,
	MatchEndUI,
	MatchEndedPrematurely,
	EAthenaRoundsMutatorPhase_MAX,
};

// Enum FortniteGame.EFortMutatorOverridePriority
enum class EFortMutatorOverridePriority : uint8 {
	None,
	Low,
	Medium,
	High,
	EFortMutatorOverridePriority_MAX,
};

// Enum FortniteGame.EUraniumRoundPhase
enum class EUraniumRoundPhase : uint8 {
	None,
	EndOfRoundStart,
	ShowRoundEnd,
	HideRoundEnd,
	FadeOut,
	SetupForNextRound,
	ShowRoundIntro,
	ShowPOICamera,
	PerkSelect,
	RoundActive,
	FadeIn,
	EndOfRoundFinish,
	FadeBeforeReleasePlayerIntoGameplay,
	ReleasePlayersIntoGameplay,
	EndGame,
	MAX,
};

// Enum FortniteGame.EUraniumEventId
enum class EUraniumEventId : uint8 {
	Intro,
	CartBecomesPushable,
	CheckPointReached,
	NearCheckPoint,
	NearFinalCheckPoint,
	TimeIsLow,
	TimeIsExtraLow,
	OvertimeStarted,
	RoundEnd_PushersWin,
	RoundEnd_DefendersWin,
	RoundStart,
	GameEnded_AllRoundsPlayed,
	GameEndedEarly_BlowOut,
	GameEndedEarly_OutNumbered,
	EUraniumEventId_MAX,
};

// Enum FortniteGame.EUraniumCartMovementRuleOnNewRound
enum class EUraniumCartMovementRuleOnNewRound : uint8 {
	NoChange,
	MoveToNextCheckpoint,
	MoveToStartOfNewSpline,
	MoveToRandomCheckPointOfNewSpline,
	MoveToNextCheckPointOfNewSpline,
	EUraniumCartMovementRuleOnNewRound_MAX,
};

// Enum FortniteGame.EUraniumRoundEndCondition
enum class EUraniumRoundEndCondition : uint8 {
	RanOutOfTime_Or_CheckpointReached,
	RanOutOfTime_Or_LastCheckpointReached,
	RanOutOfTime_Or_MAX,
};

// Enum FortniteGame.EFortMinigameState
enum class EFortMinigameState : uint8 {
	PreGame,
	Setup,
	Transitioning,
	WaitingForCameras,
	Warmup,
	InProgress,
	PostGameTimeDilation,
	PostRoundEnd,
	PostGameEnd,
	PostGameAbandon,
	PostGameReset,
	EFortMinigameState_MAX,
};

// Enum FortniteGame.SpecialEventInputButton
enum class SpecialEventInputButton : uint8 {
	PrimaryFire,
	SecondaryFire,
	RollLeft,
	RollRight,
	Jump,
	Reload,
	SpecialEventInputButton_MAX,
};

// Enum FortniteGame.EBuildingGameplayActorSentry_State
enum class EBuildingGameplayActorSentry_State : uint8 {
	PassiveIdle,
	ActiveIdle,
	Tracking,
	Aggro,
	Dormant,
	Deactivated,
	ReturningToIdle,
	LocatingDamager,
	EBuildingGameplayActorSentry_MAX,
};

// Enum FortniteGame.ELockState
enum class ELockState : uint8 {
	INVALID,
	UNLOCKED,
	LOCKED,
	ELockState_MAX,
};

// Enum FortniteGame.EJoinInProgress
enum class EJoinInProgress : uint8 {
	Spectate,
	JoinOnNextRound,
	JoinImmediately,
	JoinSpecificTeam,
	EJoinInProgress_MAX,
};

// Enum FortniteGame.EMMSPrivacy
enum class EMMSPrivacy : uint8 {
	Public,
	Private,
	EMMSPrivacy_MAX,
};

// Enum FortniteGame.EPortalLinkCodeLockStatus
enum class EPortalLinkCodeLockStatus : uint8 {
	Unlocked_NotSet,
	Unlocked,
	Locked,
	EPortalLinkCodeLockStatus_MAX,
};

// Enum FortniteGame.EHeldObjectState
enum class EHeldObjectState : uint8 {
	Unheld,
	Held,
	Thrown,
	Placed,
	Dropped,
	HeldInVehicle,
	EHeldObjectState_MAX,
};

// Enum FortniteGame.EFortHomingStyle
enum class EFortHomingStyle : uint8 {
	None,
	LockOn,
	LaserTargeted,
	LaserTargeted_NoTrace,
	DrunkArtillery,
	EFortHomingStyle_MAX,
};

// Enum FortniteGame.ECaptureState
enum class ECaptureState : uint8 {
	Neutral,
	Capturing,
	Contested,
	Disabled,
	Decapturing,
	Neutralizing,
	Deneutralizing,
	Captured,
	ECaptureState_MAX,
};

// Enum FortniteGame.EHitTraceRule
enum class EHitTraceRule : uint8 {
	Visibility,
	Terrain,
	None,
	EHitTraceRule_MAX,
};

// Enum FortniteGame.ETransformationType
enum class ETransformationType : uint8 {
	Translation,
	Rotation,
	Scale,
	None,
	ETransformationType_MAX,
};

// Enum FortniteGame.EScaleAxis
enum class EScaleAxis : uint8 {
	All,
	X,
	Y,
	Z,
	EScaleAxis_MAX,
};

// Enum FortniteGame.ESelectionProperty
enum class ESelectionProperty : uint8 {
	SingleObject,
	MultipleObjects,
	MultipleObjectsMoveOnGrid,
	None,
	ESelectionProperty_MAX,
};

// Enum FortniteGame.ECreativeKeyLockState
enum class ECreativeKeyLockState : uint8 {
	LOCKED,
	UNLOCKED,
	INVALID,
	ECreativeKeyLockState_MAX,
};

// Enum FortniteGame.EFortPrototypingStatus
enum class EFortPrototypingStatus : uint8 {
	Unknown,
	Disabled,
	Enabled,
	EFortPrototypingStatus_MAX,
};

// Enum FortniteGame.EFortQuestObjectiveStatEvent
enum class EFortQuestObjectiveStatEvent : uint8 {
	Kill,
	TeamKill,
	KillContribution,
	Damage,
	SquadDamage,
	Visit,
	VisitDiscoverPOI,
	Land,
	Emote,
	Spray,
	Toy,
	Build,
	BuildingEdit,
	BuildingRepair,
	BuildingUpgrade,
	PlaceTrap,
	Complete,
	Craft,
	Collect,
	Win,
	Interact,
	TeamInteract,
	Destroy,
	Ability,
	WaveComplete,
	Custom,
	ComplexCustom,
	Client,
	AthenaRank,
	AthenaOutlive,
	RevivePlayer,
	Heal,
	EarnVehicleTrickPoints,
	VehicleAirTime,
	TimeElapsed,
	Death,
	AthenaMarker,
	PlacementUpdate,
	StormPhase,
	DistanceTraveled,
	DownOrElim,
	Accolade,
	TakeDamage,
	AthenaCollection,
	UsedNPCService,
	ReceivedNPCGift,
	InitiatedNPCConversation,
	AthenaCraft,
	AthenaTurnInQuest,
	AthenaVehicleMod,
	AthenaOpenedFriendChest,
	AthenaAcquire,
	InitiatedServiceStationConversation,
	NumGameplayEvents,
	Acquire,
	Consume,
	OpenCardPack,
	PurchaseCardPack,
	Convert,
	Upgrade,
	UpgradeRarity,
	QuestComplete,
	AssignWorker,
	CollectExpedition,
	CollectSuccessfulExpedition,
	LevelUpCollectionBook,
	LevelUpAthenaSeason,
	LevelUpBattlePass,
	GainAthenaSeasonXp,
	HasItem,
	HasAccumulatedItem,
	SlotInCollection,
	AlterationRespec,
	AlterationUpgrade,
	HasCompletedQuest,
	HasAssignedWorker,
	HasUpgraded,
	HasConverted,
	HasUpgradedRarity,
	HasLeveledUpCollectionBook,
	SlotHeroInLoadout,
	HasLeveledUpAthenaSeason,
	HasLeveledUpBattlePass,
	HasGainedAthenaSeasonXp,
	MinigameDynamicEvent,
	MinigameComplete,
	MinigameDeath,
	MinigameAssist,
	Max_None,
	EFortQuestObjectiveStatEvent_MAX,
};

// Enum FortniteGame.EFortMinigameEnd
enum class EFortMinigameEnd : uint8 {
	AbandonGame,
	EndGame,
	EndRound,
	EFortMinigameEnd_MAX,
};

// Enum FortniteGame.EPlayerIndicatorDisplayMode
enum class EPlayerIndicatorDisplayMode : uint8 {
	DontOverride,
	TeamOnly,
	Enemies,
	Anyone,
	Never,
	EPlayerIndicatorDisplayMode_MAX,
};

// Enum FortniteGame.ECreativeBossDisplayMode
enum class ECreativeBossDisplayMode : uint8 {
	DontOverride,
	Yes,
	No,
	ECreativeBossDisplayMode_MAX,
};

// Enum FortniteGame.EFortMissionVisibilityOverride
enum class EFortMissionVisibilityOverride : uint8 {
	Visible,
	Invisible,
	Max_None,
	EFortMissionVisibilityOverride_MAX,
};

// Enum FortniteGame.EMatchmakingCompleteResult
enum class EMatchmakingCompleteResult : uint8 {
	NotStarted,
	UpdateNeeded,
	OutpostNotFound,
	Cancelled,
	NoResults,
	Failure,
	CreateFailure,
	Success,
	EMatchmakingCompleteResult_MAX,
};

// Enum FortniteGame.EMatchmakingState
enum class EMatchmakingState : uint8 {
	NotMatchmaking,
	CancelingMatchmaking,
	ReleasingLock,
	AcquiringLock,
	LockAcquistionFailure,
	FindingEmptyServer,
	FindingExistingSession,
	TestingEmptyServers,
	TestingExistingSessions,
	JoiningExistingSession,
	NoMatchesAvailable,
	CleaningUpExisting,
	HandlingFailure,
	JoinSuccess,
	EMatchmakingState_MAX,
};

// Enum FortniteGame.EMatchmakingUtilityState
enum class EMatchmakingUtilityState : uint8 {
	Idle,
	MatchmakingUtilityBegin,
	MatchmakingUtilityCompleted,
	Failed,
	CheckSittingOutState,
	InitializePlaylistSelection,
	JoinMatchInProgress,
	CheckingIfBanned,
	CreativeContentDownloadModal,
	CrossplayOptIn_GameMode,
	CrossplayOptIn_Fill,
	CrossplayDevices,
	FactionChoice,
	SetPartyReadiness,
	WaitingForPartyReadinessConfirmed,
	TournamentEligibility,
	TournamentRegionLock,
	TournamentMFA,
	TournamentEULA,
	AppEnvSecurity,
	WaitingForInitialPlaylistSelection,
	ServerBrowsers,
	WaitingForServerBrowserPlaylistSwap,
	DelayReadyUp,
	QoSSettings_UpdateManager,
	QoSSettings_UpdateManager_Success,
	SetAthenaReady,
	WaitingForAthenaReadinessConfirmed,
	PreloadAthena,
	UpdateHiddenMatchmakingDelay,
	WaitingForUpdateHiddenMatchmakingDelay,
	HiddenMatchmakingDelay,
	FindExistingEditSession,
	SelectingFlow,
	PreloadingForFlow,
	ReadyingUpforFlow,
	CallingMatchmakingForFlow,
	WaitingForJoinMatchInProgressResponse,
	WaitingForMatchmakingResponse,
	WaitingForMatchmakingToCompleteAsPartyMember,
	WaitingForEntirePartyReady,
	WaitingToRestartMatchmaking_TooFrequentRequest,
	RequestingSpectateMatch,
	ProcessingMatchmakingResults_Success,
	ProcessingMatchmakingResults_Fail,
	PreloadingForJoiningMatchInProgress,
	ProcessingJoinMatchInProgressResults_Success,
	ProcessingJoinMatchInProgressResults_Fail,
	DownloadingAdditionalContent,
	RestartingMatchmaking,
	INVALID,
	EMatchmakingUtilityState_MAX,
};

// Enum FortniteGame.EAthenaPartyMemberReadyType
enum class EAthenaPartyMemberReadyType : uint8 {
	Ready,
	NotReady,
	Playing,
	Spectating,
	WatchingReplay,
	EAthenaPartyMemberReadyType_MAX,
};

// Enum FortniteGame.EFortFriendRequestStatus
enum class EFortFriendRequestStatus : uint8 {
	None,
	Accepted,
	PendingReceived,
	PendingSent,
	EFortFriendRequestStatus_MAX,
};

// Enum FortniteGame.EFortPartyMemberLocation
enum class EFortPartyMemberLocation : uint8 {
	PreLobby,
	ConnectingToLobby,
	Lobby,
	JoiningGame,
	ProcessingRejoin,
	InGame,
	Spectating,
	WatchingReplay,
	ReturningToFrontEnd,
	EFortPartyMemberLocation_MAX,
};

// Enum FortniteGame.EFortPartyState
enum class EFortPartyState : uint8 {
	Undetermined,
	WorldView,
	TheaterView,
	Matchmaking,
	PostMatchmaking,
	ReturningToFrontEnd,
	BattleRoyaleView,
	BattleRoyalePreloading,
	BattleRoyaleMatchmaking,
	BattleRoyalePostMatchmaking,
	EFortPartyState_MAX,
};

// Enum FortniteGame.EFortPartyMemberDisplayState
enum class EFortPartyMemberDisplayState : uint8 {
	Open,
	Connecting,
	Connected,
	Max,
};

// Enum FortniteGame.ESpectateBlendEasing
enum class ESpectateBlendEasing : uint8 {
	Linear,
	EaseOutQuad,
	ESpectateBlendEasing_MAX,
};

// Enum FortniteGame.EFortSpectatorBlendType
enum class EFortSpectatorBlendType : uint8 {
	None,
	Orbit,
	Default,
	EFortSpectatorBlendType_MAX,
};

// Enum FortniteGame.ESpectatorSquadIdMode
enum class ESpectatorSquadIdMode : uint8 {
	AlwaysOff,
	AlwaysOn,
	HoldToDisplay,
	ESpectatorSquadIdMode_MAX,
};

// Enum FortniteGame.EPlayEventType
enum class EPlayEventType : uint8 {
	None,
	TeamFlight,
	Zone,
	Elimination,
	PlayerMoves,
	SinglePlayerMove,
	ActorsPosition,
	GameHighlights,
	Timecode,
	EPlayEventType_MAX,
};

// Enum FortniteGame.ECameraShotNotificationTypes
enum class ECameraShotNotificationTypes : uint8 {
	Notification,
	HighlightAnnotation,
	TitleScreen,
	ECameraShotNotificationTypes_MAX,
};

// Enum FortniteGame.EThirdPersonAutoFollowMode
enum class EThirdPersonAutoFollowMode : uint8 {
	Off,
	Auto,
	Lazy,
	EThirdPersonAutoFollowMode_MAX,
};

// Enum FortniteGame.EFortPlayerSurveyFinishReason
enum class EFortPlayerSurveyFinishReason : uint8 {
	Submitted,
	Canceled,
	Disallowed,
	EFortPlayerSurveyFinishReason_MAX,
};

// Enum FortniteGame.EFortPlayerSurveyAnswerContainerChangeReason
enum class EFortPlayerSurveyAnswerContainerChangeReason : uint8 {
	AnswerChange,
	QuestionChange,
	ProxyChange,
	EFortPlayerSurveyAnswerContainerChangeReason_MAX,
};

// Enum FortniteGame.EInteriorAudioState
enum class EInteriorAudioState : uint8 {
	Indoors,
	Outdoors,
	PartialOutdoors,
	Max_None,
	EInteriorAudioState_MAX,
};

// Enum FortniteGame.ECollectionBookRewardType
enum class ECollectionBookRewardType : uint8 {
	Uninitialized,
	Book,
	Page,
	Section,
	ECollectionBookRewardType_MAX,
};

// Enum FortniteGame.ECampaignCustomizationCategory
enum class ECampaignCustomizationCategory : uint8 {
	None,
	PersonalVehicle,
	ECampaignCustomizationCategory_MAX,
};

// Enum FortniteGame.EFortDialogFeedbackType
enum class EFortDialogFeedbackType : uint8 {
	FriendRequestSent,
	FriendRequestReceived,
	FriendRequestAccepted,
	Default,
	EFortDialogFeedbackType_MAX,
};

// Enum FortniteGame.EFortWeakPointState
enum class EFortWeakPointState : uint8 {
	Uninitialized,
	Inactive,
	Active,
	Destroyed,
	EFortWeakPointState_MAX,
};

// Enum FortniteGame.EDualWeaponHand
enum class EDualWeaponHand : uint8 {
	LEFT,
	RIGHT,
	MAX,
};

// Enum FortniteGame.EFortEncounterDirection
enum class EFortEncounterDirection : uint8 {
	North,
	NorthEast,
	East,
	SouthEast,
	South,
	SouthWest,
	West,
	NorthWest,
	Max_None,
	EFortEncounterDirection_MAX,
};

// Enum FortniteGame.EQuestUpdateType
enum class EQuestUpdateType : uint8 {
	ObjectiveCompleted,
	QuestCompleted,
	ObjectiveUpdated,
	QuestUpdated,
	QuestAndObjectiveUpdate,
	EQuestUpdateType_MAX,
};

// Enum FortniteGame.EQuestVisibilityResponse
enum class EQuestVisibilityResponse : uint8 {
	Hide,
	Show,
	Custom,
	EQuestVisibilityResponse_MAX,
};

// Enum FortniteGame.EItemWrapMaterialType
enum class EItemWrapMaterialType : uint8 {
	WeaponWrap,
	VehicleWrap_Opaque,
	VehicleWrap_Masked,
	Character,
	EItemWrapMaterialType_MAX,
};

// Enum FortniteGame.EFortRarity
enum class EFortRarity : uint8 {
	Common,
	Uncommon,
	Rare,
	Epic,
	Legendary,
	Mythic,
	Transcendent,
	Unattainable,
	NumRarityValues,
	EFortRarity_MAX,
};

// Enum FortniteGame.EAIHotSpotAssignmentFilter
enum class EAIHotSpotAssignmentFilter : uint8 {
	All,
	WithSlots,
	WaitingList,
	EAIHotSpotAssignmentFilter_MAX,
};

// Enum FortniteGame.EAIHotSpotSlotFilter
enum class EAIHotSpotSlotFilter : uint8 {
	All,
	AvailableOnly,
	UnavailableOnly,
	EAIHotSpotSlotFilter_MAX,
};

// Enum FortniteGame.EAIHotSpotSlot
enum class EAIHotSpotSlot : uint8 {
	Free,
	Claimed,
	Occupied,
	Blocked,
	Disabled,
	EAIHotSpotSlot_MAX,
};

// Enum FortniteGame.EBoundingBoxSlotDirectionCalculation
enum class EBoundingBoxSlotDirectionCalculation : uint8 {
	Auto,
	FaceWall,
	FaceAwayFromWall,
	FaceCenter,
	EBoundingBoxSlotDirectionCalculation_MAX,
};

// Enum FortniteGame.EBarrierFlagState
enum class EBarrierFlagState : uint8 {
	FlagUp,
	FlagDown,
	EBarrierFlagState_MAX,
};

// Enum FortniteGame.EBarrierState
enum class EBarrierState : uint8 {
	BarrierUp,
	BarrierComingDown,
	BarrierDown,
	EBarrierState_MAX,
};

// Enum FortniteGame.EAthenaBroadcastKillFeedEntryType
enum class EAthenaBroadcastKillFeedEntryType : uint8 {
	Elimination,
	Storm,
	FallDamage,
	Explosion,
	DBNO,
	EAthenaBroadcastKillFeedEntryType_MAX,
};

// Enum FortniteGame.ECapturePointUnlockRules
enum class ECapturePointUnlockRules : uint8 {
	Reset,
	MaintainState,
	ResetDeactivate,
	ECapturePointUnlockRules_MAX,
};

// Enum FortniteGame.EContentionRuleType
enum class EContentionRuleType : uint8 {
	MajorityWins,
	OneTeamOnlyWins,
	EContentionRuleType_MAX,
};

// Enum FortniteGame.EVariantUnlockType
enum class EVariantUnlockType : uint8 {
	UnlockAll,
	ExclusiveChoice,
	EVariantUnlockType_MAX,
};

// Enum FortniteGame.EAthenaPIEStartupMode
enum class EAthenaPIEStartupMode : uint8 {
	UseDefaults,
	Warmup,
	WarmupPaused,
	Aircraft,
	AircraftPaused,
	Gameplay,
	EAthenaPIEStartupMode_MAX,
};

// Enum FortniteGame.EEventTokenType
enum class EEventTokenType : uint8 {
	Invite,
	Creation,
	EEventTokenType_MAX,
};

// Enum FortniteGame.ELayeredAudioTriggerDirection
enum class ELayeredAudioTriggerDirection : uint8 {
	AnyDirection,
	Forwards,
	Sideways,
	Backwards,
	Count,
	ELayeredAudioTriggerDirection_MAX,
};

// Enum FortniteGame.EItemWrapSectionNames
enum class EItemWrapSectionNames : uint8 {
	Section_1,
	Section_2,
	Section_3,
	Section_4,
	Section_5,
	Section_6,
	Section_7,
	Section_8,
	Section_9,
	Section_10,
	Section_11,
	Section_12,
	Section_13,
	Section_14,
	Section_15,
	Section_16,
	Section_17,
	Section_18,
	Section_19,
	Section_20,
	Section_21,
	Section_22,
	Section_23,
	Section_24,
	Section_25,
	Section_26,
	Section_27,
	Section_28,
	Section_29,
	Section_30,
	Section_31,
	Section_32,
	Section_MAX,
};

// Enum FortniteGame.ECancelMarkerReason
enum class ECancelMarkerReason : uint8 {
	Ping,
	MapOrDeath,
	ECancelMarkerReason_MAX,
};

// Enum FortniteGame.EInBoundsState
enum class EInBoundsState : uint8 {
	NoBounds,
	NotInBounds,
	InBounds,
	EInBoundsState_MAX,
};

// Enum FortniteGame.EAthenaPetAttachRule
enum class EAthenaPetAttachRule : uint8 {
	AttachToBackpack,
	AttachToBody,
	EAthenaPetAttachRule_MAX,
};

// Enum FortniteGame.EAthenaQuickChatFilteringType
enum class EAthenaQuickChatFilteringType : uint8 {
	AlwaysVisible,
	ActiveMaterial,
	FacingPickup,
	ActiveHotbarItem,
	ActiveHotbarItemAmmo,
	FacingPickupOrActiveHotbarItem,
	NoWeaponEquippedRequiringAmmo,
	WeaponEquippedOfAmmoType,
	EAthenaQuickChatFilteringType_MAX,
};

// Enum FortniteGame.EAthenaSeasonRewardTrack
enum class EAthenaSeasonRewardTrack : uint8 {
	Invalid,
	SeasonProgressionTrack,
	CompendiumFreeTrack,
	CompendiumPaidTrack,
	CompendiumAdditionalTrack,
	EAthenaSeasonRewardTrack_MAX,
};

// Enum FortniteGame.EAthenaRewardVisualImportanceType
enum class EAthenaRewardVisualImportanceType : uint8 {
	Normal,
	Hot,
	CrazyHot,
	Crazy,
	EAthenaRewardVisualImportanceType_MAX,
};

// Enum FortniteGame.EAthenaRewardItemType
enum class EAthenaRewardItemType : uint8 {
	Normal,
	HiddenReward,
	GiftboxHiddenReward,
	NonExportedFakeReward,
	EAthenaRewardItemType_MAX,
};

// Enum FortniteGame.EBattlePassRewardSource
enum class EBattlePassRewardSource : uint8 {
	None,
	ChallengeBundle,
	Quest,
	EBattlePassRewardSource_MAX,
};

// Enum FortniteGame.EPageItemTileSize
enum class EPageItemTileSize : uint8 {
	Size_1_x_2,
	Size_2_x_2,
	Size_2_x_3,
	Size_3_x_3,
	Size_3_x_4,
	Count,
	EPageItemTileSize_MAX,
};

// Enum FortniteGame.ETraversePointState
enum class ETraversePointState : uint8 {
	None,
	Hidden,
	Active,
	TouchedByPlayer,
	Finished,
	ETraversePointState_MAX,
};

// Enum FortniteGame.EFortVehicleDecoType
enum class EFortVehicleDecoType : uint8 {
	Unknown,
	Flag,
	HoodOrnament,
	Wings,
	EFortVehicleDecoType_MAX,
};

// Enum FortniteGame.EWrapPreviewCamera
enum class EWrapPreviewCamera : uint8 {
	Weapon,
	LargeWeapon,
	Vehicle,
	EWrapPreviewCamera_MAX,
};

// Enum FortniteGame.EAutoFrameMode
enum class EAutoFrameMode : uint8 {
	Off,
	ManualOverride,
	AutoFrame,
	EAutoFrameMode_MAX,
};

// Enum FortniteGame.EBacchusHUDStateType
enum class EBacchusHUDStateType : uint8 {
	DoNothing,
	Hide,
	Show,
	FallbackToDefault,
	EBacchusHUDStateType_MAX,
};

// Enum FortniteGame.BattleMapHoveredReason
enum class BattleMapHoveredReason : uint8 {
	None,
	Mouse,
	Code,
	BattleMapHoveredReason_MAX,
};

// Enum FortniteGame.EBuildingTickReason
enum class EBuildingTickReason : uint8 {
	Dynamic,
	Damaged,
	GameplayCue_Damage,
	GameplayCue_Healing,
	GameplayCue_InstantDeath,
	UnderConstruction,
	UnderRepair,
	Editing,
	BuildingAnimation,
	DynamicLODAnim,
	DynamicShrinkAnim,
	AutoBuild,
	FullHealthEffect,
	BounceAnimation,
	DoorOpenStyleChanged,
	DoorOpenChanged,
	DoorInteract,
	EBuildingTickReason_MAX,
};

// Enum FortniteGame.ECalendarDrivenState
enum class ECalendarDrivenState : uint8 {
	ForceEnable,
	ForceDisable,
	ECalendarDrivenState_MAX,
};

// Enum FortniteGame.EBinaryToggleValues
enum class EBinaryToggleValues : uint8 {
	BTV_Active,
	BTV_Inactive,
	BTV_Either,
	BTV_MAX,
};

// Enum FortniteGame.EAuxIndicatorStates
enum class EAuxIndicatorStates : uint8 {
	AIS_GuidingArrow,
	AIS_ConfirmedArrow,
	AIS_Inactive,
	AIS_Active,
	AIS_MAX,
};

// Enum FortniteGame.EDynamicFoundationEnabledState
enum class EDynamicFoundationEnabledState : uint8 {
	Unknown,
	Enabled,
	Disabled,
	EDynamicFoundationEnabledState_MAX,
};

// Enum FortniteGame.EDynamicFoundationType
enum class EDynamicFoundationType : uint8 {
	Static,
	StartEnabled_Stationary,
	StartEnabled_Dynamic,
	StartDisabled,
	EDynamicFoundationType_MAX,
};

// Enum FortniteGame.EBuildingFoundationType
enum class EBuildingFoundationType : uint8 {
	BFT_3x3,
	BFT_5x5,
	BFT_5x10,
	BFT_None,
	BFT_MAX,
};

// Enum FortniteGame.ESpawnMachineSubTextState
enum class ESpawnMachineSubTextState : uint8 {
	NoCards,
	VanInUse,
	None,
	ESpawnMachineSubTextState_MAX,
};

// Enum FortniteGame.EFortItemCollectorTrackingType
enum class EFortItemCollectorTrackingType : uint8 {
	Player,
	Team,
	EFortItemCollectorTrackingType_MAX,
};

// Enum FortniteGame.EFortItemCollectorBehavior
enum class EFortItemCollectorBehavior : uint8 {
	FirstToGoal,
	FreeForAll,
	EFortItemCollectorBehavior_MAX,
};

// Enum FortniteGame.EFortItemCollectorState
enum class EFortItemCollectorState : uint8 {
	CanInteract,
	Active,
	Inactive,
	Captured,
	Invalid,
	EFortItemCollectorState_MAX,
};

// Enum FortniteGame.ELayoutRequirementStatus
enum class ELayoutRequirementStatus : uint8 {
	Inactive_Invisible,
	Active_Invisible,
	Active_Visible,
	ELayoutRequirementStatus_MAX,
};

// Enum FortniteGame.ECaptureAreaItemFilters
enum class ECaptureAreaItemFilters : uint8 {
	None,
	Both,
	ForPeriodicScoring,
	ToTakeControl,
	ECaptureAreaItemFilters_MAX,
};

// Enum FortniteGame.EPlayerCaptureKnobOptions
enum class EPlayerCaptureKnobOptions : uint8 {
	Off,
	EachPlayer,
	OnePlayerPerTeam,
	OwningTeam,
	EPlayerCaptureKnobOptions_MAX,
};

// Enum FortniteGame.ECreativeVendingMachineState
enum class ECreativeVendingMachineState : uint8 {
	DisplayingItem,
	AcceptingItem,
	AcceptedItem,
	RejectedItem,
	ECreativeVendingMachineState_MAX,
};

// Enum FortniteGame.EMusicTrackPlayback
enum class EMusicTrackPlayback : uint8 {
	Disabled,
	Enabled,
	EMusicTrackPlayback_MAX,
};

// Enum FortniteGame.ERiftCosmeticState
enum class ERiftCosmeticState : uint8 {
	None,
	Intro,
	Idle,
	RampUp,
	ShouldDie,
	ERiftCosmeticState_MAX,
};

// Enum FortniteGame.EFortRiftSpawnSlotSelectionMode
enum class EFortRiftSpawnSlotSelectionMode : uint8 {
	Random,
	BestScore,
	EFortRiftSpawnSlotSelectionMode_MAX,
};

// Enum FortniteGame.EFortRiftSlotStatus
enum class EFortRiftSlotStatus : uint8 {
	Reserved,
	Occupied,
	Max_None,
	EFortRiftSlotStatus_MAX,
};

// Enum FortniteGame.EBuildingNavObstacleType
enum class EBuildingNavObstacleType : uint8 {
	UnwalkableAll,
	UnwalkableHuskOnly,
	SmashWhenLowHeight,
	SmashOnlyLowHeight,
	SmashSmasherOnly,
	SmashAll,
	EBuildingNavObstacleType_MAX,
};

// Enum FortniteGame.EFortDamageVisualsState
enum class EFortDamageVisualsState : uint8 {
	UnDamaged,
	DamagedAndAnimating,
	DamagedAndStatic,
	EFortDamageVisualsState_MAX,
};

// Enum FortniteGame.EStructuralSupportCheck
enum class EStructuralSupportCheck : uint8 {
	Stable,
	Unstable,
	Max_None,
	EStructuralSupportCheck_MAX,
};

// Enum FortniteGame.ESavedSupportStatus
enum class ESavedSupportStatus : uint8 {
	UnknownState,
	Supported,
	UnSupported,
	ESavedSupportStatus_MAX,
};

// Enum FortniteGame.EPlacementType
enum class EPlacementType : uint8 {
	Free,
	Grid,
	None,
	EPlacementType_MAX,
};

// Enum FortniteGame.EBuildingAttachmentSide
enum class EBuildingAttachmentSide : uint8 {
	Front,
	Back,
	Any,
	EBuildingAttachmentSide_MAX,
};

// Enum FortniteGame.EBuildingAttachmentSlot
enum class EBuildingAttachmentSlot : uint8 {
	SLOT_Floor,
	SLOT_Wall,
	SLOT_Ceiling,
	SLOT_None,
	SLOT_MAX,
};

// Enum FortniteGame.EBuildingAnim
enum class EBuildingAnim : uint8 {
	EBA_None,
	EBA_Building,
	EBA_Breaking,
	EBA_Destruction,
	EBA_Placement,
	EBA_DynamicLOD,
	EBA_DynamicShrink,
	EBA_MAX,
};

// Enum FortniteGame.EStructuralFloorPosition
enum class EStructuralFloorPosition : uint8 {
	Top,
	Bottom,
	EStructuralFloorPosition_MAX,
};

// Enum FortniteGame.EStructuralWallPosition
enum class EStructuralWallPosition : uint8 {
	Left,
	Right,
	Front,
	Back,
	EStructuralWallPosition_MAX,
};

// Enum FortniteGame.EFortDefenderInteractionError
enum class EFortDefenderInteractionError : uint8 {
	None,
	Obstructed,
	NoEditPermission,
	UsedByAnotherPlayer,
	EFortDefenderInteractionError_MAX,
};

// Enum FortniteGame.EFortBuildingDestroyedReason
enum class EFortBuildingDestroyedReason : uint8 {
	Unknown,
	WeaponDamage,
	LostSupport,
	Edit,
	FireDirect,
	FireIndirect,
	EFortBuildingDestroyedReason_MAX,
};

// Enum FortniteGame.EFortBounceType
enum class EFortBounceType : uint8 {
	Hit,
	Interact,
	EditPlaced,
	EFortBounceType_MAX,
};

// Enum FortniteGame.EFortConnectivityCubeFace
enum class EFortConnectivityCubeFace : uint8 {
	Front,
	Left,
	Back,
	Right,
	Upper,
	Lower,
	MAX,
};

// Enum FortniteGame.EFortDecoPlacementQueryResults
enum class EFortDecoPlacementQueryResults : uint8 {
	CanAdd,
	ExistingTrap,
	ExistingObject,
	Obstructed,
	NoLocation,
	WrongType,
	WrongShape,
	BeingModified,
	WrongTeam,
	BlueprintFailure,
	AbilityFailure,
	RequiresPlayerBuildableActor,
	NoEditPermission,
	WrongZone,
	EFortDecoPlacementQueryResults_MAX,
};

// Enum FortniteGame.EFortStructuralGridQueryResults
enum class EFortStructuralGridQueryResults : uint8 {
	CanAdd,
	ExistingActor,
	Obstructed,
	NoStructuralSupport,
	InvalidActor,
	ReachedLimit,
	NoEditPermission,
	PatternNotPermittedByLayoutRequirement,
	ResourceTypeNotPermittedByLayoutRequirement,
	BuildingAtRequirementsDisabled,
	BuildingOtherThanRequirementsDisabled,
	EFortStructuralGridQueryResults_MAX,
};

// Enum FortniteGame.EFortBuildingState
enum class EFortBuildingState : uint8 {
	Placement,
	EditMode,
	None,
	EFortBuildingState_MAX,
};

// Enum FortniteGame.EFortTextureDataSlot
enum class EFortTextureDataSlot : uint8 {
	Primary,
	Secondary,
	Tertiary,
	Fourth,
	NumSlots,
	EFortTextureDataSlot_MAX,
};

// Enum FortniteGame.EFortTextureDataType
enum class EFortTextureDataType : uint8 {
	Any,
	OuterWall,
	InnerWall,
	Corner,
	Floor,
	Ceiling,
	Trim,
	Roof,
	Pillar,
	Shingle,
	None,
	EFortTextureDataType_MAX,
};

// Enum FortniteGame.EBuildingAttachmentType
enum class EBuildingAttachmentType : uint8 {
	ATTACH_Floor,
	ATTACH_Wall,
	ATTACH_Ceiling,
	ATTACH_Corner,
	ATTACH_All,
	ATTACH_WallThenFloor,
	ATTACH_FloorAndStairs,
	ATTACH_CeilingAndStairs,
	ATTACH_None,
	ATTACH_MAX,
};

// Enum FortniteGame.EDoorOpenStyle
enum class EDoorOpenStyle : uint8 {
	Open,
	SlamOpen,
	SmashOpen,
	Close,
	EDoorOpenStyle_MAX,
};

// Enum FortniteGame.ESmoothProgressState
enum class ESmoothProgressState : uint8 {
	Enabled,
	DisabledByForceProgress,
	DisabledByState,
	ESmoothProgressState_MAX,
};

// Enum FortniteGame.EClientContentReadiness
enum class EClientContentReadiness : uint8 {
	AwaitingServerResponse,
	ReceivingContentNames,
	DownloadingContent,
	MountingContent,
	ReadyToJoin,
	FailedToMount,
	NotConnected,
	ConnectionFailed,
	CelluarDataRefusal,
	CancelledDownloadContent,
	None,
	EClientContentReadiness_MAX,
};

// Enum FortniteGame.EContentRequestStatus
enum class EContentRequestStatus : uint8 {
	None,
	Active,
	Finished,
	EContentRequestStatus_MAX,
};

// Enum FortniteGame.ECreativeMinimapComponentIconColorType
enum class ECreativeMinimapComponentIconColorType : uint8 {
	None,
	White,
	Red,
	Orange,
	Yellow,
	Green,
	Teal,
	Blue,
	Purple,
	ECreativeMinimapComponentIconColorType_MAX,
};

// Enum FortniteGame.EShowProgressMode
enum class EShowProgressMode : uint8 {
	Total,
	Remaining,
	Off,
	MAX,
};

// Enum FortniteGame.ECreativeQuestSharing
enum class ECreativeQuestSharing : uint8 {
	Individual,
	Team,
	All,
	MAX,
};

// Enum FortniteGame.ECreativeQuestStat
enum class ECreativeQuestStat : uint8 {
	None,
	Eliminations,
	Eliminated,
	Score,
	MAX,
};

// Enum FortniteGame.EScoreDistributionType
enum class EScoreDistributionType : uint8 {
	Default,
	DivideByDamage,
	DivideEvenly,
	AllToKiller,
	EScoreDistributionType_MAX,
};

// Enum FortniteGame.EAccessoryColorName
enum class EAccessoryColorName : uint8 {
	EAccessoryColorName_AccessoryColor1,
	EAccessoryColorName_AccessoryColor2,
	EAccessoryColorName_AccessoryColor3,
	EAccessoryColorName_NumTypes,
	EAccessoryColorName_MAX,
};

// Enum FortniteGame.ECustomHatType
enum class ECustomHatType : uint8 {
	ECustomHatType_None,
	ECustomHatType_Cap,
	ECustomHatType_Helmet,
	ECustomHatType_Mask,
	ECustomHatType_Hat,
	ECustomHatType_HeadReplacement,
	ECustomHatType_MAX,
};

// Enum FortniteGame.EClothingColorName
enum class EClothingColorName : uint8 {
	EClothingColorName_AccessoryColor1,
	EClothingColorName_AccessoryColor2,
	EClothingColorName_NumTypes,
	EClothingColorName_MAX,
};

// Enum FortniteGame.EColorSwatchType
enum class EColorSwatchType : uint8 {
	EColorSwatchType_Skin,
	EColorSwatchType_Hair,
	EColorSwatchType_BodyAccessory,
	EColorSwatchType_Accessory,
	EColorSwatchType_NumTypes,
	EColorSwatchType_MAX,
};

// Enum FortniteGame.ECharacterColorSwatchType
enum class ECharacterColorSwatchType : uint8 {
	ECharacterColorSwatchType_Skin,
	ECharacterColorSwatchType_Hair,
	ECharacterColorSwatchType_NumTypes,
	ECharacterColorSwatchType_MAX,
};

// Enum FortniteGame.EVehicleEnteredCosmeticReaction
enum class EVehicleEnteredCosmeticReaction : uint8 {
	Driver,
	Passenger,
	Both,
	EVehicleEnteredCosmeticReaction_MAX,
};

// Enum FortniteGame.EDadBroHealthType
enum class EDadBroHealthType : uint8 {
	None,
	Weakpoints,
	Horn,
	Guy,
	EDadBroHealthType_MAX,
};

// Enum FortniteGame.EDeployableBaseConstructionStatus
enum class EDeployableBaseConstructionStatus : uint8 {
	Constructing,
	Destroying,
	Finished,
	EDeployableBaseConstructionStatus_MAX,
};

// Enum FortniteGame.EDeployableBaseBuildingState
enum class EDeployableBaseBuildingState : uint8 {
	Empty,
	Built,
	Unoccupied,
	WaitingToBuild,
	Building,
	WaitingToDestroy,
	Destroying,
	WaitingToReset,
	Resetting,
	EDeployableBaseBuildingState_MAX,
};

// Enum FortniteGame.EDeployableBaseBoxType
enum class EDeployableBaseBoxType : uint8 {
	BuildSpace,
	SaveSpace,
	PlotSpace,
	NumSpaceTypes,
	EDeployableBaseBoxType_MAX,
};

// Enum FortniteGame.EReferenceType
enum class EReferenceType : uint8 {
	Hard,
	Soft,
	Dynamic,
	EReferenceType_MAX,
};

// Enum FortniteGame.EFortSharedAnimationState
enum class EFortSharedAnimationState : uint8 {
	Anim_Walk,
	Anim_Run,
	Anim_Turn,
	Anim_Attack,
	Anim_Death,
	Anim_Knockback,
	Anim_FullBodyHit,
	Anim_Pushed,
	Anim_Dance,
	Anim_Idle,
	Anim_RangedAttack,
	Anim_MAX,
};

// Enum FortniteGame.EFortStatDisplayType
enum class EFortStatDisplayType : uint8 {
	Category,
	Buff,
	Debuff,
	Neutral,
	DoNotDisplay,
	EFortStatDisplayType_MAX,
};

// Enum FortniteGame.EFortAbilityTargetSelectionUsage
enum class EFortAbilityTargetSelectionUsage : uint8 {
	BothTargetingAndCanHit,
	OnlyTargeting,
	OnlyCanHit,
	EFortAbilityTargetSelectionUsage_MAX,
};

// Enum FortniteGame.EFortDirectedMovementSpace
enum class EFortDirectedMovementSpace : uint8 {
	WorldSpace,
	ActorLocRelative,
	ActorLocRotRelative,
	CameraRelative,
	EFortDirectedMovementSpace_MAX,
};

// Enum FortniteGame.EFortAbilityTargetDataPolicy
enum class EFortAbilityTargetDataPolicy : uint8 {
	ReplicateToServer,
	SimulateOnServer,
	EFortAbilityTargetDataPolicy_MAX,
};

// Enum FortniteGame.EFortAbilityChargeState
enum class EFortAbilityChargeState : uint8 {
	None,
	ChargingUp,
	MaxCharge,
	Discharge,
	ChargingDown,
	EFortAbilityChargeState_MAX,
};

// Enum FortniteGame.EFortAccoladeType
enum class EFortAccoladeType : uint8 {
	Acknowledgement,
	Accolade,
	Medal,
	EFortAccoladeType_MAX,
};

// Enum FortniteGame.EFortActorIndicatorContainerWidget
enum class EFortActorIndicatorContainerWidget : uint8 {
	Top,
	Middle,
	Bottom,
	EFortActorIndicatorContainerWidget_MAX,
};

// Enum FortniteGame.EFortActorSpawnerAuthority
enum class EFortActorSpawnerAuthority : uint8 {
	ServerAuthoritative,
	ClientAuthoritative,
	EFortActorSpawnerAuthority_MAX,
};

// Enum FortniteGame.EAthenaAITelemetryEventType
enum class EAthenaAITelemetryEventType : uint8 {
	Spawn,
	Despawn,
	EAthenaAITelemetryEventType_MAX,
};

// Enum FortniteGame.EDespawnAIType
enum class EDespawnAIType : uint8 {
	Relevancy,
	Distance,
	EDespawnAIType_MAX,
};

// Enum FortniteGame.EFortEncounterUtilityDesire
enum class EFortEncounterUtilityDesire : uint8 {
	Low,
	Medium,
	High,
	VeryHigh,
	Max_None,
	EFortEncounterUtilityDesire_MAX,
};

// Enum FortniteGame.EFortAIDirectorFactorContribution
enum class EFortAIDirectorFactorContribution : uint8 {
	Direct,
	Inverse,
	EFortAIDirectorFactorContribution_MAX,
};

// Enum FortniteGame.EFortAIDirectorEventContribution
enum class EFortAIDirectorEventContribution : uint8 {
	Increment,
	Set,
	EFortAIDirectorEventContribution_MAX,
};

// Enum FortniteGame.EFortAIWaveProgressSection
enum class EFortAIWaveProgressSection : uint8 {
	SectionOne,
	SectionTwo,
	Max_None,
	EFortAIWaveProgressSection_MAX,
};

// Enum FortniteGame.EFortEncounterState
enum class EFortEncounterState : uint8 {
	Uninitialized,
	InitializingProperties,
	InitializingRiftManager,
	AwaitingActivation,
	Active,
	ReplacingRifts,
	Max_None,
	EFortEncounterState_MAX,
};

// Enum FortniteGame.EFortEncounterPacingState
enum class EFortEncounterPacingState : uint8 {
	Ramp,
	Peak,
	Fade,
	Rest,
	Max_None,
	EFortEncounterPacingState_MAX,
};

// Enum FortniteGame.EFortEncounterSequenceResult
enum class EFortEncounterSequenceResult : uint8 {
	Success,
	FailedEncounterInProgress,
	Failed,
	EFortEncounterSequenceResult_MAX,
};

// Enum FortniteGame.EAssignmentCreationResult
enum class EAssignmentCreationResult : uint8 {
	AssignmentNotFoundOrCreated,
	AssignmentCreated,
	AssignmentFound,
	EAssignmentCreationResult_MAX,
};

// Enum FortniteGame.ETagGoalScoringCategory
enum class ETagGoalScoringCategory : uint8 {
	Ignore,
	HighInterest,
	NumCategories,
	ETagGoalScoringCategory_MAX,
};

// Enum FortniteGame.EFortAIPawnGender
enum class EFortAIPawnGender : uint8 {
	FAPG_Default,
	FAPG_Female,
	FAPG_Male,
	FAPG_MAX,
};

// Enum FortniteGame.EFortAILevelRatingDisplayType
enum class EFortAILevelRatingDisplayType : uint8 {
	DisplayRatingBasedOnDifficulty,
	DisplayAIDifficultyAsRating,
	DontDisplayRating,
	EFortAILevelRatingDisplayType_MAX,
};

// Enum FortniteGame.EFortressAIType
enum class EFortressAIType : uint8 {
	FAT_Dormant,
	FAT_Cleaner,
	FAT_DayWanderer,
	FAT_NightWanderer,
	FAT_DebugOnly,
	FAT_Encounter,
	FAT_MAX,
};

// Enum FortniteGame.ECorePerceptionTypes
enum class ECorePerceptionTypes : uint8 {
	Sight,
	Hearing,
	Damage,
	Touch,
	Team,
	Prediction,
	MAX,
};

// Enum FortniteGame.EAIScalableFloatScalingType
enum class EAIScalableFloatScalingType : uint8 {
	Disabled,
	ReceivedDamageByTarget,
	EAIScalableFloatScalingType_MAX,
};

// Enum FortniteGame.ETargetDistanceComparisonType
enum class ETargetDistanceComparisonType : uint8 {
	TwoDimensions,
	ThreeDimensions,
	CollisionHalfHeightMultiplier,
	ETargetDistanceComparisonType_MAX,
};

// Enum FortniteGame.EFortPartialPathUsage
enum class EFortPartialPathUsage : uint8 {
	Always,
	OnlyGoalsOnDestructible,
	Never,
	EFortPartialPathUsage_MAX,
};

// Enum FortniteGame.EHotspotTypeConfigMode
enum class EHotspotTypeConfigMode : uint8 {
	AlwaysAdd,
	WhenNotDefined,
	WhenNotValid,
	EHotspotTypeConfigMode_MAX,
};

// Enum FortniteGame.EFortHotSpotPreview
enum class EFortHotSpotPreview : uint8 {
	None,
	Smashing,
	Shooting,
	EFortHotSpotPreview_MAX,
};

// Enum FortniteGame.EFortHotSpotDirection
enum class EFortHotSpotDirection : uint8 {
	PositiveX,
	NegativeX,
	PositiveY,
	NegativeY,
	PositiveZ,
	NegativeZ,
	Any,
	EFortHotSpotDirection_MAX,
};

// Enum FortniteGame.EFortHotSpotSlot
enum class EFortHotSpotSlot : uint8 {
	Melee,
	MeleeHuge,
	Ranged,
	None,
	EFortHotSpotSlot_MAX,
};

// Enum FortniteGame.EBuildingFloorRailing
enum class EBuildingFloorRailing : uint8 {
	None,
	Balcony,
	EBuildingFloorRailing_MAX,
};

// Enum FortniteGame.EBuildingStairsRailing
enum class EBuildingStairsRailing : uint8 {
	None,
	Partial,
	Full,
	EBuildingStairsRailing_MAX,
};

// Enum FortniteGame.EBuildingWallArea
enum class EBuildingWallArea : uint8 {
	Regular,
	Flat,
	Special,
	EBuildingWallArea_MAX,
};

// Enum FortniteGame.EAssignmentType
enum class EAssignmentType : uint8 {
	Invalid,
	Encounter,
	World,
	Enemy,
	NumAssignmentTypes,
	EAssignmentType_MAX,
};

// Enum FortniteGame.EFortAILODLevel
enum class EFortAILODLevel : uint8 {
	Invalid,
	MIN,
	Dormant,
	BelowLower,
	Lower,
	AboveLower,
	BelowNormal,
	Normal,
	AboveNormal,
	MAX,
};

// Enum FortniteGame.EFortAnalyticsClientEngagementEventType
enum class EFortAnalyticsClientEngagementEventType : uint8 {
	None,
	DamageReceivedFromPlayerPawn,
	DamageDealtToPlayerPawn,
	DamageDealtToPlayerBuild,
	DamageDealtToOther,
	EngagementTimeout,
	PlayerWon,
	PlayerDeathOnWin,
	TeamWon,
	TeamLost,
	PlayerLost,
	PlayerKilledPlayer,
	PlayerFiredWeapon,
	ManagerStopped,
	PlayerPawnDied,
	PlayerPawnSpawned,
	Count,
	EFortAnalyticsClientEngagementEventType_MAX,
};

// Enum FortniteGame.EFortAnalyticsEventBlacklistPlaylistKey
enum class EFortAnalyticsEventBlacklistPlaylistKey : uint8 {
	PlaylistType,
	PlaylistName,
	All,
	EFortAnalyticsEventBlacklistPlaylistKey_MAX,
};

// Enum FortniteGame.EAlphaFromDeltaTypes
enum class EAlphaFromDeltaTypes : uint8 {
	TranslationX,
	TranslationY,
	TranslationZ,
	Scale,
	ScaleX,
	ScaleY,
	ScaleZ,
	EulerX,
	EulerY,
	EulerZ,
	QuaternionTwist,
	EAlphaFromDeltaTypes_MAX,
};

// Enum FortniteGame.ESkydivingDirection
enum class ESkydivingDirection : uint8 {
	Center,
	Right,
	Left,
	Forward,
	Back,
	ESkydivingDirection_MAX,
};

// Enum FortniteGame.EAnimRelaxedState
enum class EAnimRelaxedState : uint8 {
	None,
	WeaponRaised,
	RelaxedLevel1,
	RelaxedLevel2,
	EAnimRelaxedState_MAX,
};

// Enum FortniteGame.ESourceSelectionMode
enum class ESourceSelectionMode : uint8 {
	MaxDifference,
	ESourceSelectionMode_MAX,
};

// Enum FortniteGame.ESpeedWarpingAxisMode
enum class ESpeedWarpingAxisMode : uint8 {
	IKFootRootLocalX,
	IKFootRootLocalY,
	IKFootRootLocalZ,
	WorldSpaceVectorInput,
	ComponentSpaceVectorInput,
	ActorSpaceVectorInput,
	ESpeedWarpingAxisMode_MAX,
};

// Enum FortniteGame.EFortNotifyAudioParamsStoreSource
enum class EFortNotifyAudioParamsStoreSource : uint8 {
	Weapon,
	Pawn,
	Controller,
	EFortNotifyAudioParamsStoreSource_MAX,
};

// Enum FortniteGame.EMontageSyncTargetType
enum class EMontageSyncTargetType : uint8 {
	Pet,
	CustomPartType,
	EMontageSyncTargetType_MAX,
};

// Enum FortniteGame.EMontageInterrupt
enum class EMontageInterrupt : uint8 {
	Any,
	RootMotionOnly,
	None,
	EMontageInterrupt_MAX,
};

// Enum FortniteGame.EDeimosAnimState
enum class EDeimosAnimState : uint8 {
	Idle,
	Running,
	Attack,
	Dance,
	Dying,
	Died,
	FullBodyHitReact,
	AdditiveHitReact,
	ActiveIdle,
	Falling,
	Frozen,
	RangedAttack,
	Walking,
	Sprinting,
	EDeimosAnimState_MAX,
};

// Enum FortniteGame.EFortHandIKOverrideType
enum class EFortHandIKOverrideType : uint8 {
	UseDefault,
	ForceFK,
	ForceIK,
	ForceFKSnap,
	EFortHandIKOverrideType_MAX,
};

// Enum FortniteGame.EFortPlayerAnimBodyType
enum class EFortPlayerAnimBodyType : uint8 {
	Small,
	Medium,
	Large,
	All,
	EFortPlayerAnimBodyType_MAX,
};

// Enum FortniteGame.EFortCardinalDirection
enum class EFortCardinalDirection : uint8 {
	North,
	East,
	South,
	West,
	EFortCardinalDirection_MAX,
};

// Enum FortniteGame.EPlaneDirection
enum class EPlaneDirection : uint8 {
	Center,
	Right,
	Left,
	Up,
	Down,
	EPlaneDirection_MAX,
};

// Enum FortniteGame.EGliderType
enum class EGliderType : uint8 {
	HangGlider,
	Umbrella,
	Surfing,
	Cape,
	NoGlider,
	EGliderType_MAX,
};

// Enum FortniteGame.EFortFacialAnimTypes
enum class EFortFacialAnimTypes : uint8 {
	Default,
	FaceOnly,
	FullHead,
	FromAmplitude,
	Max,
};

// Enum FortniteGame.EWaxTokenState
enum class EWaxTokenState : uint8 {
	None,
	FirstSpline,
	Interpolation,
	LastSpline,
	Finished,
	EWaxTokenState_MAX,
};

// Enum FortniteGame.EAIBotBuildingTemplate
enum class EAIBotBuildingTemplate : uint8 {
	SingleWall,
	SingleRamp,
	SingleRoof,
	SingleBrace,
	SingleWallWindow,
	MAX,
};

// Enum FortniteGame.EBotNamingMode
enum class EBotNamingMode : uint8 {
	RealName,
	SkinName,
	Anonymous,
	Custom,
	EBotNamingMode_MAX,
};

// Enum FortniteGame.EReachLocationValidationMode
enum class EReachLocationValidationMode : uint8 {
	None,
	Storm,
	Leash,
	SoftLeash,
	EReachLocationValidationMode_MAX,
};

// Enum FortniteGame.EHarvestResult
enum class EHarvestResult : uint8 {
	None,
	InProgress,
	Success,
	Fail,
	EHarvestResult_MAX,
};

// Enum FortniteGame.EObstacleType
enum class EObstacleType : uint8 {
	IncomingSmashable,
	BlockingSmashable,
	BlockingDetectedTrap,
	Unknown,
	Count,
	EObstacleType_MAX,
};

// Enum FortniteGame.BotDataOverrideCosmeticMode
enum class BotDataOverrideCosmeticMode : uint8 {
	SpecificLoadout,
	CosmeticLibrary,
	BotDataOverrideCosmeticMode_MAX,
};

// Enum FortniteGame.EEvasiveManeuverType
enum class EEvasiveManeuverType : uint8 {
	Crouch,
	Dodge,
	Jump,
	JetpackStrafe,
	None,
	EEvasiveManeuverType_MAX,
};

// Enum FortniteGame.EFreeFallingMode
enum class EFreeFallingMode : uint8 {
	Idle,
	Random,
	TowardNearestAlly,
	EFreeFallingMode_MAX,
};

// Enum FortniteGame.EFocusingBehavior
enum class EFocusingBehavior : uint8 {
	FocusCurrentTarget,
	IgnoreThreatAfterTimer,
	IgnoreThreatAlways,
	LookAtInvestigate,
	LookAtHeardSound,
	LookAtScanAround,
	LookAtScanAroundOnly,
	Invalid,
	EFocusingBehavior_MAX,
};

// Enum FortniteGame.EAILootBlackListReason
enum class EAILootBlackListReason : uint8 {
	Invalid,
	ExecutionError,
	CannotReachLootLocation,
	OutsideSafeZoneRadius,
	NoInventorySpace,
	LootStateUnavailable,
	PathNotFound,
	GoalOffNavmesh,
	AgentBlocked,
	IsolatedIsland,
	UnsupportedItem,
	Count,
	EAILootBlackListReason_MAX,
};

// Enum FortniteGame.EBotMovementState
enum class EBotMovementState : uint8 {
	None,
	InProgress,
	Failed_NoPathFound,
	Failed_Aborted,
	Failed_AgentOffNavmesh,
	Failed_GoalOffNavmesh,
	Failed_Blocked,
	Failed_OffPath,
	Failed_Falling,
	Success,
	Success_Partial,
	EBotMovementState_MAX,
};

// Enum FortniteGame.EExecutionStatus
enum class EExecutionStatus : uint8 {
	ExecutionError,
	ExecutionDenied,
	ExecutionSuccess,
	ExecutionPending,
	ExecutionAllowed,
	EExecutionStatus_MAX,
};

// Enum FortniteGame.ELootElementType
enum class ELootElementType : uint8 {
	Pickup,
	Chest,
	SupplyDrop,
	Invalid,
	ELootElementType_MAX,
};

// Enum FortniteGame.ETeleportReason
enum class ETeleportReason : uint8 {
	AgentNotOnNavmesh,
	AgentDestinationNotOnNavMesh,
	AgentStuckInRepetitivePartialPaths,
	AgentBlocked,
	Unknown,
	ETeleportReason_MAX,
};

// Enum FortniteGame.EActionState
enum class EActionState : uint8 {
	TryingToEquip,
	EquippingItem,
	UsingItem,
	WaitingItemTermination,
	ActionEndedWithNoError,
	ActionEndedWithError,
	EActionState_MAX,
};

// Enum FortniteGame.EFreelookMode
enum class EFreelookMode : uint8 {
	None,
	Mouse,
	Analog,
	EFreelookMode_MAX,
};

// Enum FortniteGame.EExitCraftState
enum class EExitCraftState : uint8 {
	None,
	Spawned,
	Landed,
	SpawnBalloon,
	GettingIntoPosition,
	GettingIntoPosition_Simple,
	WaitingForPawns,
	Exiting,
	EExitCraftState_MAX,
};

// Enum FortniteGame.EFortExitRequirements
enum class EFortExitRequirements : uint8 {
	AnyPlayer,
	WholeSquad,
	EFortExitRequirements_MAX,
};

// Enum FortniteGame.EFortMutatorReturnValue
enum class EFortMutatorReturnValue : uint8 {
	Ignore,
	Override,
	OverrideReturn,
	EFortMutatorReturnValue_MAX,
};

// Enum FortniteGame.EAshtonStoneStateType
enum class EAshtonStoneStateType : uint8 {
	NotSpawned,
	Spawned,
	Captured,
	MAX,
};

// Enum FortniteGame.EAshtonStoneType
enum class EAshtonStoneType : uint8 {
	Purple,
	Blue,
	Red,
	Orange,
	Green,
	Yellow,
	MAX,
};

// Enum FortniteGame.EBagelDifficulty
enum class EBagelDifficulty : uint8 {
	Easy,
	Medium,
	Hard,
	EBagelDifficulty_MAX,
};

// Enum FortniteGame.EBagelScoreEvent
enum class EBagelScoreEvent : uint8 {
	FiendKill,
	BruteKill,
	RangedKill,
	ExplodingKill,
	ChillKill,
	PoisonKill,
	GoldKill,
	RiftDestroyed,
	ScoreMultiplierUsed,
	HeadshotKill,
	RespawnPenalty,
	AmmoBoxOpened,
	ChestOpened,
	FinalBossKill,
	MAX,
};

// Enum FortniteGame.EBagelPhase
enum class EBagelPhase : uint8 {
	NotStarted,
	Preparation,
	Survival,
	AfterMath,
	Moving,
	FinalPhase,
	FinalPhaseFullStorm,
	MAX,
};

// Enum FortniteGame.EBarrierObjectiveDamageState
enum class EBarrierObjectiveDamageState : uint8 {
	Health_76,
	Health_51,
	Health_26,
	Health_11,
	Health_6,
	Health_5,
	Health_4,
	Health_3,
	Health_2,
	MAX,
};

// Enum FortniteGame.EBarrierFoodTeam
enum class EBarrierFoodTeam : uint8 {
	Burger,
	Tomato,
	MAX,
};

// Enum FortniteGame.EAllowedToEdit
enum class EAllowedToEdit : uint8 {
	Default,
	Anyone,
	EAllowedToEdit_MAX,
};

// Enum FortniteGame.ECreativeRespawnWaveType
enum class ECreativeRespawnWaveType : uint8 {
	None,
	WaveStartingOnElimination,
	ECreativeRespawnWaveType_MAX,
};

// Enum FortniteGame.EFortCrucibleWorkType
enum class EFortCrucibleWorkType : uint8 {
	Invalid,
	SetupPlayer,
	GetFriendsList,
	GetFriendsStats,
	GetGlobalLeaderboard,
	GetDisplayNames,
	EFortCrucibleWorkType_MAX,
};

// Enum FortniteGame.EFortCrucibleLeaderboardState
enum class EFortCrucibleLeaderboardState : uint8 {
	Disabled,
	ReadyForQuery,
	WaitingForQueryResults,
	NeedsUserInfoQueried,
	Complete,
	EFortCrucibleLeaderboardState_MAX,
};

// Enum FortniteGame.EFortCrucibleLeaderboardId
enum class EFortCrucibleLeaderboardId : uint8 {
	GlobalGamepad,
	GlobalKBM,
	GlobalTouch,
	GlobalAll,
	FriendsGamepad,
	FriendsKBM,
	FriendsTouch,
	FriendsAll,
	Count,
	EFortCrucibleLeaderboardId_MAX,
};

// Enum FortniteGame.EFortCrucibleStatSource
enum class EFortCrucibleStatSource : uint8 {
	None,
	Backend,
	CurrentSession,
	EFortCrucibleStatSource_MAX,
};

// Enum FortniteGame.EFortCrucibleStatId
enum class EFortCrucibleStatId : uint8 {
	Gamepad_CourseOverall,
	Gamepad_CourseSegment1,
	Gamepad_CourseSegment2,
	Gamepad_CourseSegment3,
	Gamepad_CourseSegment4,
	Gamepad_CourseSegment5,
	KBM_CourseOverall,
	KBM_CourseSegment1,
	KBM_CourseSegment2,
	KBM_CourseSegment3,
	KBM_CourseSegment4,
	KBM_CourseSegment5,
	Touch_CourseOverall,
	Touch_CourseSegment1,
	Touch_CourseSegment2,
	Touch_CourseSegment3,
	Touch_CourseSegment4,
	Touch_CourseSegment5,
	Count,
	EFortCrucibleStatId_MAX,
};

// Enum FortniteGame.EFortCrucibleControlType
enum class EFortCrucibleControlType : uint8 {
	Gamepad,
	KBM,
	Touch,
	Count,
	EFortCrucibleControlType_MAX,
};

// Enum FortniteGame.EFortCrucibleStatType
enum class EFortCrucibleStatType : uint8 {
	CourseOverall,
	CourseSegment1,
	CourseSegment2,
	CourseSegment3,
	CourseSegment4,
	CourseSegment5,
	Count,
	EFortCrucibleStatType_MAX,
};

// Enum FortniteGame.EDadBroState
enum class EDadBroState : uint8 {
	NotYet,
	Initializing,
	Active,
	EDadBroState_MAX,
};

// Enum FortniteGame.EDBNOMutatorType
enum class EDBNOMutatorType : uint8 {
	Default,
	On,
	Off,
	EDBNOMutatorType_MAX,
};

// Enum FortniteGame.EControlPointState
enum class EControlPointState : uint8 {
	None,
	Disabled,
	Enabled,
	EControlPointState_MAX,
};

// Enum FortniteGame.EEnvironmentDamageFilter
enum class EEnvironmentDamageFilter : uint8 {
	Off,
	PlayerBuiltOnly,
	All,
	EEnvironmentDamageFilter_MAX,
};

// Enum FortniteGame.EBuildingDamageTeamFilter
enum class EBuildingDamageTeamFilter : uint8 {
	Default,
	OwnerOnly,
	TeamOnly,
	EnemyOnly,
	EnemyAndOwnerOnly,
	None,
	EBuildingDamageTeamFilter_MAX,
};

// Enum FortniteGame.EEQSActorSpawnerStopSpawningReason
enum class EEQSActorSpawnerStopSpawningReason : uint8 {
	Success,
	ManualStop,
	Requeued,
	RanOutOfRetries,
	EEQSActorSpawnerStopSpawningReason_MAX,
};

// Enum FortniteGame.EEQSActorSpawnerSpawnType
enum class EEQSActorSpawnerSpawnType : uint8 {
	Actor,
	AIPawn,
	Pickup,
	EEQSActorSpawnerSpawnType_MAX,
};

// Enum FortniteGame.EEQSActorSpawnerTriggerType
enum class EEQSActorSpawnerTriggerType : uint8 {
	Manual,
	SafeZoneState,
	EEQSActorSpawnerTriggerType_MAX,
};

// Enum FortniteGame.EAthenaMutatorEvaluators
enum class EAthenaMutatorEvaluators : uint8 {
	NoOverride,
	ForceOverride,
	Add,
	Multiply,
	EAthenaMutatorEvaluators_MAX,
};

// Enum FortniteGame.EHeistExitCraftState
enum class EHeistExitCraftState : uint8 {
	None,
	Incoming,
	Spawned,
	Exited,
	EHeistExitCraftState_MAX,
};

// Enum FortniteGame.EFortReticleVisibiltyOption
enum class EFortReticleVisibiltyOption : uint8 {
	DoNotOverride,
	ShowAlways,
	ShowPickaxeOnly,
	ShowNonPickaxeOnly,
	HideAlways,
	EFortReticleVisibiltyOption_MAX,
};

// Enum FortniteGame.EFortHUDElementVisibiltyOption
enum class EFortHUDElementVisibiltyOption : uint8 {
	DoNotOverride,
	ShowElement,
	HideElement,
	EFortHUDElementVisibiltyOption_MAX,
};

// Enum FortniteGame.EInfiltrationTeam
enum class EInfiltrationTeam : uint8 {
	Attacking,
	Defending,
	NumOfTeams,
	EInfiltrationTeam_MAX,
};

// Enum FortniteGame.EAthenaInventorySpawnOverride
enum class EAthenaInventorySpawnOverride : uint8 {
	NoOverride,
	Always,
	IntialSpawn,
	AircraftPhaseOnly,
	AfterWarmup,
	EAthenaInventorySpawnOverride_MAX,
};

// Enum FortniteGame.EAthenaLootDropOverride
enum class EAthenaLootDropOverride : uint8 {
	NoOverride,
	ForceDrop,
	ForceKeep,
	ForceDestroy,
	ForceDropUnlessRespawning,
	ForceDestroyUnlessRespawning,
	DropUnlessTeamSelectionUpdated,
	EAthenaLootDropOverride_MAX,
};

// Enum FortniteGame.ERespawnRequirements
enum class ERespawnRequirements : uint8 {
	RespawnOnly,
	NoRespawnOnly,
	Both,
	ERespawnRequirements_MAX,
};

// Enum FortniteGame.ECustomLootSelection
enum class ECustomLootSelection : uint8 {
	Default,
	HighExplosives,
	CloseEncounters,
	SolidGold,
	WildWest,
	SniperShootout,
	OneShot,
	ECustomLootSelection_MAX,
};

// Enum FortniteGame.EMashDifficulty
enum class EMashDifficulty : uint8 {
	Easy,
	Medium,
	Hard,
	EMashDifficulty_MAX,
};

// Enum FortniteGame.EMashScoreEvent
enum class EMashScoreEvent : uint8 {
	FiendKill,
	BruteKill,
	RangedKill,
	ExplodingKill,
	ChillKill,
	PoisonKill,
	GoldKill,
	RiftDestroyed,
	ScoreMultiplierUsed,
	HeadshotKill,
	RespawnPenalty,
	AmmoBoxOpened,
	ChestOpened,
	FinalBossKill,
	MAX,
};

// Enum FortniteGame.EMashPhase
enum class EMashPhase : uint8 {
	NotStarted,
	Preparation,
	Survival,
	AfterMath,
	Moving,
	FinalPhase,
	FinalPhaseFullStorm,
	MAX,
};

// Enum FortniteGame.EMatchConditionMutatorTeamStatus
enum class EMatchConditionMutatorTeamStatus : uint8 {
	None,
	Won,
	Lost,
	Placed,
	EMatchConditionMutatorTeamStatus_MAX,
};

// Enum FortniteGame.EIndicatorDisplayMode
enum class EIndicatorDisplayMode : uint8 {
	Default,
	Always,
	Never,
	MiniMap,
	EIndicatorDisplayMode_MAX,
};

// Enum FortniteGame.EOmahaTeam
enum class EOmahaTeam : uint8 {
	Home,
	Away,
	MAX,
};

// Enum FortniteGame.EOperationsTeamFaction
enum class EOperationsTeamFaction : uint8 {
	Alter,
	Ego,
	NumFactions,
	EOperationsTeamFaction_MAX,
};

// Enum FortniteGame.EPlayerDamageHeightRatioDetectionType
enum class EPlayerDamageHeightRatioDetectionType : uint8 {
	None,
	FromBottom,
	FromTop,
	EPlayerDamageHeightRatioDetectionType_MAX,
};

// Enum FortniteGame.ERespawnAndSpectateServerPayloadId
enum class ERespawnAndSpectateServerPayloadId : uint8 {
	SpectateTargetSelected,
	RespawnTargetSelected,
	SpectateAndRespawnTargetSelected,
	ERespawnAndSpectateServerPayloadId_MAX,
};

// Enum FortniteGame.ERespawnAndSpectateClientEventId
enum class ERespawnAndSpectateClientEventId : uint8 {
	ShowUI,
	HideUI,
	ShowRespawnAvailableUI,
	MAX,
};

// Enum FortniteGame.EShowPlacardPhase
enum class EShowPlacardPhase : uint8 {
	None,
	StartShow,
	WaitBeforeInitialFadeOut,
	PreShowFadeOut,
	Show,
	FadeOut,
	PostShowFadeIn,
	DoneShowingScreen,
	MAX,
};

// Enum FortniteGame.ESkyCapState
enum class ESkyCapState : uint8 {
	Hidden,
	StormStarting,
	ESkyCapState_MAX,
};

// Enum FortniteGame.ESynchronizedTeleportHealthAndShieldResetType
enum class ESynchronizedTeleportHealthAndShieldResetType : uint8 {
	None,
	EvaluateHealthAndShieldMutators,
	MaxHealth,
	ESynchronizedTeleportHealthAndShieldResetType_MAX,
};

// Enum FortniteGame.EAthenaTODPostProcess
enum class EAthenaTODPostProcess : uint8 {
	NoOverride,
	Blueprint1,
	Blueprint2,
	Blueprint3,
	Blueprint4,
	Blueprint5,
	Blueprint6,
	Blueprint7,
	Blueprint8,
	Blueprint9,
	Blueprint10,
	Blueprint11,
	EAthenaTODPostProcess_MAX,
};

// Enum FortniteGame.EAthenaTODColor
enum class EAthenaTODColor : uint8 {
	NoOverride,
	Black,
	White,
	Red,
	Green,
	Blue,
	Yellow,
	Magenta,
	Cyan,
	EAthenaTODColor_MAX,
};

// Enum FortniteGame.EAthenaFogDensityOverride
enum class EAthenaFogDensityOverride : uint8 {
	NoOverride,
	Fog0,
	Fog1,
	Fog2,
	Fog3,
	Fog4,
	Fog5,
	Fog6,
	Fog7,
	Fog8,
	Fog9,
	Fog10,
	EAthenaFogDensityOverride_MAX,
};

// Enum FortniteGame.EAthenaLightIntensityOverride
enum class EAthenaLightIntensityOverride : uint8 {
	NoOverride,
	Intensity0,
	Intensity1,
	Intensity2,
	Intensity3,
	Intensity4,
	Intensity5,
	Intensity6,
	Intensity7,
	Intensity8,
	Intensity9,
	Intensity10,
	EAthenaLightIntensityOverride_MAX,
};

// Enum FortniteGame.EAthenaTimeOfDayOverride
enum class EAthenaTimeOfDayOverride : uint8 {
	NoOverride,
	ForceDay,
	ForceNight,
	Custom,
	Hour0,
	Hour1,
	Hour2,
	Hour3,
	Hour4,
	Hour5,
	Hour6,
	Hour7,
	Hour8,
	Hour9,
	Hour10,
	Hour11,
	Hour12,
	Hour13,
	Hour14,
	Hour15,
	Hour16,
	Hour17,
	Hour18,
	Hour19,
	Hour20,
	Hour21,
	Hour22,
	Hour23,
	Random,
	EAthenaTimeOfDayOverride_MAX,
};

// Enum FortniteGame.EUraniumGameEndedReason
enum class EUraniumGameEndedReason : uint8 {
	GameIsStillInProgress,
	AllRoundsPlayed,
	EarlyGameEnd_BlowOut,
	EarlyGameEnd_OutNumbered,
	EUraniumGameEndedReason_MAX,
};

// Enum FortniteGame.EFortAthenaMutator_VoiceChatChannelType
enum class EFortAthenaMutator_VoiceChatChannelType : uint8 {
	Default,
	None,
	SquadOnly,
	TeamOnly,
	WholeServer,
	ScopeOnly,
	ScopeSquadOnly,
	ScopeTeamOnly,
	EFortAthenaMutator_MAX,
};

// Enum FortniteGame.EWaxState
enum class EWaxState : uint8 {
	None,
	SomewhatVisible,
	ModeratelyVisible,
	VeryVisible,
	Undeniable,
	EWaxState_MAX,
};

// Enum FortniteGame.EWaxMinimapDrawMode
enum class EWaxMinimapDrawMode : uint8 {
	NoDrawing,
	DrawCloseAndMoveOrShoot,
	DrawMoveOrShoot,
	DrawAlways,
	EWaxMinimapDrawMode_MAX,
};

// Enum FortniteGame.EEncampmentRole
enum class EEncampmentRole : uint8 {
	Guard,
	Build,
	Count,
	EEncampmentRole_MAX,
};

// Enum FortniteGame.EPatrollingMode
enum class EPatrollingMode : uint8 {
	BackAndForth,
	Loop,
	EPatrollingMode_MAX,
};

// Enum FortniteGame.ECoastState
enum class ECoastState : uint8 {
	Idle,
	Mount,
	Coasting,
	Pedaling,
	PreDismount,
	Dismount,
	EndCoast,
	ECoastState_MAX,
};

// Enum FortniteGame.EFortAthenaTutorial_StandaloneStep
enum class EFortAthenaTutorial_StandaloneStep : uint8 {
	None,
	HealingInterrupted,
	Count,
	EFortAthenaTutorial_MAX,
};

// Enum FortniteGame.EDebugVehicleFlags
enum class EDebugVehicleFlags : uint8 {
	Status,
	Input,
	Shocks,
	Exits,
	Water,
	Wheels,
	Friction,
	AirControl,
	CenterOfMass,
	Gravity,
	Forces,
	Damage,
	Collisions,
	OrientationCorrection,
	BoundarySpline,
	Sleeping,
	Misc,
	LeanBreak,
	EDebugVehicleFlags_MAX,
};

// Enum FortniteGame.EBounceCompressionState
enum class EBounceCompressionState : uint8 {
	None,
	Crouching,
	Crouched,
	Jumping,
	Recoiling,
	EBounceCompressionState_MAX,
};

// Enum FortniteGame.ENaturalSlideState
enum class ENaturalSlideState : uint8 {
	None,
	Entering,
	InProgress,
	Exiting,
	ENaturalSlideState_MAX,
};

// Enum FortniteGame.EPowerSlideState
enum class EPowerSlideState : uint8 {
	None,
	Entering,
	InProgress,
	Exiting,
	EPowerSlideState_MAX,
};

// Enum FortniteGame.EFortFuelGadgetVisualType
enum class EFortFuelGadgetVisualType : uint8 {
	FuelMeter,
	ChargeText,
	Invalid,
	EFortFuelGadgetVisualType_MAX,
};

// Enum FortniteGame.EFortAttributeDisplay
enum class EFortAttributeDisplay : uint8 {
	BasicInt,
	NegativeImpliesInfiniteInt,
	BasicFloat,
	NegativeImpliesInfiniteFloat,
	BasicString,
	NormalizedPercentage,
	StringArray,
	SlateBrush,
	DoNotDisplay,
	None_Max,
	EFortAttributeDisplay_MAX,
};

// Enum FortniteGame.EAudioAnalysisParameterTypes
enum class EAudioAnalysisParameterTypes : uint8 {
	Scalar,
	Vector4,
	Count,
	EAudioAnalysisParameterTypes_MAX,
};

// Enum FortniteGame.EVectorCurveType
enum class EVectorCurveType : uint8 {
	Original,
	Modified,
	EVectorCurveType_MAX,
};

// Enum FortniteGame.EVectorCurveFloat
enum class EVectorCurveFloat : uint8 {
	VectorCurve_X,
	VectorCurve_Y,
	VectorCurve_Z,
	VectorCurve_MAX,
};

// Enum FortniteGame.EAudioShapeComponentState
enum class EAudioShapeComponentState : uint8 {
	Inactive,
	Active,
	Count,
	EAudioShapeComponentState_MAX,
};

// Enum FortniteGame.EBiplaneSimEvent
enum class EBiplaneSimEvent : uint8 {
	EngineStart,
	EngineStop,
	Takeoff,
	Landing,
	BoostBegin,
	BoostEnd,
	BoostChargeAboveThreshold,
	AileronRoll,
	ControlContextChange,
	EBiplaneSimEvent_MAX,
};

// Enum FortniteGame.EAileronRollDirection
enum class EAileronRollDirection : uint8 {
	None,
	Right,
	Left,
	EAileronRollDirection_MAX,
};

// Enum FortniteGame.EDoghouseControlMode
enum class EDoghouseControlMode : uint8 {
	GroundControls,
	AirControls,
	MaxCount,
	EDoghouseControlMode_MAX,
};

// Enum FortniteGame.EIDScannerResult
enum class EIDScannerResult : uint8 {
	Success_PlayerBelongsToFaction,
	Success_DownedPlayer,
	Success_DownedGuard,
	Success_PlayerIsDisguised,
	Failure_NotFromFaction,
	Other,
	EIDScannerResult_MAX,
};

// Enum FortniteGame.EEnvironmentalItemEndReason
enum class EEnvironmentalItemEndReason : uint8 {
	None,
	PlayerExit,
	PlayerDeath,
	ObjectDestroyed,
	EEnvironmentalItemEndReason_MAX,
};

// Enum FortniteGame.ESpawnResult
enum class ESpawnResult : uint8 {
	Success,
	Failure_NoLocationFound,
	Failure_NoActorClass,
	Failure_BadQueryData,
	ESpawnResult_MAX,
};

// Enum FortniteGame.EFortBuildingSoundType
enum class EFortBuildingSoundType : uint8 {
	Construction,
	GenericDestruction,
	PlayerBuiltDestruction,
	None,
	EFortBuildingSoundType_MAX,
};

// Enum FortniteGame.EFortUICameraFrameTargetBoundingBehavior
enum class EFortUICameraFrameTargetBoundingBehavior : uint8 {
	NoBounds,
	AllBounds,
	TopBoundOnly,
	EFortUICameraFrameTargetBoundingBehavior_MAX,
};

// Enum FortniteGame.ECameraOrigin
enum class ECameraOrigin : uint8 {
	ViewTargetTransform,
	BoneTransform,
	ECameraOrigin_MAX,
};

// Enum FortniteGame.EChallengeBundleQuestUnlockType
enum class EChallengeBundleQuestUnlockType : uint8 {
	Manually,
	GrantWithBundle,
	RequiresBattlePass,
	DaysFromEventStart,
	ChallengesCompletedToUnlock,
	BundleLevelup,
	EChallengeBundleQuestUnlockType_MAX,
};

// Enum FortniteGame.EChallengeScheduleUnlockType
enum class EChallengeScheduleUnlockType : uint8 {
	Manually,
	OnScheduleGranted,
	DaysSinceEventStart,
	EChallengeScheduleUnlockType_MAX,
};

// Enum FortniteGame.EBundleStyleColor
enum class EBundleStyleColor : uint8 {
	Primary,
	Secondary,
	Accent,
	EBundleStyleColor_MAX,
};

// Enum FortniteGame.EManagedCosmeticType
enum class EManagedCosmeticType : uint8 {
	Glider,
	GliderAnimSet,
	Pickaxe,
	Pet,
	ItemWrap,
	Charm,
	MAX_COUNT,
	EManagedCosmeticType_MAX,
};

// Enum FortniteGame.EFortCustomMovement
enum class EFortCustomMovement : uint8 {
	Default,
	Driving,
	Passenger,
	Parachuting,
	Skydiving,
	SkydiveFollowing,
	Hover,
	RemoteControl_Flying,
	Ziplining,
	ZipliningOnSpline,
	Ballooning,
	SurfaceSwimming,
	DBNOCarried,
	Floating,
	Goop,
	EFortCustomMovement_MAX,
};

// Enum FortniteGame.EOstrichDetonationState
enum class EOstrichDetonationState : uint8 {
	None,
	Detonate,
	SelfDestruct,
	Instant,
	EOstrichDetonationState_MAX,
};

// Enum FortniteGame.EChatRoomJoinHelperState
enum class EChatRoomJoinHelperState : uint8 {
	Ready,
	AttemptingJoin,
	Joined,
	AttemptingLeave,
	EChatRoomJoinHelperState_MAX,
};

// Enum FortniteGame.EFortAnnouncementDisplayPreference
enum class EFortAnnouncementDisplayPreference : uint8 {
	Default_HUD,
	QuestIntroduction,
	QuestJournal,
	EFortAnnouncementDisplayPreference_MAX,
};

// Enum FortniteGame.EFortAnnouncementChannel
enum class EFortAnnouncementChannel : uint8 {
	Primary,
	Conversation,
	Tutorial,
	Max_None,
	EFortAnnouncementChannel_MAX,
};

// Enum FortniteGame.EFortAnnouncementDelivery
enum class EFortAnnouncementDelivery : uint8 {
	Created,
	Received,
	Ignored,
	Active,
	Stopped,
	Max_None,
	EFortAnnouncementDelivery_MAX,
};

// Enum FortniteGame.ECreativeBotItemTestingState
enum class ECreativeBotItemTestingState : uint8 {
	ITS_NONE,
	ITS_Teleporting,
	ITS_Landing,
	ITS_Grant,
	ITS_Equip,
	ITS_Place,
	ITS_Cleanup,
	ITS_MAX,
};

// Enum FortniteGame.ECreativeBotIslandLoadingState
enum class ECreativeBotIslandLoadingState : uint8 {
	ILS_NONE,
	ILS_LoadNotStarted,
	ILS_GrantPlotItem,
	ILS_WaitingUserPlotReady,
	ILS_LoadInProgress,
	ILS_LoadComplete,
	ILS_Teleporting,
	ILS_Returning,
	ILS_Items,
	ILS_MAX,
};

// Enum FortniteGame.ECreativeBotIslandIterationType
enum class ECreativeBotIslandIterationType : uint8 {
	CBI_NONE,
	CBI_Mnemonics,
	CBI_User,
	CBI_MAX,
};

// Enum FortniteGame.ELicensedAudioTreatment
enum class ELicensedAudioTreatment : uint8 {
	None,
	MuteOthers,
	MuteAll,
	ELicensedAudioTreatment_MAX,
};

// Enum FortniteGame.ESelectableVoiceChatSetting
enum class ESelectableVoiceChatSetting : uint8 {
	Off,
	FriendsOnly,
	Everyone,
	ESelectableVoiceChatSetting_MAX,
};

// Enum FortniteGame.EFortAutoMulchMode
enum class EFortAutoMulchMode : uint8 {
	Off,
	Common,
	Uncommon,
	Rare,
	Epic,
	Num,
	EFortAutoMulchMode_MAX,
};

// Enum FortniteGame.EFortAutoMulchCategory
enum class EFortAutoMulchCategory : uint8 {
	Invalid,
	Weapon,
	Trap,
	Survivor,
	Defender,
	Hero,
	Num,
	EFortAutoMulchCategory_MAX,
};

// Enum FortniteGame.EQuestMapScreenMode
enum class EQuestMapScreenMode : uint8 {
	Invalid,
	MainCampaign,
	Event,
	EQuestMapScreenMode_MAX,
};

// Enum FortniteGame.EFortAllowBackgroundAudioSetting
enum class EFortAllowBackgroundAudioSetting : uint8 {
	Off,
	NotificationsOnly,
	AllSounds,
	Num,
	EFortAllowBackgroundAudioSetting_MAX,
};

// Enum FortniteGame.EAndroidAppStoreTypes
enum class EAndroidAppStoreTypes : uint8 {
	Unset,
	Epic,
	Samsung,
	EAndroidAppStoreTypes_MAX,
};

// Enum FortniteGame.EColorBlindMode
enum class EColorBlindMode : uint8 {
	Off,
	Deuteranope,
	Protanope,
	Tritanope,
	EColorBlindMode_MAX,
};

// Enum FortniteGame.ECloudFileState
enum class ECloudFileState : uint8 {
	Unitialized,
	Saving,
	Loading,
	Idle,
	ECloudFileState_MAX,
};

// Enum FortniteGame.ECodeTokenPlatform
enum class ECodeTokenPlatform : uint8 {
	PC,
	PS4,
	XBOX,
	ECodeTokenPlatform_MAX,
};

// Enum FortniteGame.EFortCollectionBookState
enum class EFortCollectionBookState : uint8 {
	Active,
	Completed,
	Claimed,
	EFortCollectionBookState_MAX,
};

// Enum FortniteGame.EFortPIDValueGraphElements
enum class EFortPIDValueGraphElements : uint8 {
	Proportional,
	Integral,
	Max_None,
	EFortPIDValueGraphElements_MAX,
};

// Enum FortniteGame.EFortIntensityGraphElements
enum class EFortIntensityGraphElements : uint8 {
	ActualIntensity,
	DesiredIntensity,
	Max_None,
	EFortIntensityGraphElements_MAX,
};

// Enum FortniteGame.EFortContributionGraphElements
enum class EFortContributionGraphElements : uint8 {
	ProportionalLine,
	IntegralLine,
	TotalLine,
	PendingLine,
	ActionLine,
	Max_None,
	EFortContributionGraphElements_MAX,
};

// Enum FortniteGame.EFortFactorContributionType
enum class EFortFactorContributionType : uint8 {
	CurrentValue_Direct,
	CurrentValue_Inverse,
	AverageValue_Direct,
	AverageValue_Inverse,
	EFortFactorContributionType_MAX,
};

// Enum FortniteGame.EFortAIDirectorFactor
enum class EFortAIDirectorFactor : uint8 {
	PlayerDamageThreat,
	ObjectiveDamageThreat,
	ObjectivePathCost,
	PlayerPathCost,
	PlayerMovement,
	TrapsEffective,
	PlayerWander,
	NearbyEnemyPresence,
	OffensiveResources,
	DefensiveResources,
	Boredom,
	ArtilleryVulnerability,
	Max_None,
	EFortAIDirectorFactor_MAX,
};

// Enum FortniteGame.EFortCombatFactors
enum class EFortCombatFactors : uint8 {
	PlayerDamageThreat,
	ObjectiveDamageThreat,
	ObjectivePathCost,
	PlayerPathCost,
	PlayerMovement,
	TrapsEffective,
	PlayerWander,
	NearbyEnemyPresence,
	OffensiveResources,
	DefensiveResources,
	Boredom,
	ArtilleryVulnerability,
	Max_None,
	EFortCombatFactors_MAX,
};

// Enum FortniteGame.EFortCombatEventContribution
enum class EFortCombatEventContribution : uint8 {
	Linear,
	Inverse,
	Accumulator,
	Max_None,
	EFortCombatEventContribution_MAX,
};

// Enum FortniteGame.EFortCombatEvents
enum class EFortCombatEvents : uint8 {
	HuskFollowing,
	SmasherFollowing,
	TrollFollowing,
	FlingerFollowing,
	TakerFollowing,
	HuskCombatNearby,
	SmasherCombatNearby,
	TrollCombatNearby,
	FlingerCombatNearby,
	TakerCombatNearby,
	PlayerTakeDamage,
	PlayerHealth,
	PlayerLookAtEnemy,
	PlayerDamageEnemy,
	PlayerKilledEnemy,
	AtlasTakeDamage,
	AtlasHealth,
	AtlasDestroyed,
	TrapFiring,
	BuildingTakeDamage,
	FoodHealingPotential,
	PlayerAmmo,
	EnemiesNear,
	PlayerMovement,
	BuildingDamagedNearObjective,
	TrapDamageEnemy,
	ObjectivePathCost,
	PlayerPathCost,
	Max_None,
	EFortCombatEvents_MAX,
};

// Enum FortniteGame.EFortAIDirectorEventParticipant
enum class EFortAIDirectorEventParticipant : uint8 {
	Target,
	Source,
	Either,
	Max_None,
	EFortAIDirectorEventParticipant_MAX,
};

// Enum FortniteGame.EFortCombatThresholds
enum class EFortCombatThresholds : uint8 {
	Low,
	Medium,
	High,
	Extreme,
	Max_None,
	EFortCombatThresholds_MAX,
};

// Enum FortniteGame.EFortWeaponCoreAnimation
enum class EFortWeaponCoreAnimation : uint8 {
	Melee,
	Pistol,
	Shotgun,
	PaperBlueprint,
	Rifle,
	MeleeOneHand,
	MachinePistol,
	RocketLauncher,
	GrenadeLauncher,
	GoingCommando,
	AssaultRifle,
	TacticalShotgun,
	SniperRifle,
	TrapPlacement,
	ShoulderLauncher,
	AbilityDecoTool,
	Crossbow,
	C4,
	RemoteControl,
	DualWield,
	AR_BullPup,
	AR_ForwardGrip,
	MedPackPaddles,
	SMG_P90,
	AR_DrumGun,
	Consumable_Small,
	Consumable_Large,
	Balloon,
	MountedTurret,
	CreativeTool,
	ExplosiveBow,
	AshtonIndigo,
	AshtonChicago,
	MeleeDualWield,
	MAX,
};

// Enum FortniteGame.EFortTargetingFXState
enum class EFortTargetingFXState : uint8 {
	TargetingStart,
	TargetingEnd,
	Max_None,
	EFortTargetingFXState_MAX,
};

// Enum FortniteGame.EFortReloadFXState
enum class EFortReloadFXState : uint8 {
	ReloadStart,
	ReloadCartridge,
	ReloadEnd,
	Max_None,
	EFortReloadFXState_MAX,
};

// Enum FortniteGame.EFortWeaponSoundChannel
enum class EFortWeaponSoundChannel : uint8 {
	NormalA,
	NormalB,
	LowAmmo,
	Degraded,
	Max_None,
	EFortWeaponSoundChannel_MAX,
};

// Enum FortniteGame.EFortWeaponSoundState
enum class EFortWeaponSoundState : uint8 {
	Normal,
	LowAmmo,
	Degraded,
	Max_None,
	EFortWeaponSoundState_MAX,
};

// Enum FortniteGame.EFortMontageInputType
enum class EFortMontageInputType : uint8 {
	WindowClickOrHold,
	WindowHoldOnly,
	InstantClick,
	EFortMontageInputType_MAX,
};

// Enum FortniteGame.EFortAmmoType
enum class EFortAmmoType : uint8 {
	Pistol,
	Shotgun,
	Assault,
	Sniper,
	Energy,
	EFortAmmoType_MAX,
};

// Enum FortniteGame.EFortConditionalResourceItemTest
enum class EFortConditionalResourceItemTest : uint8 {
	CanEarnMtx,
	EFortConditionalResourceItemTest_MAX,
};

// Enum FortniteGame.EFortContentEncryptionAllowedReferences
enum class EFortContentEncryptionAllowedReferences : uint8 {
	None,
	SoftOnly,
	Any,
	EFortContentEncryptionAllowedReferences_MAX,
};

// Enum FortniteGame.EFortContentEncryptionCollectionGrouping
enum class EFortContentEncryptionCollectionGrouping : uint8 {
	Individual,
	Combined,
	ByCosmeticSet,
	EFortContentEncryptionCollectionGrouping_MAX,
};

// Enum FortniteGame.EFortEncryptionStatus
enum class EFortEncryptionStatus : uint8 {
	ENCRYPTED,
	RELEASED,
	EFortEncryptionStatus_MAX,
};

// Enum FortniteGame.EFortContextualTutorialPlatform
enum class EFortContextualTutorialPlatform : uint8 {
	Any,
	PcAndConsole,
	Mobile,
	EFortContextualTutorialPlatform_MAX,
};

// Enum FortniteGame.ECollectionsComponentValidityResult
enum class ECollectionsComponentValidityResult : uint8 {
	IsValid,
	IsNotValid,
	ECollectionsComponentValidityResult_MAX,
};

// Enum FortniteGame.EContextualEvent
enum class EContextualEvent : uint8 {
	Generic,
	Location,
	InventoryAdded,
	InventoryRemoved,
	StartSkydiving,
	NewQuests,
	EContextualEvent_MAX,
};

// Enum FortniteGame.EContextualContext
enum class EContextualContext : uint8 {
	DoNotShow,
	BusPhase,
	Skydiving,
	Gameplay,
	EContextualContext_MAX,
};

// Enum FortniteGame.EShareActorWithMask
enum class EShareActorWithMask : uint8 {
	None,
	SquadOnTeam,
	AllTeam,
	Target,
	EShareActorWithMask_MAX,
};

// Enum FortniteGame.EShareActorWith
enum class EShareActorWith : uint8 {
	None,
	SquadOnTeam,
	AllTeam,
	EShareActorWith_MAX,
};

// Enum FortniteGame.EIndicatorStateImage
enum class EIndicatorStateImage : uint8 {
	FIRST_FRIENDLY_STATE,
	Default,
	InCombat,
	DBNO,
	BeingRevived,
	Dead,
	LAST_FRIENDLY_STATE,
	FIRST_CHAT_MESSAGE,
	NeedAmmoHeavy,
	NeedAmmoLight,
	NeedAmmoMedium,
	NeedAmmoShells,
	NeedAmmoRocket,
	ChatBubble,
	EnemySpotted,
	NeedBandages,
	NeedMaterials,
	NeedShields,
	NeedWeapon,
	LAST_CHAT_MESSAGE,
	FIRST_MATE_STATE,
	Squadmate,
	Teammate,
	LAST_MATE_STATE,
	FIRST_ENEMY_STATE,
	Enemy,
	LAST_ENEMY_STATE,
	FIRST_NPC_STATE,
	FriendlyNPC,
	EnemyNPC,
	EliteFriendlyNPC,
	EliteEnemyNPC,
	LAST_NPC_STATE,
	FIRST_WORLDITEM_STATE,
	Interactable,
	InteractableLarge,
	GameplayItem,
	TreasureChest,
	LAST_WORLDITEM_STATE,
	FIRST_HARDCORE_STATE,
	HardCoreBeacon,
	LAST_HARDCORE_STATE,
	LAST_STATE,
	None,
	MAX,
};

// Enum FortniteGame.ETouchInteractMode
enum class ETouchInteractMode : uint8 {
	Off,
	InWorld,
	Buttons,
	ETouchInteractMode_MAX,
};

// Enum FortniteGame.EStashInventoryServiceSyncState
enum class EStashInventoryServiceSyncState : uint8 {
	Uninitialized,
	Syncing,
	Ready,
	EStashInventoryServiceSyncState_MAX,
};

// Enum FortniteGame.EMinigameActivityStat
enum class EMinigameActivityStat : uint8 {
	Time,
	Distance,
	RaceProgress,
	COUNT,
	EMinigameActivityStat_MAX,
};

// Enum FortniteGame.EMinigameActivityComponentValidityResult
enum class EMinigameActivityComponentValidityResult : uint8 {
	Valid,
	IsNotValid,
	EMinigameActivityComponentValidityResult_MAX,
};

// Enum FortniteGame.ESkydiveFeedbackPhase
enum class ESkydiveFeedbackPhase : uint8 {
	Initial,
	WithGlider,
	InVortex,
	None,
	ESkydiveFeedbackPhase_MAX,
};

// Enum FortniteGame.EConversationEventQueryMethod
enum class EConversationEventQueryMethod : uint8 {
	CheckAgainstCurrentConversationParticipant,
	CheckAgainstConversationEntryTag,
	EConversationEventQueryMethod_MAX,
};

// Enum FortniteGame.EFortSentenceAudioPreference
enum class EFortSentenceAudioPreference : uint8 {
	AudioAsset,
	FeedbackBank,
	EFortSentenceAudioPreference_MAX,
};

// Enum FortniteGame.EContextRequirementMatchPolicy
enum class EContextRequirementMatchPolicy : uint8 {
	RequireAll,
	RequireAny,
	EContextRequirementMatchPolicy_MAX,
};

// Enum FortniteGame.EPreventAbilityUseReason
enum class EPreventAbilityUseReason : uint8 {
	CannotAfford,
	AlreadyActive,
	AbilityActivationBlocked,
	None,
	Count,
	EPreventAbilityUseReason_MAX,
};

// Enum FortniteGame.ERequirementMatchPolicy
enum class ERequirementMatchPolicy : uint8 {
	RequireAll,
	RequireAny,
	ERequirementMatchPolicy_MAX,
};

// Enum FortniteGame.EDataDrivenEffectRecipient
enum class EDataDrivenEffectRecipient : uint8 {
	Player,
	NPC,
	EDataDrivenEffectRecipient_MAX,
};

// Enum FortniteGame.EPreventUseStormCircleServiceReason
enum class EPreventUseStormCircleServiceReason : uint8 {
	CannotAfford,
	AlreadyActive,
	StormLocationsAlreadyRevealed,
	None,
	EPreventUseStormCircleServiceReason_MAX,
};

// Enum FortniteGame.EPreventSupplyDropUseReason
enum class EPreventSupplyDropUseReason : uint8 {
	CannotAfford,
	OutOfStock,
	None,
	Count,
	EPreventSupplyDropUseReason_MAX,
};

// Enum FortniteGame.ESupplyDropSpawnLocationPolicy
enum class ESupplyDropSpawnLocationPolicy : uint8 {
	RadiusAroundLocation,
	SafeZone,
	ESupplyDropSpawnLocationPolicy_MAX,
};

// Enum FortniteGame.EFCRP_LoopBehavior
enum class EFCRP_LoopBehavior : uint8 {
	StopAtEnd,
	PingPong,
	WrapAround,
	EFCRP_MAX,
};

// Enum FortniteGame.EFortRichColorConflictResolutionRules
enum class EFortRichColorConflictResolutionRules : uint8 {
	NoConflictsAllowed,
	BlackOrWhiteCannotConflict,
	EFortRichColorConflictResolutionRules_MAX,
};

// Enum FortniteGame.EFortCosmeticSwapRequirementPart
enum class EFortCosmeticSwapRequirementPart : uint8 {
	None,
	Glider,
	Pickaxe,
	Backpack,
	Character,
	FullLoadout,
	MAX,
};

// Enum FortniteGame.ELoadoutVariantInsertType
enum class ELoadoutVariantInsertType : uint8 {
	StartOfArray,
	EndOfArray,
	ELoadoutVariantInsertType_MAX,
};

// Enum FortniteGame.EAnimInstanceClassSwapType
enum class EAnimInstanceClassSwapType : uint8 {
	None,
	SwapOnMatch,
	EAnimInstanceClassSwapType_MAX,
};

// Enum FortniteGame.EAssetChangeMethod
enum class EAssetChangeMethod : uint8 {
	Latest,
	Minimum,
	OnlyAddNew,
	BelowDoubleTheFixedCost,
	EAssetChangeMethod_MAX,
};

// Enum FortniteGame.EFortCreativeDiscoverySkippedEntries
enum class EFortCreativeDiscoverySkippedEntries : uint8 {
	None,
	ByCount,
	ByPercent,
	EFortCreativeDiscoverySkippedEntries_MAX,
};

// Enum FortniteGame.EFortCreativeDiscoveryPanelType
enum class EFortCreativeDiscoveryPanelType : uint8 {
	CuratedList,
	MetricDriven,
	EFortCreativeDiscoveryPanelType_MAX,
};

// Enum FortniteGame.EFortCreativeDiscoveryDeterminism
enum class EFortCreativeDiscoveryDeterminism : uint8 {
	Always,
	Random,
	PlayerDeterministic,
	PartyDeterministic,
	Never,
	EFortCreativeDiscoveryDeterminism_MAX,
};

// Enum FortniteGame.EFortLockDeviceVisibilityDuringGames
enum class EFortLockDeviceVisibilityDuringGames : uint8 {
	No,
	Yes,
	HologramOnly,
	EFortLockDeviceVisibilityDuringGames_MAX,
};

// Enum FortniteGame.EBuildingAsPropSetting
enum class EBuildingAsPropSetting : uint8 {
	None,
	SnapToEdge,
	SnapToCenter,
	EBuildingAsPropSetting_MAX,
};

// Enum FortniteGame.ECameraSpaceHoldPosition
enum class ECameraSpaceHoldPosition : uint8 {
	AsPickup,
	Left,
	Center,
	Right,
	ECameraSpaceHoldPosition_MAX,
};

// Enum FortniteGame.EAddToSelectionResult
enum class EAddToSelectionResult : uint8 {
	Added,
	Removed,
	AtLimit,
	None,
	EAddToSelectionResult_MAX,
};

// Enum FortniteGame.EHitTraceType
enum class EHitTraceType : uint8 {
	Single,
	Multi,
	EHitTraceType_MAX,
};

// Enum FortniteGame.ECreativePortalManagerValidityResult
enum class ECreativePortalManagerValidityResult : uint8 {
	Valid,
	Invalid,
	ECreativePortalManagerValidityResult_MAX,
};

// Enum FortniteGame.EFortCreativePlotPermission
enum class EFortCreativePlotPermission : uint8 {
	Private,
	Public,
	EFortCreativePlotPermission_MAX,
};

// Enum FortniteGame.ERealEstateOffsetType
enum class ERealEstateOffsetType : uint8 {
	CustomOffsetFromCorner,
	Center,
	ERealEstateOffsetType_MAX,
};

// Enum FortniteGame.EFortSourDropperColorType
enum class EFortSourDropperColorType : uint8 {
	None,
	Bright,
	MidBright,
	MidDark,
	Dark,
	EFortSourDropperColorType_MAX,
};

// Enum FortniteGame.EFortCreativeTeleporterEvent
enum class EFortCreativeTeleporterEvent : uint8 {
	Entered,
	Exited,
	Enabled,
	Disabled,
	None,
	EFortCreativeTeleporterEvent_MAX,
};

// Enum FortniteGame.EFortCreativeTeleporterGroup
enum class EFortCreativeTeleporterGroup : uint8 {
	Group_A,
	Group_B,
	Group_C,
	Group_D,
	Group_E,
	Group_F,
	Group_G,
	Group_H,
	Group_I,
	Group_J,
	Group_K,
	Group_L,
	Group_M,
	Group_N,
	Group_O,
	Group_P,
	Group_Q,
	Group_R,
	Group_S,
	Group_T,
	Group_U,
	Group_V,
	Group_W,
	Group_X,
	Group_Y,
	Group_Z,
	Group_None,
	Group_MAX,
};

// Enum FortniteGame.EMMSPlayersPerTeamPreset
enum class EMMSPlayersPerTeamPreset : uint8 {
	Solos,
	Duos,
	Trios,
	Squads,
	SplitEvenly,
	Dynamic,
	EMMSPlayersPerTeamPreset_MAX,
};

// Enum FortniteGame.EMMSRulePreset
enum class EMMSRulePreset : uint8 {
	RespectParties,
	KeepFull,
	Off,
	EMMSRulePreset_MAX,
};

// Enum FortniteGame.EFortCurieApplicationEvent
enum class EFortCurieApplicationEvent : uint8 {
	OnHit,
	OnBeginOverlap,
	OnEndOverlap,
	MaxValue,
	EFortCurieApplicationEvent_MAX,
};

// Enum FortniteGame.EFortCurieExecutionType
enum class EFortCurieExecutionType : uint8 {
	Application,
	Interaction,
	EFortCurieExecutionType_MAX,
};

// Enum FortniteGame.EFortNativeCurieFXCueResponse
enum class EFortNativeCurieFXCueResponse : uint8 {
	IgnoreCue,
	AllowCue,
	OverrideCue,
	EFortNativeCurieFXCueResponse_MAX,
};

// Enum FortniteGame.EFortCurieToggleComponentDeactivationBehavior
enum class EFortCurieToggleComponentDeactivationBehavior : uint8 {
	NeverDeactivate,
	TimedDeactivationAllowRefresh,
	TimedDeactivationNoRefresh,
	EFortCurieToggleComponentDeactivationBehavior_MAX,
};

// Enum FortniteGame.EFortCurieToggleComponentActivationBehavior
enum class EFortCurieToggleComponentActivationBehavior : uint8 {
	OnValidAttachment,
	EFortCurieToggleComponentActivationBehavior_MAX,
};

// Enum FortniteGame.EFortCurieNativeFXType
enum class EFortCurieNativeFXType : uint8 {
	None,
	Electricity,
	Fire,
	Charred,
	EFortCurieNativeFXType_MAX,
};

// Enum FortniteGame.ETimespanUnitDisplayFormat
enum class ETimespanUnitDisplayFormat : uint8 {
	Full,
	Abbreviated,
	ETimespanUnitDisplayFormat_MAX,
};

// Enum FortniteGame.ETimespanAsTextFormat
enum class ETimespanAsTextFormat : uint8 {
	DaysHoursMinutesSeconds,
	Colons,
	ColonsWithMilliseconds,
	Approximate,
	ApproximateWithWeeks,
	ApproximateWithMonths,
	ApproximateWithYears,
	ETimespanAsTextFormat_MAX,
};

// Enum FortniteGame.EDeathCauseReason
enum class EDeathCauseReason : uint8 {
	SelfInflicted,
	SelfInflictedDBNO,
	Eliminated,
	EliminatedDBNO,
	EDeathCauseReason_MAX,
};

// Enum FortniteGame.EFortDefenderSubtype
enum class EFortDefenderSubtype : uint8 {
	AssaultRifle,
	Pistol,
	Melee,
	Sniper,
	Shotgun,
	Invalid,
	EFortDefenderSubtype_MAX,
};

// Enum FortniteGame.EHordeTierStartStatus
enum class EHordeTierStartStatus : uint8 {
	ReadyToStart,
	WaitingForPlayer,
	WaitingForDBM,
	GenericNotReadyToStart,
	EHordeTierStartStatus_MAX,
};

// Enum FortniteGame.EHordeWaveStingerType
enum class EHordeWaveStingerType : uint8 {
	WaveSuccess,
	WaveFailure,
	WaveIncoming,
	WaveStarted,
	EHordeWaveStingerType_MAX,
};

// Enum FortniteGame.EQueueActionType
enum class EQueueActionType : uint8 {
	Plot,
	ZoneCleanup,
	EnvironmentActorRestoration,
	EQueueActionType_MAX,
};

// Enum FortniteGame.FDynamicBuildOrder
enum class FDynamicBuildOrder : uint8 {
	X,
	Y,
	Z,
	None,
	FDynamicBuildOrder_MAX,
};

// Enum FortniteGame.ENavOptionFallbackDir
enum class ENavOptionFallbackDir : uint8 {
	Left,
	Right,
	Up,
	Down,
	Num,
	Invalid,
	ENavOptionFallbackDir_MAX,
};

// Enum FortniteGame.EFortFactionAttitude
enum class EFortFactionAttitude : uint8 {
	Friendly,
	Neutral,
	Hostile,
	MAX,
};

// Enum FortniteGame.EFortFeedbackBroadcastFilter
enum class EFortFeedbackBroadcastFilter : uint8 {
	FFBF_Speaker,
	FFBF_SpeakerTeam,
	FFBF_SpeakerAdressee,
	FFBF_HumanPvP_Team1,
	FFBF_HumanPvP_Team2,
	FFBF_None_Max,
	FFBF_MAX,
};

// Enum FortniteGame.EFortFeedbackSelectionMethod
enum class EFortFeedbackSelectionMethod : uint8 {
	FFSM_Instigator,
	FFSM_Recipient,
	FFSM_TeamWitness,
	FFSM_EnemyWitness,
	FFSM_Random,
	FFSM_Priority_IRTE,
	FFSM_AllPawns,
	FFSM_Announcer,
	FFSM_MAX,
};

// Enum FortniteGame.EFortFeedbackAddressee
enum class EFortFeedbackAddressee : uint8 {
	FFA_Instigator,
	FFA_Recipient,
	FFA_All,
	FFA_MAX,
};

// Enum FortniteGame.EFortFeedbackContext
enum class EFortFeedbackContext : uint8 {
	FFC_Instigator,
	FFC_Recipient,
	FFC_TeamWitness,
	FFC_EnemyWitness,
	FFC_AllPawns,
	FFC_Announcer,
	FFC_None_Max,
	FFC_MAX,
};

// Enum FortniteGame.EFortFoleyHitAudioType
enum class EFortFoleyHitAudioType : uint8 {
	Body,
	Shield,
	Crit,
	Death,
	DeathCrit,
	Fall,
	FallDeath,
	Max_None,
	EFortFoleyHitAudioType_MAX,
};

// Enum FortniteGame.EFortFootstepPosition
enum class EFortFootstepPosition : uint8 {
	Parallel,
	Above,
	Below,
	AboveOrBelowAndVisible,
	Max_None,
	EFortFootstepPosition_MAX,
};

// Enum FortniteGame.EFortFootstepSurfaceType
enum class EFortFootstepSurfaceType : uint8 {
	Default,
	Wood,
	Stone,
	Metal,
	Water,
	Snow,
	Ice,
	Lava,
	Dirt,
	Grass,
	Sand,
	Max_None,
	EFortFootstepSurfaceType_MAX,
};

// Enum FortniteGame.EFortFootstepAudioType
enum class EFortFootstepAudioType : uint8 {
	Crouch,
	CrouchSprint,
	Walk,
	Sprint,
	Jump,
	Land,
	LandHard,
	Max_None,
	EFortFootstepAudioType_MAX,
};

// Enum FortniteGame.EFriendChestTimePeriod
enum class EFriendChestTimePeriod : uint8 {
	Daily,
	Weekly,
	EFriendChestTimePeriod_MAX,
};

// Enum FortniteGame.EFriendChestInstancedType
enum class EFriendChestInstancedType : uint8 {
	ItemDefinition,
	FreshDripCounter,
	GrantXp,
	Undefined,
	EFriendChestInstancedType_MAX,
};

// Enum FortniteGame.EFortGameActivityType
enum class EFortGameActivityType : uint8 {
	Undefined,
	STW,
	BR,
	LTM,
	CreativePublishedIsland,
	CreativePersonalIsland,
	Dummy,
	EFortGameActivityType_MAX,
};

// Enum FortniteGame.EFortActivityValidationResult
enum class EFortActivityValidationResult : uint8 {
	NotFound,
	InvalidKeyTooShort,
	InvalidKeyCharacters,
	IneligibleParty,
	IslandPrivate,
	CreativePublishedSuccess,
	EFortActivityValidationResult_MAX,
};

// Enum FortniteGame.ESubGameAccessReason
enum class ESubGameAccessReason : uint8 {
	NoAccess,
	OpenAccess,
	TokenItemAccess,
	XboxHomeSharingAccess,
	XboxServiceOutageAccess,
	LimitedAccess,
	ESubGameAccessReason_MAX,
};

// Enum FortniteGame.EClampType
enum class EClampType : uint8 {
	Minimum,
	Maximum,
	EClampType_MAX,
};

// Enum FortniteGame.ERatingsEnforcementType
enum class ERatingsEnforcementType : uint8 {
	Default,
	IgnoreMaximums,
	IgnoreParty,
	IgnorePartyMaximum,
	ERatingsEnforcementType_MAX,
};

// Enum FortniteGame.EDynamicSoundOverride
enum class EDynamicSoundOverride : uint8 {
	Cue,
	Wave,
	Class,
	EDynamicSoundOverride_MAX,
};

// Enum FortniteGame.EPlayerQueueType
enum class EPlayerQueueType : uint8 {
	Player,
	BroadcastSpectator,
	EPlayerQueueType_MAX,
};

// Enum FortniteGame.EFortInputFilterLevel
enum class EFortInputFilterLevel : uint8 {
	None,
	Touch,
	Gamepad,
	Mouse,
	EFortInputFilterLevel_MAX,
};

// Enum FortniteGame.EAircraftLaunchReason
enum class EAircraftLaunchReason : uint8 {
	StdTimerAllPlayers,
	EarlyTimerAllPlayers,
	StdTimerMostPlayers,
	EarlyTimerMostPlayers,
	StdTimerFewPlayers,
	EAircraftLaunchReason_MAX,
};

// Enum FortniteGame.EFortGamepadLookInputCurve
enum class EFortGamepadLookInputCurve : uint8 {
	Linear,
	Exponential,
	EFortGamepadLookInputCurve_MAX,
};

// Enum FortniteGame.EFortGamepadSensitivity
enum class EFortGamepadSensitivity : uint8 {
	Invalid,
	Slow,
	SlowPlus,
	SlowPlusPlus,
	Normal,
	NormalPlus,
	NormalPlusPlus,
	Fast,
	FastPlus,
	FastPlusPlus,
	Insane,
	MAX,
};

// Enum FortniteGame.EFortAbilityCostSource
enum class EFortAbilityCostSource : uint8 {
	Stamina,
	Durability,
	AmmoMagazine,
	AmmoPrimary,
	Item,
	EFortAbilityCostSource_MAX,
};

// Enum FortniteGame.EFortGameplayAbilityActivation
enum class EFortGameplayAbilityActivation : uint8 {
	Passive,
	Triggered,
	Active,
	EFortGameplayAbilityActivation_MAX,
};

// Enum FortniteGame.EFortGetPlayerPawnExecutions
enum class EFortGetPlayerPawnExecutions : uint8 {
	ValidFortPlayerPawn,
	AvatarCastFailed,
	EFortGetPlayerPawnExecutions_MAX,
};

// Enum FortniteGame.EFortAIWeaponUsage
enum class EFortAIWeaponUsage : uint8 {
	NoWeaponUsage,
	UsesRangedWeapon,
	UsesMeleeWeapon,
	EFortAIWeaponUsage_MAX,
};

// Enum FortniteGame.EFortGameplayAbilityMontageSectionToPlay
enum class EFortGameplayAbilityMontageSectionToPlay : uint8 {
	FirstSection,
	RandomSection,
	TestedRandomSection,
	EFortGameplayAbilityMontageSectionToPlay_MAX,
};

// Enum FortniteGame.EJumpBoostPackState
enum class EJumpBoostPackState : uint8 {
	Idle,
	Boost,
	Hovering,
	Falling,
	None,
	EJumpBoostPackState_MAX,
};

// Enum FortniteGame.EMedicPackState
enum class EMedicPackState : uint8 {
	Idle,
	Active,
	None,
	EMedicPackState_MAX,
};

// Enum FortniteGame.EFortGameplayCueSourceCondition
enum class EFortGameplayCueSourceCondition : uint8 {
	AnySource,
	LocalPlayerSource,
	NonLocalPlayerSource,
	EFortGameplayCueSourceCondition_MAX,
};

// Enum FortniteGame.EFortGameplayCueAttachType
enum class EFortGameplayCueAttachType : uint8 {
	AttachToTarget,
	DoNotAttach,
	EFortGameplayCueAttachType_MAX,
};

// Enum FortniteGame.EFortGameplayDataTrackerEventContributionType
enum class EFortGameplayDataTrackerEventContributionType : uint8 {
	Accumulate,
	Set,
	EFortGameplayDataTrackerEventContributionType_MAX,
};

// Enum FortniteGame.ESetCVarType
enum class ESetCVarType : uint8 {
	Numeric,
	String,
	ESetCVarType_MAX,
};

// Enum FortniteGame.EFortServerGameMode
enum class EFortServerGameMode : uint8 {
	Idle,
	LobbyPvE,
	LobbyPvP,
	ZonePvP,
	ZonePvE,
	EFortServerGameMode_MAX,
};

// Enum FortniteGame.EFortBanHammerNotificationAction
enum class EFortBanHammerNotificationAction : uint8 {
	BanAndKick,
	Kick,
	EFortBanHammerNotificationAction_MAX,
};

// Enum FortniteGame.EFortServerContentRestartReason
enum class EFortServerContentRestartReason : uint8 {
	None,
	CreativeCuratedHubChanged,
	CreativeFeaturedIslandsChanged,
	CreativePreloadRevisionChanged,
	CreativePlaylistConditionalFlagsChanged,
	GameFeaturePluginDisabled,
	ForceRestartEventFlagsChanged,
	ForceRestartFlagActiveStateChanged,
	EFortServerContentRestartReason_MAX,
};

// Enum FortniteGame.EServerRestartReason
enum class EServerRestartReason : uint8 {
	HotfixApplied,
	GracefulShutdown,
	BeaconJoinDelayRestart,
	Other,
	EServerRestartReason_MAX,
};

// Enum FortniteGame.ETeamChatRoomState
enum class ETeamChatRoomState : uint8 {
	NotCreated,
	Creating,
	Created,
	Timeout,
	ETeamChatRoomState_MAX,
};

// Enum FortniteGame.EPlayerIndicatorFlags
enum class EPlayerIndicatorFlags : uint8 {
	None,
	Minimap,
	WorldArrow,
	WorldName,
	DBNOCountDown,
	EPlayerIndicatorFlags_MAX,
};

// Enum FortniteGame.EAthenaAerialPhase
enum class EAthenaAerialPhase : uint8 {
	None,
	BusCantExit,
	BusCanExit,
	BusCanExitEndZebulonDrone,
	Skydiving,
	Parachuting,
	Falling,
	EAthenaAerialPhase_MAX,
};

// Enum FortniteGame.ERadiusTrackingGroupingType
enum class ERadiusTrackingGroupingType : uint8 {
	Global,
	Team,
	Squad,
	ERadiusTrackingGroupingType_MAX,
};

// Enum FortniteGame.EAnalyticMatchCounts
enum class EAnalyticMatchCounts : uint8 {
	IDScannerDoorFailed,
	IDSCannerDoorSuccessBelongsToFaction,
	IDSCannerDoorSuccessPlayerDisguised,
	IDSCannerDoorSuccessCarriedHenchman,
	IDSCannerDoorSuccessCarriedHuman,
	IDScannerChestFailed,
	IDSCannerChestSuccessBelongsToFaction,
	IDSCannerChestSuccessPlayerDisguised,
	IDSCannerChestSuccessCarriedHenchman,
	IDSCannerChestSuccessCarriedHuman,
	HenchmenEnteredAlertedState,
	HenchmenEnteredLKPState,
	HenchmenEnteredThreatenedState,
	HenchmenDowned,
	HenchmenEliminated,
	HenchmenInterrogated,
	BossesEliminated,
	DisguisePhoneBoothTimesEntered,
	DisguiseItemTimesUsed,
	HiddenPassagesTimesEntered,
	CameraOrSentryTimesEnteredCautionState,
	CameraOrSentryTimesEnteredAltertedState,
	CameraOrSentryTimesDestroyed,
	GeneratorTimesDisabled,
	UmbrellaNumberOfDashes,
	UmbrellaNumberUsedToFloat,
	UmbrellaAmountDamageBlocked,
	UmbrellaBulletsBlocked,
	UmbrellaMeleeHitsBlocked,
	Count,
	EAnalyticMatchCounts_MAX,
};

// Enum FortniteGame.EDefenderSpawnFailureReason
enum class EDefenderSpawnFailureReason : uint8 {
	None,
	AllPlayerSlotsFull,
	DefendersNotUnlocked,
	CurrentlySimulatingDefender,
	NotOutpostOwner,
	EDefenderSpawnFailureReason_MAX,
};

// Enum FortniteGame.ERHIType
enum class ERHIType : uint8 {
	D3D11,
	D3D12,
	Performance,
	ERHIType_MAX,
};

// Enum FortniteGame.EShowInGamePictureInPicture
enum class EShowInGamePictureInPicture : uint8 {
	Default,
	Hide,
	Show,
	EShowInGamePictureInPicture_MAX,
};

// Enum FortniteGame.EFortScalabilityMode
enum class EFortScalabilityMode : uint8 {
	LowPower,
	Frontend,
	EFortScalabilityMode_MAX,
};

// Enum FortniteGame.ESavedAccountType
enum class ESavedAccountType : uint8 {
	None,
	Facebook,
	Google,
	Epic,
	Device,
	Headless,
	Refresh,
	ESavedAccountType_MAX,
};

// Enum FortniteGame.EFortMobileFPSMode
enum class EFortMobileFPSMode : uint8 {
	Mode_20Fps,
	Mode_30Fps,
	Mode_45Fps,
	Mode_60Fps,
	Mode_90Fps,
	Mode_120Fps,
	Num,
	EFortMobileFPSMode_MAX,
};

// Enum FortniteGame.EFortGiftWrapType
enum class EFortGiftWrapType : uint8 {
	System,
	UserFree,
	UserUnlock,
	UserConsumable,
	Message,
	Ungift,
	EFortGiftWrapType_MAX,
};

// Enum FortniteGame.ETimeLimitForReplayCinematic
enum class ETimeLimitForReplayCinematic : uint8 {
	OpenTimeLimit,
	DurationTimeLimit,
	DurationExtraTime,
	ETimeLimitForReplayCinematic_MAX,
};

// Enum FortniteGame.EFortGlobalAction
enum class EFortGlobalAction : uint8 {
	TrapConfirm,
	TrapPicker,
	BuildConfirm,
	PerformBuildingEditInteraction,
	PerformBuildingImprovementInteraction,
	SwitchQuickBar,
	Use,
	Reload,
	InventoryOrChatHold,
	GamepadChangeMaterialOrHarvestHold,
	GamepadNextWeaponOrHarvestHold,
	GamepadNextWeaponOrAltInteractOrHarvestHold,
	ChangeMaterial,
	Fire,
	RotatePrimitiveClockwise,
	Gadget1,
	Gadget2,
	Ability1,
	Ability2,
	Ability3,
	ToggleFullScreenMap,
	ToggleInventory,
	Jump,
	Crouch,
	ShoppingCartCoast,
	GolfCartEBrake,
	GolfCartForward,
	GolfCartReverse,
	GolfCartHonk,
	GamepadToggleHarvestOrHoldCreativePhone,
	GamepadToggleCreativePhoneWeapon,
	Count,
	EFortGlobalAction_MAX,
};

// Enum FortniteGame.EFortClientUpdateType
enum class EFortClientUpdateType : uint8 {
	Client,
	ContentOnly,
	EFortClientUpdateType_MAX,
};

// Enum FortniteGame.EContentInstallState
enum class EContentInstallState : uint8 {
	NotInstalled,
	Pending,
	Installed,
	Unknown,
	Error,
	EContentInstallState_MAX,
};

// Enum FortniteGame.EFortAccountLinkingUIConfig
enum class EFortAccountLinkingUIConfig : uint8 {
	Disabled,
	Default,
	ExternalViewerOnly,
	FullExternal,
	EFortAccountLinkingUIConfig_MAX,
};

// Enum FortniteGame.EGravityGunHolderRotationAxis
enum class EGravityGunHolderRotationAxis : uint8 {
	XZ,
	YZ,
	ZX,
	MAX,
};

// Enum FortniteGame.EGravityGunHolderObjectType
enum class EGravityGunHolderObjectType : uint8 {
	Invalid,
	PhysicsObject,
	Vehicle,
	Projectile,
	PickUp,
	EGravityGunHolderObjectType_MAX,
};

// Enum FortniteGame.EGravityGunHolderState
enum class EGravityGunHolderState : uint8 {
	Invalid,
	Unrooting,
	Catching,
	Holding,
	Detached,
	EGravityGunHolderState_MAX,
};

// Enum FortniteGame.EFortHardcoreModifierTier
enum class EFortHardcoreModifierTier : uint8 {
	Bronze,
	Silver,
	Gold,
	Platinum,
	Diamond,
	EFortHardcoreModifierTier_MAX,
};

// Enum FortniteGame.EFortHelpContentLocation
enum class EFortHelpContentLocation : uint8 {
	Top,
	Bottom,
	Max,
};

// Enum FortniteGame.EFortHelpItemType
enum class EFortHelpItemType : uint8 {
	Header,
	Entry,
	Max,
};

// Enum FortniteGame.ESpecializationType
enum class ESpecializationType : uint8 {
	Tier1,
	Tier2,
	Tier3,
	Tier4,
	NumTiers,
	ESpecializationType_MAX,
};

// Enum FortniteGame.EFortHeroLoadoutPerkType
enum class EFortHeroLoadoutPerkType : uint8 {
	Commander,
	Standard,
	EFortHeroLoadoutPerkType_MAX,
};

// Enum FortniteGame.EFortSupportBonusType
enum class EFortSupportBonusType : uint8 {
	Normal,
	Tactical,
	Max_None,
	EFortSupportBonusType_MAX,
};

// Enum FortniteGame.EFortHexTileAdjacency
enum class EFortHexTileAdjacency : uint8 {
	North,
	NorthEast,
	SouthEast,
	South,
	SouthWest,
	NorthWest,
	Max_None,
	EFortHexTileAdjacency_MAX,
};

// Enum FortniteGame.EBannerUsageContext
enum class EBannerUsageContext : uint8 {
	Unknown,
	BannerIcon,
	PhysicalBanner,
	Spray,
	EBannerUsageContext_MAX,
};

// Enum FortniteGame.ESquadSlotType
enum class ESquadSlotType : uint8 {
	HeroSquadMissionDefender,
	SurvivorSquadLeadSurvivor,
	SurvivorSquadSurvivor,
	DefenderSquadMember,
	ExpeditionSquadMember,
	ESquadSlotType_MAX,
};

// Enum FortniteGame.EFortHomebaseSquadType
enum class EFortHomebaseSquadType : uint8 {
	AttributeSquad,
	CombatSquad,
	DefenderSquad,
	ExpeditionSquad,
	Max_None,
	EFortHomebaseSquadType_MAX,
};

// Enum FortniteGame.EHomebaseNodeType
enum class EHomebaseNodeType : uint8 {
	Gadget,
	Utility,
	Hidden,
	EHomebaseNodeType_MAX,
};

// Enum FortniteGame.EFortHuskAnimType
enum class EFortHuskAnimType : uint8 {
	Basic,
	Dwarf,
	BlasterBig,
	Weak,
	TinyHead,
	Beehive,
	Husky,
	Sploder,
	Zapper,
	EFortHuskAnimType_MAX,
};

// Enum FortniteGame.EMapCaptureMethod
enum class EMapCaptureMethod : uint8 {
	None,
	LiveCapture,
	StaticCapture,
	EMapCaptureMethod_MAX,
};

// Enum FortniteGame.EFortInputGameMode
enum class EFortInputGameMode : uint8 {
	SaveTheWorld,
	Athena,
	EFortInputGameMode_MAX,
};

// Enum FortniteGame.EFortIntensityCurveSequenceType
enum class EFortIntensityCurveSequenceType : uint8 {
	Sequence,
	Loop,
	Random,
	Max_None,
	EFortIntensityCurveSequenceType_MAX,
};

// Enum FortniteGame.EFortInteractContextInfoType
enum class EFortInteractContextInfoType : uint8 {
	Standard,
	Crafting,
	EFortInteractContextInfoType_MAX,
};

// Enum FortniteGame.EInteriorAudioBuildingType
enum class EInteriorAudioBuildingType : uint8 {
	None,
	Wall,
	Floor,
	CenterCell,
	EInteriorAudioBuildingType_MAX,
};

// Enum FortniteGame.EInteriorAudioBuildingDefaultRotation
enum class EInteriorAudioBuildingDefaultRotation : uint8 {
	PositiveY,
	NegativeX,
	NegativeY,
	PositiveX,
	EInteriorAudioBuildingDefaultRotation_MAX,
};

// Enum FortniteGame.EInteriorAudioQuadrant
enum class EInteriorAudioQuadrant : uint8 {
	None,
	Left,
	Right,
	Top,
	Bottom,
	EInteriorAudioQuadrant_MAX,
};

// Enum FortniteGame.EInteriorAudioBuildingTags
enum class EInteriorAudioBuildingTags : uint8 {
	None,
	HasDoors,
	RotationDependant,
	UseConditionalEvaluation,
	EInteriorAudioBuildingTags_MAX,
};

// Enum FortniteGame.EInteriorAudioBuildingRelativePosition
enum class EInteriorAudioBuildingRelativePosition : uint8 {
	SameCell,
	SameCellQuadrantTestFailed,
	OtherCellParallelToForward,
	OtherCellParallelToRight,
	OtherCellParallelToUp,
	Max_None,
	EInteriorAudioBuildingRelativePosition_MAX,
};

// Enum FortniteGame.EInteriorAudioBuildingDirection
enum class EInteriorAudioBuildingDirection : uint8 {
	Left,
	Right,
	Forward,
	Backward,
	Upward,
	EInteriorAudioBuildingDirection_MAX,
};

// Enum FortniteGame.EInteriorAudioBuildingEvaluation
enum class EInteriorAudioBuildingEvaluation : uint8 {
	Invalid,
	Partial,
	Solid,
	EInteriorAudioBuildingEvaluation_MAX,
};

// Enum FortniteGame.EInteriorAudioRoomSize
enum class EInteriorAudioRoomSize : uint8 {
	Small,
	Medium,
	Large,
	Max_None,
	EInteriorAudioRoomSize_MAX,
};

// Enum FortniteGame.EMinigameStatSavePolicy
enum class EMinigameStatSavePolicy : uint8 {
	Never,
	Always,
	OnlyIfLower,
	OnlyIfHigher,
	EMinigameStatSavePolicy_MAX,
};

// Enum FortniteGame.EItemEvolutionRestrictionReason
enum class EItemEvolutionRestrictionReason : uint8 {
	NoEvolutions,
	BelowMaximumLevel,
	VaultOverflow,
	MissingCatalyst,
	MissingCosts,
	NoRarityUpgrade,
	InUseByCrafting,
	EItemEvolutionRestrictionReason_MAX,
};

// Enum FortniteGame.EItemUpgradeRestrictionReason
enum class EItemUpgradeRestrictionReason : uint8 {
	NoAdditionalLevels,
	MaximumLevelAchieved,
	VaultOverflow,
	EItemUpgradeRestrictionReason_MAX,
};

// Enum FortniteGame.EFortTemplateAccess
enum class EFortTemplateAccess : uint8 {
	Normal,
	Trusted,
	Private,
	EFortTemplateAccess_MAX,
};

// Enum FortniteGame.EItemProfileType
enum class EItemProfileType : uint8 {
	Common,
	Campaign,
	Athena,
	EItemProfileType_MAX,
};

// Enum FortniteGame.EFortJackalSimEvent
enum class EFortJackalSimEvent : uint8 {
	Jumped,
	EFortJackalSimEvent_MAX,
};

// Enum FortniteGame.ELayeredAudioTriggerDir
enum class ELayeredAudioTriggerDir : uint8 {
	Forward,
	Backward,
	ELayeredAudioTriggerDir_MAX,
};

// Enum FortniteGame.ELayeredAudioInterpolationType
enum class ELayeredAudioInterpolationType : uint8 {
	None,
	CustomCurve,
	Linear,
	ELayeredAudioInterpolationType_MAX,
};

// Enum FortniteGame.EUnableToLoadReason
enum class EUnableToLoadReason : uint8 {
	None,
	PackageDoesNotExist,
	EUnableToLoadReason_MAX,
};

// Enum FortniteGame.FLightOverrideLevel
enum class FLightOverrideLevel : uint8 {
	Default,
	High,
	Count,
	FLightOverrideLevel_MAX,
};

// Enum FortniteGame.ELobbyMissionGeneratorDetailsRequirement
enum class ELobbyMissionGeneratorDetailsRequirement : uint8 {
	Unknown,
	NotRequired,
	Required,
	ELobbyMissionGeneratorDetailsRequirement_MAX,
};

// Enum FortniteGame.ELootQuotaLevel
enum class ELootQuotaLevel : uint8 {
	Unlimited,
	Level1,
	Level2,
	Level3,
	Level4,
	Level5,
	Level6,
	Level7,
	Level8,
	Level9,
	Level10,
	Level11,
	Level12,
	Level13,
	Level14,
	Level15,
	Level16,
	Level17,
	NumLevels,
	ELootQuotaLevel_MAX,
};

// Enum FortniteGame.EMarkableResult
enum class EMarkableResult : uint8 {
	Markable,
	Block,
	Continue,
	EMarkableResult_MAX,
};

// Enum FortniteGame.EFortMatchmakingType
enum class EFortMatchmakingType : uint8 {
	Gathering,
	CriticalMission,
	QuickPlay,
	Session,
	EFortMatchmakingType_MAX,
};

// Enum FortniteGame.EFortSessionHelperJoinResult
enum class EFortSessionHelperJoinResult : uint8 {
	NoResult,
	ReservationSuccess,
	ReservationFailure_PartyLimitReached,
	ReservationFailure_IncorrectPlayerCount,
	ReservationFailure_RequestTimedOut,
	ReservationFailure_ReservationNotFound,
	ReservationFailure_ReservationDenied,
	ReservationFailure_ReservationDenied_Banned,
	ReservationFailure_ReservationRequestCanceled,
	ReservationFailure_ReservationInvalid,
	ReservationFailure_BadSessionId,
	ReservationFailure_ReservationDenied_ContainsExistingPlayers,
	ReservationFailure_GeneralError,
	ReservationFailure_NoSubsystem,
	ReservationFailure_NoIdentity,
	ReservationFailure_InvalidSession,
	ReservationFailure_InvalidUser,
	ReservationFailure_EncryptionKey,
	ReservationFailure_RefreshAuth,
	ReservationFailure_AlreadyJoiningDuringReserve,
	ReservationFailure_AlreadyJoiningDuringSkip,
	JoinSessionSuccess,
	JoinSessionFailure_SessionIsFull,
	JoinSessionFailure_SessionDoesNotExist,
	JoinSessionFailure_CouldNotRetrieveAddress,
	JoinSessionFailure_AlreadyInSession,
	JoinSessionFailure_UnknownError,
	JoinSessionFailure_InvalidSession,
	JoinSessionFailure_InvalidSearchResultIndex,
	JoinSessionFailure_AlreadyJoiningDuringJoin,
	SearchPassFailure_NoSessionHelper,
	SearchPassFailure_InvalidUser,
	SearchPassFailure_NoIdentity,
	SearchPassFailure_InvalidSearchResult,
	SearchPassFailure_InvalidSearchResultIndex,
	JoinSessionCanceled,
	EFortSessionHelperJoinResult_MAX,
};

// Enum FortniteGame.EFortMatchmakingPool
enum class EFortMatchmakingPool : uint8 {
	Any,
	Desktop,
	PS4,
	XboxOne,
	Mobile,
	Test,
	Switch,
	Console,
	All,
	EFortMatchmakingPool_MAX,
};

// Enum FortniteGame.EFortMatchmakingPrivacyConfiguration
enum class EFortMatchmakingPrivacyConfiguration : uint8 {
	UserPartyConfigured,
	ForcePrivate,
	ForcePublic,
	EFortMatchmakingPrivacyConfiguration_MAX,
};

// Enum FortniteGame.EMatchmakingFlags
enum class EMatchmakingFlags : uint8 {
	None,
	CreateNewOnly,
	NoReservation,
	Private,
	UseWorldDataOwner,
	EMatchmakingFlags_MAX,
};

// Enum FortniteGame.EMatchmakingStartLocation
enum class EMatchmakingStartLocation : uint8 {
	Lobby,
	Game,
	CreateNew,
	FindSingle,
	EMatchmakingStartLocation_MAX,
};

// Enum FortniteGame.EFortTournamentAlertType
enum class EFortTournamentAlertType : uint8 {
	Warning,
	Info,
	EFortTournamentAlertType_MAX,
};

// Enum FortniteGame.EPlaylistUpdateReason
enum class EPlaylistUpdateReason : uint8 {
	LocalPlayerJoinedParty,
	LocalPlayerLocationChangedToFrontend,
	LocalPlayerSubgameSelected,
	LocalPlayerLeftParty,
	LocalPlayerDeclinedCrossplayPermission,
	PartyGameSessionKeyChanged,
	PartySquadFillChanged,
	PartyMemberJoined,
	PartyMemberLeft,
	PartyMemberReadinessChanged,
	PartyMemberInGameReadyCheckChanged,
	PartyMemberLocationChanged,
	PartyMemberSpectateAvailabilityChanged,
	PartyMemberSessionJoinInfoChanged,
	ValidatePlaylist_QoSCheckFailed,
	ValidatePlaylist_TournamentEventOver,
	ValidatePlaylist_BlackoutChanged,
	ValidatePlaylist_MatchmakingEventsChanged,
	ValidatePlaylist_TournamentNewEventStarted,
	ValidatePlaylist_TournamentNewEventCountdown,
	ValidatePlaylist_TournamentsChanged,
	ValidatePlaylist_PlayerTournamentDataRefreshed,
	Initialization,
	EPlaylistUpdateReason_MAX,
};

// Enum FortniteGame.EMatchmakingUtilityFlows
enum class EMatchmakingUtilityFlows : uint8 {
	Automatic,
	JoinMatchInProgress,
	SpectateMatch,
	Legacy,
	LinkCode,
	JoinEditingSession,
	Internal_Unselected,
	EMatchmakingUtilityFlows_MAX,
};

// Enum FortniteGame.EMatchmakingSourceV2
enum class EMatchmakingSourceV2 : uint8 {
	None,
	AthenaMatchmakingWidget,
	ActivityMatchmakingWidget,
	ReadyUpScreenWidget,
	ForcedIntro,
	Unknown,
	EMatchmakingSourceV2_MAX,
};

// Enum FortniteGame.EUseInputWithPartyResult
enum class EUseInputWithPartyResult : uint8 {
	Success,
	LocalPlayerNeedsToAllowCrossplay,
	LocalPlayerRestricted,
	RemotePlayerRestricted,
	UnknownFailure,
	EUseInputWithPartyResult_MAX,
};

// Enum FortniteGame.EMatchmakingErrorV2
enum class EMatchmakingErrorV2 : uint8 {
	Success,
	Canceled,
	NeedUpdate,
	VersionMismatch,
	UpdateFailed,
	NotLoggedIn,
	NoIdentityInterface,
	NoSessionInterface,
	AlreadyInSession,
	FindSessionFailure,
	FailedToQueryEncryptionKey,
	FailedToRefreshAuthToken,
	FailedToCleanupSession,
	FailedToJoinSession,
	FailedToTravelToSession,
	Unauthorized,
	BannedFromAthena,
	BannedFromAthenaForExploit,
	BannedFromAthenaForTeaming,
	BannedFromAthenaForTeamKilling,
	InvalidCustomMatchKey,
	FailedToContactGameServices,
	FailedToConnectToMMS,
	MMSCommunicationIssue,
	ServiceReturnedError,
	PlaylistNoLongerAvailable,
	CrossplayUnsetWithInputDevicePoolShift,
	CrossplayNeededForTournamentMatch,
	MatchmakingDisabled,
	AccountLevelTooLow,
	JoinInProgressError,
	SpectateInProgressError,
	MatchmakingInProgress,
	TooFrequentRequests,
	FailedToAcquireContent,
	CellularDataRefusal,
	CancelledDownloadContent,
	DataAssetDirectoryUpdateFailed,
	InvalidPlaylistRevision,
	UnknownError,
	EMatchmakingErrorV2_MAX,
};

// Enum FortniteGame.EBadMatchType
enum class EBadMatchType : uint8 {
	None,
	Ping,
	PacketLoss,
	NotMonitored,
	EBadMatchType_MAX,
};

// Enum FortniteGame.ECharacterEncounterType
enum class ECharacterEncounterType : uint8 {
	Converstation,
	Attack,
	Count,
	ECharacterEncounterType_MAX,
};

// Enum FortniteGame.ESavePlayerQuestUpdate
enum class ESavePlayerQuestUpdate : uint8 {
	QuestGiven,
	QuestCompleted,
	ESavePlayerQuestUpdate_MAX,
};

// Enum FortniteGame.EAthenaFilterDisplayType
enum class EAthenaFilterDisplayType : uint8 {
	UseCategoryName,
	ShowFilterString,
	EAthenaFilterDisplayType_MAX,
};

// Enum FortniteGame.EMcpSubscriptionState
enum class EMcpSubscriptionState : uint8 {
	Inactive,
	Active,
	Canceled,
	PaymentProcessError,
	BlockedBenefits,
	Unknown,
	EMcpSubscriptionState_MAX,
};

// Enum FortniteGame.ESocialImportPanelPlatform
enum class ESocialImportPanelPlatform : uint8 {
	Facebook,
	VK,
	Steam,
	Xbox,
	Playstation,
	Switch,
	None,
	ESocialImportPanelPlatform_MAX,
};

// Enum FortniteGame.EPublishStatus
enum class EPublishStatus : uint8 {
	Banned,
	CannotPublish,
	NeedsCreatorName,
	CanPublishProvisionally,
	CanPublish,
	EPublishStatus_MAX,
};

// Enum FortniteGame.ETwitchViewerStatusType
enum class ETwitchViewerStatusType : uint8 {
	TwitchViewerStatus_Unknown,
	TwitchViewerStatus_Nonsubscriber,
	TwitchViewerStatus_Subscriber,
	TwitchViewerStatus_Broadcaster,
	TwitchViewerStatus_Max,
};

// Enum FortniteGame.EMegaStormState
enum class EMegaStormState : uint8 {
	GatheringActorList,
	DamagingActors,
	EMegaStormState_MAX,
};

// Enum FortniteGame.EMinigameGameEndCallout
enum class EMinigameGameEndCallout : uint8 {
	WinLose,
	Placement,
	Cooperative,
	EMinigameGameEndCallout_MAX,
};

// Enum FortniteGame.EMinigameScoreboardStates
enum class EMinigameScoreboardStates : uint8 {
	RoundEndDisplayWinner,
	GameEndDisplayWinner,
	RoundEndDisplayScoreboard,
	GameEndDisplayScoreboard,
	Max,
};

// Enum FortniteGame.EMinigameFullscreenMapWidgetType
enum class EMinigameFullscreenMapWidgetType : uint8 {
	Default_Map,
	Creative_Scoreboard,
	EMinigameFullscreenMapWidgetType_MAX,
};

// Enum FortniteGame.EFortMinigameExec
enum class EFortMinigameExec : uint8 {
	Yes,
	No,
	EFortMinigameExec_MAX,
};

// Enum FortniteGame.EMinigamePlayerPersistence
enum class EMinigamePlayerPersistence : uint8 {
	None,
	PartyLeaderOnly,
	AllPlayers,
	EMinigamePlayerPersistence_MAX,
};

// Enum FortniteGame.EMinigameWinCondition
enum class EMinigameWinCondition : uint8 {
	MostRoundWins,
	MostScoreWins,
	EMinigameWinCondition_MAX,
};

// Enum FortniteGame.EMinigameTeamListType
enum class EMinigameTeamListType : uint8 {
	Blacklist,
	Whitelist,
	EMinigameTeamListType_MAX,
};

// Enum FortniteGame.EMinigameCaptureObjectiveState
enum class EMinigameCaptureObjectiveState : uint8 {
	NotCaptured,
	Captured,
	EMinigameCaptureObjectiveState_MAX,
};

// Enum FortniteGame.EObjectiveType
enum class EObjectiveType : uint8 {
	DestructionObjective,
	CaptureObjective,
	EObjectiveType_MAX,
};

// Enum FortniteGame.ETrackedObjectiveQuery
enum class ETrackedObjectiveQuery : uint8 {
	All,
	ExactTeam,
	Friendly,
	Neutral,
	Hostile,
	NotFriendly,
	MAX,
};

// Enum FortniteGame.EMinigameScoreType
enum class EMinigameScoreType : uint8 {
	Time,
	PointTotal,
	EMinigameScoreType_MAX,
};

// Enum FortniteGame.EFortMinigameStatOperation
enum class EFortMinigameStatOperation : uint8 {
	Equal,
	Less,
	Greater,
	LessOrEqual,
	GreaterOrEqual,
	EFortMinigameStatOperation_MAX,
};

// Enum FortniteGame.EFortMinigameStatScope
enum class EFortMinigameStatScope : uint8 {
	Group,
	Team,
	Player,
	EFortMinigameStatScope_MAX,
};

// Enum FortniteGame.EBuildingMode
enum class EBuildingMode : uint8 {
	None,
	BuildingsOnly,
	TrapsOnly,
	All,
	EBuildingMode_MAX,
};

// Enum FortniteGame.EFortMinigameClassResetType
enum class EFortMinigameClassResetType : uint8 {
	Never,
	RoundEnd,
	GameEnd,
	PlayerDeath,
	EFortMinigameClassResetType_MAX,
};

// Enum FortniteGame.EFortMinigameClassSlot
enum class EFortMinigameClassSlot : uint8 {
	ZeroIndex,
	None,
	EFortMinigameClassSlot_MAX,
};

// Enum FortniteGame.EFortMinigamePostGameSpawnLocationSetting
enum class EFortMinigamePostGameSpawnLocationSetting : uint8 {
	IslandStart,
	PreGameLocation,
	EFortMinigamePostGameSpawnLocationSetting_MAX,
};

// Enum FortniteGame.EFortMinigamePlayerSpawnLocationSetting
enum class EFortMinigamePlayerSpawnLocationSetting : uint8 {
	SpawnPads,
	Air,
	CurrentLocation,
	EFortMinigamePlayerSpawnLocationSetting_MAX,
};

// Enum FortniteGame.EMiniMapIconParameterDataType
enum class EMiniMapIconParameterDataType : uint8 {
	None,
	Scalar,
	Vector,
	Texture,
	EMiniMapIconParameterDataType_MAX,
};

// Enum FortniteGame.EFortMiniMapIconRotation
enum class EFortMiniMapIconRotation : uint8 {
	EFMMIR_None,
	EFMMIR_Absolute,
	EFMMIR_Relative,
	EFMMIR_MAX,
};

// Enum FortniteGame.EFortMiniMapContext
enum class EFortMiniMapContext : uint8 {
	EFMC_MiniMap,
	EFMC_FullScreenMap,
	EFMC_MAX,
};

// Enum FortniteGame.EFortMiniMapHeight
enum class EFortMiniMapHeight : uint8 {
	EFMH_Equal,
	EFMH_Below,
	EFMH_Above,
	EFMH_MAX,
};

// Enum FortniteGame.EFortMiniMapDrawCategory
enum class EFortMiniMapDrawCategory : uint8 {
	AthenaBackground,
	MapLocation,
	SafeZone,
	BusPath,
	SpecialActorIcon,
	SquadPin,
	MapIndicator,
	MapCursor,
	Elimination,
	MAX,
};

// Enum FortniteGame.EFortCheatMissionGenType
enum class EFortCheatMissionGenType : uint8 {
	NewGeneration,
	OldGeneration,
	Max_None,
	EFortCheatMissionGenType_MAX,
};

// Enum FortniteGame.EFortOptionGenerationResult
enum class EFortOptionGenerationResult : uint8 {
	NoOptionsGenerated,
	NewOptionsGenerated,
	ExistingOptionsGenerated,
	EFortOptionGenerationResult_MAX,
};

// Enum FortniteGame.EPollActorsInVolumeTypes
enum class EPollActorsInVolumeTypes : uint8 {
	DesignerPlacedOnly,
	PlayerBuiltOnly,
	All,
	EPollActorsInVolumeTypes_MAX,
};

// Enum FortniteGame.EMissionReplyTypes
enum class EMissionReplyTypes : uint8 {
	Handled,
	NotHandled,
	EMissionReplyTypes_MAX,
};

// Enum FortniteGame.ETimerOverrideSetting
enum class ETimerOverrideSetting : uint8 {
	DefaultBehavior,
	ForceShow,
	ForceHide,
	ShowAtEnd,
	ETimerOverrideSetting_MAX,
};

// Enum FortniteGame.ESchemaModificationType
enum class ESchemaModificationType : uint8 {
	AddOrModify,
	Remove,
	Count,
	ESchemaModificationType_MAX,
};

// Enum FortniteGame.EMontageVisibilityRule
enum class EMontageVisibilityRule : uint8 {
	RequiredItem,
	ForbiddenItem,
	EMontageVisibilityRule_MAX,
};

// Enum FortniteGame.EFortMtxPlatform
enum class EFortMtxPlatform : uint8 {
	Epic,
	PSN,
	Live,
	Shared,
	EpicPC,
	EpicPCKorea,
	IOSAppStore,
	EpicAndroid,
	Nintendo,
	WeGame,
	Samsung,
	GooglePlay,
	EFortMtxPlatform_MAX,
};

// Enum FortniteGame.EFortMusicSectionType
enum class EFortMusicSectionType : uint8 {
	Intro,
	Loop,
	Outro,
	Max_None,
	EFortMusicSectionType_MAX,
};

// Enum FortniteGame.EFortMusicSectionStopBehavior
enum class EFortMusicSectionStopBehavior : uint8 {
	Crossfade,
	AllowFadeOut,
	EFortMusicSectionStopBehavior_MAX,
};

// Enum FortniteGame.EFortMusicCombatIntensity
enum class EFortMusicCombatIntensity : uint8 {
	Low,
	Medium,
	High,
	VeryHigh,
	Max_None,
	EFortMusicCombatIntensity_MAX,
};

// Enum FortniteGame.EMusicChannel
enum class EMusicChannel : uint8 {
	VoiceA,
	VoiceB,
	Max_None,
	EMusicChannel_MAX,
};

// Enum FortniteGame.EMusicFadeStyles
enum class EMusicFadeStyles : uint8 {
	CrossFade,
	FadeOutThenIn,
	Max_None,
	EMusicFadeStyles_MAX,
};

// Enum FortniteGame.EMutatorListInitState
enum class EMutatorListInitState : uint8 {
	Default,
	Enabled,
	Disabled,
	EMutatorListInitState_MAX,
};

// Enum FortniteGame.EFortAreaFlag
enum class EFortAreaFlag : uint8 {
	Default,
	Obstacle,
	Smashable,
	Unwalkable,
	Interactable,
	EFortAreaFlag_MAX,
};

// Enum FortniteGame.EVisibilityResponse
enum class EVisibilityResponse : uint8 {
	Hide,
	Show,
	Custom,
	EVisibilityResponse_MAX,
};

// Enum FortniteGame.EFortNavLinkPattern
enum class EFortNavLinkPattern : uint8 {
	Floor,
	Stairs,
	Roof,
	Manual,
	EFortNavLinkPattern_MAX,
};

// Enum FortniteGame.EFortNamedNavmesh
enum class EFortNamedNavmesh : uint8 {
	Husk,
	Smasher,
	MAX,
};

// Enum FortniteGame.EFXType
enum class EFXType : uint8 {
	GenericAnimNotify,
	TrailAnimNotify,
	WeaponImpactEffect,
	WeaponMeleeImpactEffect,
	Contrail,
	Emote,
	Trap,
	Skin,
	Glider,
	Vehicle,
	BackpackBling,
	Water,
	LootChest,
	EnvironmentalAmbient,
	WeaponRangedBeam,
	WeaponBulletShells,
	WeaponMuzzleFlashes,
	PickAxe,
	Curie,
	Projectile,
	EFXType_MAX,
};

// Enum FortniteGame.EFortOctopusSimEvent
enum class EFortOctopusSimEvent : uint8 {
	BeginBoostCooldown,
	EFortOctopusSimEvent_MAX,
};

// Enum FortniteGame.EOutpostBuildings
enum class EOutpostBuildings : uint8 {
	StormShield,
	HarvestingOptimizer,
	StorageVault,
	POST,
	EOutpostBuildings_MAX,
};

// Enum FortniteGame.EPartyMemberVoiceChatStatus
enum class EPartyMemberVoiceChatStatus : uint8 {
	Disabled,
	Enabled,
	PartyVoice,
	GameVoice,
	PlatformVoice,
	EPartyMemberVoiceChatStatus_MAX,
};

// Enum FortniteGame.EGameReadiness
enum class EGameReadiness : uint8 {
	NotReady,
	Ready,
	SittingOut,
	EGameReadiness_MAX,
};

// Enum FortniteGame.ESquadChangeType
enum class ESquadChangeType : uint8 {
	JoinSquad,
	BenchSelf,
	UnbenchSelf,
	Swap,
	None,
	ESquadChangeType_MAX,
};

// Enum FortniteGame.EPartyMemberSidekickStatus
enum class EPartyMemberSidekickStatus : uint8 {
	None,
	Linked,
	Connected,
	EPartyMemberSidekickStatus_MAX,
};

// Enum FortniteGame.EFortPartyMemberReadyCheckStatus
enum class EFortPartyMemberReadyCheckStatus : uint8 {
	None,
	InProgress,
	Complete,
	Canceled,
	EFortPartyMemberReadyCheckStatus_MAX,
};

// Enum FortniteGame.EPathUndermineEvent
enum class EPathUndermineEvent : uint8 {
	Predicted,
	Started,
	Finished,
	EPathUndermineEvent_MAX,
};

// Enum FortniteGame.EPathObstacleAction
enum class EPathObstacleAction : uint8 {
	Melee,
	Ignore,
	AbortMoveAsFailed,
	FinishMoveAsSucceeded,
	EPathObstacleAction_MAX,
};

// Enum FortniteGame.EWardAffectType
enum class EWardAffectType : uint8 {
	AffectsBothStartAndEndPoints,
	AffectsOnlyStartPoints,
	AffectsOnlyEndPoints,
	EWardAffectType_MAX,
};

// Enum FortniteGame.EFortWeaponListRemovalBehavior
enum class EFortWeaponListRemovalBehavior : uint8 {
	DestroyImmediately,
	DeferredLifespan,
	DoNotDestroy,
	EFortWeaponListRemovalBehavior_MAX,
};

// Enum FortniteGame.EFortControlRecoveryBehavior
enum class EFortControlRecoveryBehavior : uint8 {
	DefaultControl,
	LimitedControl,
	ChainControl,
	EFortControlRecoveryBehavior_MAX,
};

// Enum FortniteGame.EFortPawnPushSize
enum class EFortPawnPushSize : uint8 {
	FFPS_Normal,
	FPPS_Player,
	FPPS_Large,
	FPPS_SuperLarge,
	EFortPawnPushSize_MAX,
};

// Enum FortniteGame.EFortAnnouncerTeamVocalChords
enum class EFortAnnouncerTeamVocalChords : uint8 {
	Team1,
	Team2,
	Max_None,
	EFortAnnouncerTeamVocalChords_MAX,
};

// Enum FortniteGame.EFortBadMatchTriggerType
enum class EFortBadMatchTriggerType : uint8 {
	Unspecified,
	SmallTeam,
	LargeTeam,
	LetoTeam,
	EFortBadMatchTriggerType_MAX,
};

// Enum FortniteGame.EFortBadMatchTriggerOperation
enum class EFortBadMatchTriggerOperation : uint8 {
	LessThan,
	LessThanOrEqual,
	Equal,
	GreaterThan,
	GreaterThanOrEqual,
	EFortBadMatchTriggerOperation_MAX,
};

// Enum FortniteGame.EFortRewardType
enum class EFortRewardType : uint8 {
	Default,
	Missed,
	Max_None,
	EFortRewardType_MAX,
};

// Enum FortniteGame.EFortReplicatedStat
enum class EFortReplicatedStat : uint8 {
	MonsterKills,
	MonsterDamagePoints,
	PlayerKills,
	WoodGathered,
	StoneGathered,
	MetalGathered,
	Deaths,
	BluGloActivity,
	BuildingsBuilt,
	BuildingsBuilt_Wood,
	BuildingsBuilt_Stone,
	BuildingsBuilt_Metal,
	BuildingsUpgraded_Wood2,
	BuildingsUpgraded_Wood3,
	BuildingsUpgraded_Stone2,
	BuildingsUpgraded_Stone3,
	BuildingsUpgraded_Metal2,
	BuildingsUpgraded_Metal3,
	BuildingsDestroyed,
	Repair_Wood,
	Repair_Stone,
	Repair_Metal,
	FlagsCaptured,
	FlagsReturned,
	ContainersLooted,
	CraftingPoints,
	TrapPlacementPoints,
	TrapActivationPoints,
	TotalScore,
	OldTotalScore,
	CombatScore,
	BuildingScore,
	UtilityScore,
	BadgesScore,
	None,
	MAX,
};

// Enum FortniteGame.EFortReplenishmentType
enum class EFortReplenishmentType : uint8 {
	Restricted,
	ClampMin,
	Add,
	Ability,
	EFortReplenishmentType_MAX,
};

// Enum FortniteGame.EFortPhysicsObjectMovementState
enum class EFortPhysicsObjectMovementState : uint8 {
	None,
	Flying,
	Rolling,
	Sliding,
	Floating,
	EFortPhysicsObjectMovementState_MAX,
};

// Enum FortniteGame.EFortPhysicsObjectAwakeState
enum class EFortPhysicsObjectAwakeState : uint8 {
	Invalid,
	Awake,
	Asleep,
	EFortPhysicsObjectAwakeState_MAX,
};

// Enum FortniteGame.EFortPhysicsSimulationRepEvent
enum class EFortPhysicsSimulationRepEvent : uint8 {
	LinearVelocity,
	AngularVelocity,
	Impulse,
	ImpulseAtLocation,
	AngularImpulse,
	Force,
	Torque,
	None,
	EFortPhysicsSimulationRepEvent_MAX,
};

// Enum FortniteGame.EFortPhysicsObjectNetworkPolicy
enum class EFortPhysicsObjectNetworkPolicy : uint8 {
	ClientOnly,
	ServerAuthoritative,
	EFortPhysicsObjectNetworkPolicy_MAX,
};

// Enum FortniteGame.EFortPhysicsSimSize
enum class EFortPhysicsSimSize : uint8 {
	Large,
	Medium,
	Average,
	Small,
	Invalid,
	EFortPhysicsSimSize_MAX,
};

// Enum FortniteGame.EFortPickupTossState
enum class EFortPickupTossState : uint8 {
	NotTossed,
	InProgress,
	AtRest,
	EFortPickupTossState_MAX,
};

// Enum FortniteGame.EFortPickupSpawnSource
enum class EFortPickupSpawnSource : uint8 {
	Unset,
	PlayerElimination,
	Chest,
	SupplyDrop,
	AmmoBox,
	Drone,
	ItemSpawner,
	BotElimination,
	NPCElimination,
	LootDrop,
	EFortPickupSpawnSource_MAX,
};

// Enum FortniteGame.EFortPickupSourceTypeFlag
enum class EFortPickupSourceTypeFlag : uint8 {
	Other,
	Player,
	Destruction,
	Container,
	AI,
	Tossed,
	FloorLoot,
	Fishing,
	EFortPickupSourceTypeFlag_MAX,
};

// Enum FortniteGame.EManagedPickupContext
enum class EManagedPickupContext : uint8 {
	Unknown,
	PlayerDropped,
	Overflow,
	Spawned,
	EManagedPickupContext_MAX,
};

// Enum FortniteGame.EManagedPickupBucket
enum class EManagedPickupBucket : uint8 {
	Default,
	Junk,
	Normal,
	Important,
	EManagedPickupBucket_MAX,
};

// Enum FortniteGame.EConstructionBuildingType
enum class EConstructionBuildingType : uint8 {
	Wall,
	Floor,
	Stairs,
	Roof,
	Brace,
	WallWindow,
	Count,
	EConstructionBuildingType_MAX,
};

// Enum FortniteGame.EOrientedConstructionBuildingType
enum class EOrientedConstructionBuildingType : uint8 {
	WallX,
	WallY,
	Floor,
	StairsUpX,
	StairsUpY,
	StairsDownX,
	StairsDownY,
	Roof,
	BraceLeftX,
	BraceRightX,
	BraceLeftY,
	BraceRightY,
	WallWindowX,
	WallWindowY,
	Count,
	EOrientedConstructionBuildingType_MAX,
};

// Enum FortniteGame.ELeashReturnLocationMode
enum class ELeashReturnLocationMode : uint8 {
	Closest,
	Random,
	ELeashReturnLocationMode_MAX,
};

// Enum FortniteGame.ELookAtType
enum class ELookAtType : uint8 {
	ScanAround,
	Investigate,
	HeardSound,
	MAX,
};

// Enum FortniteGame.EPerceptionSoundType
enum class EPerceptionSoundType : uint8 {
	Default,
	Explosion,
	ProjectileFlyBy,
	ProjectileImpact,
	WeaponFiring,
	Building,
	MeleeImpact,
	MAX,
};

// Enum FortniteGame.ETrackingOffsetModifierCurve
enum class ETrackingOffsetModifierCurve : uint8 {
	Default,
	CombatStart,
	TargetLowHealth,
	MAX,
};

// Enum FortniteGame.EPerceptionState
enum class EPerceptionState : uint8 {
	Threat_Seeing,
	Threat_LKP,
	Threat_Alerted,
	ObstacleIncoming,
	ObstacleBlockedBy,
	ObstacleDetectedTrap,
	Unknown,
	Count,
	Threat_Count,
	EPerceptionState_MAX,
};

// Enum FortniteGame.EStimType
enum class EStimType : uint8 {
	Seeing,
	Seen,
	MightHaveSeen,
	Hurt,
	Heard,
	Obstacle,
	Enemy,
	Unknown,
	Count,
	EStimType_MAX,
};

// Enum FortniteGame.EDBNOPlayStyle
enum class EDBNOPlayStyle : uint8 {
	Thirsty,
	Default,
	Passive,
	ThristyButPassiveOnPlayers,
	DefaultButPassiveOnPlayers,
	EDBNOPlayStyle_MAX,
};

// Enum FortniteGame.EFortCrucibleWhitelistLevel
enum class EFortCrucibleWhitelistLevel : uint8 {
	None,
	Basic,
	Advanced,
	EFortCrucibleWhitelistLevel_MAX,
};

// Enum FortniteGame.ECreativeQuickbarSlots
enum class ECreativeQuickbarSlots : uint8 {
	Phone,
	ECreativeQuickbarSlots_MAX,
};

// Enum FortniteGame.EQuickbarSlots
enum class EQuickbarSlots : uint8 {
	HarvestingTool,
	Weapon1,
	Weapon2,
	Weapon3,
	Gadget1,
	Gadget2,
	Ability1,
	Ability2,
	Ability3,
	EQuickbarSlots_MAX,
};

// Enum FortniteGame.EFortPickerToDisplay
enum class EFortPickerToDisplay : uint8 {
	TrapPicker,
	WeaponPicker,
	SocialPicker,
	ChatPicker,
	NotePicker,
	EmotePicker,
	SquadQuickChatPicker,
	BattleLabDevicePicker,
	MusicSourcePicker,
	EFortPickerToDisplay_MAX,
};

// Enum FortniteGame.EMapZoomingMode
enum class EMapZoomingMode : uint8 {
	None,
	ZoomingIn,
	ZoomingOut,
	EMapZoomingMode_MAX,
};

// Enum FortniteGame.EFortIdleCheckResult
enum class EFortIdleCheckResult : uint8 {
	Invalid,
	ActivityDetected,
	Idle,
	IdlePastMaxTime,
	EFortIdleCheckResult_MAX,
};

// Enum FortniteGame.EHighlightReelTypes
enum class EHighlightReelTypes : uint8 {
	Generic,
	GameSummary,
	ExtendedGameSummary,
	Builder,
	FastMover,
	LongDistance,
	Multikill,
	StormCloud,
	EHighlightReelTypes_MAX,
};

// Enum FortniteGame.ECameraStateRestoreReason
enum class ECameraStateRestoreReason : uint8 {
	Unknown,
	ChangedFollowTarget,
	ChangedCameraType,
	InvokedHotKey,
	Scrubbed,
	Restored,
	SpecialAction,
	MAX,
};

// Enum FortniteGame.EGyroButtonResponse
enum class EGyroButtonResponse : uint8 {
	NoChange,
	Disable,
	Trackball,
	Invert,
	EGyroButtonResponse_MAX,
};

// Enum FortniteGame.EGyroAcceleration
enum class EGyroAcceleration : uint8 {
	Off,
	Low,
	Medium,
	High,
	Custom,
	Legacy,
	EGyroAcceleration_MAX,
};

// Enum FortniteGame.EGyroActiveMode
enum class EGyroActiveMode : uint8 {
	ScopeOnly,
	AimDownSightsOrFiring,
	ADSOrFiring,
	ADSOrFiringOrHarvestEquipped,
	All,
	EGyroActiveMode_MAX,
};

// Enum FortniteGame.EFortMotionYawAxis
enum class EFortMotionYawAxis : uint8 {
	Yaw,
	Roll,
	EFortMotionYawAxis_MAX,
};

// Enum FortniteGame.EFortInputActionGroup
enum class EFortInputActionGroup : uint8 {
	AllModes,
	Combat,
	Building,
	Movement,
	Edit,
	Death,
	Cinematic,
	Picker,
	Other,
	Interaction,
	AthenaLTMAbilities,
	ShoppingCart,
	ShoppingCartDriver,
	ShoppingCartPassenger,
	Cannon,
	CannonDriver,
	CannonPassenger,
	GolfCart,
	GolfCartDriver,
	GolfCartPassenger,
	QuadCrasher,
	QuadCrasherDriver,
	QuadCrasherPassenger,
	Biplane,
	BiplaneDriver,
	BiplanePassenger,
	Hamsterball,
	Jackal,
	Ostrich,
	OstrichDriver,
	OstrichPassenger,
	Meatball,
	MeatballDriver,
	MeatballPassenger,
	HoagieDriver,
	Dagwood,
	DagwoodDriver,
	DagwoodPassenger,
	Nevada,
	NevadaDriver,
	MountedTurret,
	Spectating,
	FullscreenMap,
	CreativeAll,
	CreativeModeratorMode,
	CreativeMoveToolEquipped,
	CreativeMoveObjectsFreely,
	CreativeMoveBuildingsOnGrid,
	CreativeFlying,
	CreativeIslandPanel,
	PropSelectorEquipped,
	DBNOCarryStart,
	DBNOCarryStop,
	DBNOCarry,
	InteractionStart,
	InteractionStop,
	BattleLab,
	SuperDuper,
	Tether,
	CombatAndBuilding,
	CombatAndAthenaLTMAbilities,
	CombatBuildingAndAthenaLTMAbilities,
	EFortInputActionGroup_MAX,
};

// Enum FortniteGame.EFortInputActionType
enum class EFortInputActionType : uint8 {
	Press,
	Click,
	Hold,
	Release,
	EFortInputActionType_MAX,
};

// Enum FortniteGame.EFortInputDevice
enum class EFortInputDevice : uint8 {
	Mouse,
	Keyboard,
	Gamepad,
	Touch,
	EFortInputDevice_MAX,
};

// Enum FortniteGame.EItemInteractionStatus
enum class EItemInteractionStatus : uint8 {
	Interrupted,
	Completed,
	TimedOut,
	EItemInteractionStatus_MAX,
};

// Enum FortniteGame.EItemInteractionType
enum class EItemInteractionType : uint8 {
	Search,
	LockOnSearch,
	None,
	EItemInteractionType_MAX,
};

// Enum FortniteGame.EBodyPartVisibilityGrouping
enum class EBodyPartVisibilityGrouping : uint8 {
	AllParts,
	AllButHead,
	OnlyBackBling,
	BackBlingAndCharm,
	OnlyBody,
	OnlyHead,
	OnlyTail,
	EBodyPartVisibilityGrouping_MAX,
};

// Enum FortniteGame.EFortDBNOCarryEvent
enum class EFortDBNOCarryEvent : uint8 {
	PickedUp,
	Interrogating,
	Dropped,
	Thrown,
	EFortDBNOCarryEvent_MAX,
};

// Enum FortniteGame.EUpdateCustomDepthOptimDirtyFlags
enum class EUpdateCustomDepthOptimDirtyFlags : uint8 {
	None,
	CharacterParts,
	Weapon,
	PossessedProp,
	EUpdateCustomDepthOptimDirtyFlags_MAX,
};

// Enum FortniteGame.EBackpackType
enum class EBackpackType : uint8 {
	Jetpack,
	Medic,
	StormTracker,
	Glider,
	EBackpackType_MAX,
};

// Enum FortniteGame.EFortPawnState
enum class EFortPawnState : uint8 {
	Default,
	InCombat,
	DBNO,
	IsReviving,
	BeingRevived,
	Dead,
	EFortPawnState_MAX,
};

// Enum FortniteGame.ECustomFeedFilterParticipantNames
enum class ECustomFeedFilterParticipantNames : uint8 {
	NoFiltering,
	AllPlayers,
	ECustomFeedFilterParticipantNames_MAX,
};

// Enum FortniteGame.EFortPlayerSurveyAnalyticsFinishReason
enum class EFortPlayerSurveyAnalyticsFinishReason : uint8 {
	Submitted,
	Canceled,
	EFortPlayerSurveyAnalyticsFinishReason_MAX,
};

// Enum FortniteGame.EFortPlayerSurveyQuestionPresentationStyle
enum class EFortPlayerSurveyQuestionPresentationStyle : uint8 {
	Invalid,
	Standard,
	MultipleChoice_Rating,
	Num,
	EFortPlayerSurveyQuestionPresentationStyle_MAX,
};

// Enum FortniteGame.EFortPlayerSurveyQuestionTypeLegacy
enum class EFortPlayerSurveyQuestionTypeLegacy : uint8 {
	Invalid,
	MultipleChoice,
	MultipleSelection,
	FreeFormText,
	Num,
	EFortPlayerSurveyQuestionTypeLegacy_MAX,
};

// Enum FortniteGame.EVehicleTrickType
enum class EVehicleTrickType : uint8 {
	None,
	RollIncrement,
	ReverseRollIncrement,
	YawIncrement,
	ReverseYawIncrement,
	PitchIncrement,
	ReversePitchIncrement,
	HeightIncrement,
	DistanceIncrement,
	AirTimeIncrement,
	ShoppingCart_Flying,
	ShoppingCart_Stooping,
	StartedLanding,
	FailedLanding,
	Cancelled,
	StuckLanding,
	Count,
	EVehicleTrickType_MAX,
};

// Enum FortniteGame.EVehicleTrickAxis
enum class EVehicleTrickAxis : uint8 {
	X,
	XNeg,
	Y,
	YNeg,
	Z,
	ZNeg,
	Count,
	EVehicleTrickAxis_MAX,
};

// Enum FortniteGame.EFortGameType
enum class EFortGameType : uint8 {
	BR,
	Creative,
	CreativeLTM,
	Playground,
	STW,
	BRArena,
	BRLTM,
	Social,
	MAX,
};

// Enum FortniteGame.EDBNOType
enum class EDBNOType : uint8 {
	On,
	Off,
	NotWhenRespawning,
	EDBNOType_MAX,
};

// Enum FortniteGame.EWeaponSelectionPreservationType
enum class EWeaponSelectionPreservationType : uint8 {
	KeepSelectionWhenRespawning,
	NeverKeepSelection,
	EWeaponSelectionPreservationType_MAX,
};

// Enum FortniteGame.ERewardPlacementBonusType
enum class ERewardPlacementBonusType : uint8 {
	Solo,
	Duo,
	Squad,
	LargeTeam,
	None,
	TwoTeam,
	MediumTeam,
	QuickSolo,
	QuickDuo,
	QuickSquad,
	QuickLargeTeam,
	QuickTwoTeam,
	QuickMediumTeam,
	SinglePlacement,
	ERewardPlacementBonusType_MAX,
};

// Enum FortniteGame.ERewardTimePlayedType
enum class ERewardTimePlayedType : uint8 {
	Default,
	NoReward,
	FlatValue,
	ERewardTimePlayedType_MAX,
};

// Enum FortniteGame.EAthenaWinCondition
enum class EAthenaWinCondition : uint8 {
	LastManStanding,
	LastManStandingIncludingAllies,
	TimedTeamFinalFight,
	FirstToGoalScore,
	TimedLastMenStanding,
	MutatorControlled,
	MutatorControlledGoalScore,
	MutatorControlledChinaSupported,
	EAthenaWinCondition_MAX,
};

// Enum FortniteGame.EAthenaRespawnLocation
enum class EAthenaRespawnLocation : uint8 {
	LastDeath,
	CreativePlayerStart,
	EAthenaRespawnLocation_MAX,
};

// Enum FortniteGame.EAthenaRespawnType
enum class EAthenaRespawnType : uint8 {
	None,
	InfiniteRespawn,
	InfiniteRespawnExceptStorm,
	EAthenaRespawnType_MAX,
};

// Enum FortniteGame.ECustomGameVoiceChannel
enum class ECustomGameVoiceChannel : uint8 {
	Squad,
	FullTeam,
	ECustomGameVoiceChannel_MAX,
};

// Enum FortniteGame.EPlaylistVisibilityState
enum class EPlaylistVisibilityState : uint8 {
	Enabled,
	Disabled,
	EnabledButInvisible,
	Hidden,
	EPlaylistVisibilityState_MAX,
};

// Enum FortniteGame.EPlaylistAdvertisementType
enum class EPlaylistAdvertisementType : uint8 {
	None,
	New,
	Updated,
	EPlaylistAdvertisementType_MAX,
};

// Enum FortniteGame.EPlaysetOffsetType
enum class EPlaysetOffsetType : uint8 {
	CustomOffsetFromCorner,
	Center,
	EPlaysetOffsetType_MAX,
};

// Enum FortniteGame.EFortPlayspaceMatchmakingRules
enum class EFortPlayspaceMatchmakingRules : uint8 {
	AllPlaylists,
	SpecificPlaylists,
	EFortPlayspaceMatchmakingRules_MAX,
};

// Enum FortniteGame.EFortPlayspaceUserAcceptanceType
enum class EFortPlayspaceUserAcceptanceType : uint8 {
	CustomLogic,
	Matchmaking,
	VolumeBased,
	EFortPlayspaceUserAcceptanceType_MAX,
};

// Enum FortniteGame.EPortalLinkCodeLockMode
enum class EPortalLinkCodeLockMode : uint8 {
	NeverLocked,
	WindowLocked,
	AlwaysLocked,
	EPortalLinkCodeLockMode_MAX,
};

// Enum FortniteGame.EFortPreferredItemSlotItemType
enum class EFortPreferredItemSlotItemType : uint8 {
	Unassigned,
	AssaultRifle,
	Shotgun,
	SMG,
	Pistol,
	Sniper,
	Bow,
	Launcher,
	Utility,
	Consumable,
	Num,
	EFortPreferredItemSlotItemType_MAX,
};

// Enum FortniteGame.EProfileGoState
enum class EProfileGoState : uint8 {
	None,
	SettlingLocation,
	RunningCommands,
	CompletedScenario,
	Summary,
	Completed,
	EProfileGoState_MAX,
};

// Enum FortniteGame.EProjectileWaterHitBehavior
enum class EProjectileWaterHitBehavior : uint8 {
	Overlap,
	StopIfStopSimulatingOnHit,
	StopOnOverlap,
	EProjectileWaterHitBehavior_MAX,
};

// Enum FortniteGame.EFortIdleDetectionState
enum class EFortIdleDetectionState : uint8 {
	Disabled,
	Default,
	Suspicious,
	Problematic,
	Inactive,
	EFortIdleDetectionState_MAX,
};

// Enum FortniteGame.EFortPointsFromNavGraphGoalPathDistanceFilterOperator
enum class EFortPointsFromNavGraphGoalPathDistanceFilterOperator : uint8 {
	AllGoalsInRange,
	AnyGoalInRange,
	EFortPointsFromNavGraphGoalPathDistanceFilterOperator_MAX,
};

// Enum FortniteGame.EFortTestGoalActorDot
enum class EFortTestGoalActorDot : uint8 {
	Dot3D,
	Dot2D,
	EFortTestGoalActorDot_MAX,
};

// Enum FortniteGame.EDistanceMode
enum class EDistanceMode : uint8 {
	DistItemToContext,
	DistItemGoalActorToContext,
	DistItemToItemGoalActor,
	EDistanceMode_MAX,
};

// Enum FortniteGame.ECountAIAssignedToType
enum class ECountAIAssignedToType : uint8 {
	Goal,
	Actor,
	Assignment,
	ECountAIAssignedToType_MAX,
};

// Enum FortniteGame.ETwoPointSolverRotationA
enum class ETwoPointSolverRotationA : uint8 {
	PointAToQuerier,
	QuerierToPointA,
	PointAToQuerierWithRandomOffset,
	QuerierToPointAWithRandomOffset,
	Custom,
	ETwoPointSolverRotationA_MAX,
};

// Enum FortniteGame.EObjectiveStatusUpdateType
enum class EObjectiveStatusUpdateType : uint8 {
	Always,
	OnPercent,
	OnComplete,
	Never,
	EObjectiveStatusUpdateType_MAX,
};

// Enum FortniteGame.EFortQuestRewardType
enum class EFortQuestRewardType : uint8 {
	BasicRewards,
	BasicPlusSingleChoice,
	EFortQuestRewardType_MAX,
};

// Enum FortniteGame.EFortQuestSubtype
enum class EFortQuestSubtype : uint8 {
	None,
	WeeklyChallenge,
	PunchCard,
	QuickChallenge,
	Milestone,
	UrgentQuest,
	EFortQuestSubtype_MAX,
};

// Enum FortniteGame.EFortQuestType
enum class EFortQuestType : uint8 {
	Task,
	Optional,
	DailyQuest,
	TransientQuest,
	SurvivorQuest,
	Achievement,
	Onboarding,
	StreamBroadcaster,
	StreamViewer,
	StreamSubscriber,
	Athena,
	AthenaDailyQuest,
	AthenaEvent,
	AthenaChallengeBundleQuest,
	AthenaTransientQuest,
	All,
	EFortQuestType_MAX,
};

// Enum FortniteGame.ECosmeticType
enum class ECosmeticType : uint8 {
	Image,
	Widget,
	ECosmeticType_MAX,
};

// Enum FortniteGame.EFortQuestMapNodeLabelPosition
enum class EFortQuestMapNodeLabelPosition : uint8 {
	Top,
	Bottom,
	EFortQuestMapNodeLabelPosition_MAX,
};

// Enum FortniteGame.EFortQuestMapNodeType
enum class EFortQuestMapNodeType : uint8 {
	MandatoryQuest,
	SideQuest,
	EFortQuestMapNodeType_MAX,
};

// Enum FortniteGame.EInlineObjectiveStatTagCheckEntryType
enum class EInlineObjectiveStatTagCheckEntryType : uint8 {
	Target,
	Source,
	Context,
	EInlineObjectiveStatTagCheckEntryType_MAX,
};

// Enum FortniteGame.EFortXPPropagationRule
enum class EFortXPPropagationRule : uint8 {
	Self,
	Party,
	Squad,
	EFortXPPropagationRule_MAX,
};

// Enum FortniteGame.EFortQuestObjectiveItemEvent
enum class EFortQuestObjectiveItemEvent : uint8 {
	Craft,
	Collect,
	Acquire,
	Consume,
	OpenCardPack,
	PurchaseCardPack,
	Convert,
	Upgrade,
	UpgradeRarity,
	QuestComplete,
	AssignWorker,
	LevelUpCollectionBook,
	LevelUpAthenaSeason,
	LevelUpBattlePass,
	GainAthenaSeasonXp,
	HasItem,
	HasAccumulatedItem,
	SlotInCollection,
	AlterationRespec,
	AlterationUpgrade,
	HasCompletedQuest,
	HasAssignedWorker,
	HasUpgraded,
	HasConverted,
	HasUpgradedRarity,
	HasLeveledUpCollectionBook,
	SlotHeroInLoadout,
	HasLeveledUpAthenaSeason,
	HasLeveledUpBattlePass,
	HasGainedAthenaSeasonXp,
	MinigameTime,
	Max_None,
	EFortQuestObjectiveItemEvent_MAX,
};

// Enum FortniteGame.EFortChallengeBundleInfoLockedReasonCode
enum class EFortChallengeBundleInfoLockedReasonCode : uint8 {
	Unlocked,
	NoKnownUnlockMethod,
	PurchaseTheBattlePass,
	ReachSpecificTier,
	TimeLeftBeforeUnlock,
	EFortChallengeBundleInfoLockedReasonCode_MAX,
};

// Enum FortniteGame.EFortQuestState
enum class EFortQuestState : uint8 {
	Inactive,
	Active,
	Completed,
	Claimed,
	EFortQuestState_MAX,
};

// Enum FortniteGame.ERegisteredPlayerUnregistrationStatus
enum class ERegisteredPlayerUnregistrationStatus : uint8 {
	Registered,
	UnregistrationStarting,
	UnregistrationWaitingForInitialLock,
	UnregistrationWaitingForScoreSave,
	UnregistrationWaitingForFinalSave,
	UnregistrationWaitingForProfileUnlock,
	UnregistrationComplete,
	ERegisteredPlayerUnregistrationStatus_MAX,
};

// Enum FortniteGame.EJoinServerState
enum class EJoinServerState : uint8 {
	Inactive,
	Rejoin,
	Tutorial,
	Abandon,
	EJoinServerState_MAX,
};

// Enum FortniteGame.EEventMatchScreen
enum class EEventMatchScreen : uint8 {
	None,
	ActivePlayerGrid,
	EliminatedPlayerGrid,
	MatchStatus,
	Scoreboard,
	EEventMatchScreen_MAX,
};

// Enum FortniteGame.EDroneFollowMode
enum class EDroneFollowMode : uint8 {
	None,
	ForceFacingLocation,
	ForceFacingFollowedPlayer,
	TetherToFollowedPlayer,
	MAX,
};

// Enum FortniteGame.EHighlightSignificances
enum class EHighlightSignificances : uint8 {
	NotSignificant,
	SomewhatSignificant,
	Significant,
	VerySignificant,
	Critical,
	EHighlightSignificances_MAX,
};

// Enum FortniteGame.EHighlightFeatures
enum class EHighlightFeatures : uint8 {
	INVALID,
	FollowingPlayerKill,
	FollowingPlayerDeath,
	InterestingDeathCause,
	BusyBuilder,
	FastMover,
	LongDistanceKill,
	Multikill,
	StormCloudAction,
	WinningMoment,
	PlacementScore,
	FollowingPlayerKillDBNO,
	FollowingPlayerDBNOFinished,
	MaxLongKillDistance,
	VehicleMultikill,
	VehiclePlayerLaunchDistance,
	VehicleKills,
	MaxMidFallKillTime,
	MaxMidFallNoScopeKillTime,
	MaxMidFallKillSpeed,
	MaxMidFallNoScopeSpeed,
	FallingElimination,
	VehicleUsage,
	COUNT,
	EHighlightFeatures_MAX,
};

// Enum FortniteGame.EClassRepNodeMapping
enum class EClassRepNodeMapping : uint8 {
	NotRouted,
	RelevantAllConnections,
	RelevantAllInsideFortVolume,
	Spatialize_Static,
	Spatialize_Dynamic,
	Spatialize_Dormancy,
	Instance_Dynamic,
	EClassRepNodeMapping_MAX,
};

// Enum FortniteGame.ECrucibleWhitelistOverride
enum class ECrucibleWhitelistOverride : uint8 {
	DoNothing,
	ForceOn,
	ForceOff,
	ECrucibleWhitelistOverride_MAX,
};

// Enum FortniteGame.EFortItemShopSection
enum class EFortItemShopSection : uint8 {
	RMTItemOffer,
	Featured,
	Daily,
	SpecialFeatured,
	SpecialDaily,
	Standalone,
	CommunityChoice,
	MegaBundle,
	BattlePass,
	MAX_None,
	EFortItemShopSection_MAX,
};

// Enum FortniteGame.EFortRuntimeOptionTabStateTarget
enum class EFortRuntimeOptionTabStateTarget : uint8 {
	All,
	Primary,
	Secondary,
	EFortRuntimeOptionTabStateTarget_MAX,
};

// Enum FortniteGame.EFortRuntimeOptionTabState
enum class EFortRuntimeOptionTabState : uint8 {
	Default,
	Disabled,
	Hidden,
	EFortRuntimeOptionTabState_MAX,
};

// Enum FortniteGame.ENewsExternalURLMode
enum class ENewsExternalURLMode : uint8 {
	PatchNotes,
	UpdateNotes,
	MoreInformation,
	ENewsExternalURLMode_MAX,
};

// Enum FortniteGame.EFortSafeZoneState
enum class EFortSafeZoneState : uint8 {
	None,
	Starting,
	Holding,
	Shrinking,
	EFortSafeZoneState_MAX,
};

// Enum FortniteGame.EFortUIScoreType
enum class EFortUIScoreType : uint8 {
	Combat,
	Building,
	Utility,
	Badges,
	Bonus,
	Total,
	Max_None,
	EFortUIScoreType_MAX,
};

// Enum FortniteGame.EFortScriptedActionEnvironment
enum class EFortScriptedActionEnvironment : uint8 {
	FrontEnd,
	GameServer,
	GameClient,
	Max_None,
	EFortScriptedActionEnvironment_MAX,
};

// Enum FortniteGame.EFortScriptedActionSource
enum class EFortScriptedActionSource : uint8 {
	Quest,
	Token,
	Manual,
	Max_None,
	EFortScriptedActionSource_MAX,
};

// Enum FortniteGame.EServerManifestOutputFormat
enum class EServerManifestOutputFormat : uint8 {
	FlatFile,
	Json,
	HTTP,
	EServerManifestOutputFormat_MAX,
};

// Enum FortniteGame.EServerManifestCommandType
enum class EServerManifestCommandType : uint8 {
	Move,
	Copy,
	Unknown,
	EServerManifestCommandType_MAX,
};

// Enum FortniteGame.EFortSessionHelperJoinState
enum class EFortSessionHelperJoinState : uint8 {
	NotJoining,
	RequestingReservation,
	FailedReservation,
	WaitingOnGame,
	AttemptingJoin,
	JoiningSession,
	FailedJoin,
	CanceledJoin,
	EFortSessionHelperJoinState_MAX,
};

// Enum FortniteGame.ESkeletalAudioBoneVelocityType
enum class ESkeletalAudioBoneVelocityType : uint8 {
	Linear,
	Rotational,
	Custom,
	ESkeletalAudioBoneVelocityType_MAX,
};

// Enum FortniteGame.ESkeletalAudioBoneSpace
enum class ESkeletalAudioBoneSpace : uint8 {
	Relative,
	World,
	ESkeletalAudioBoneSpace_MAX,
};

// Enum FortniteGame.ESkeletalAudioBoneEvent
enum class ESkeletalAudioBoneEvent : uint8 {
	None,
	SlowThresholdStart,
	SlowThresholdStop,
	MediumThreshold,
	FastThreshold,
	ESkeletalAudioBoneEvent_MAX,
};

// Enum FortniteGame.EFortPowerRatingComparison
enum class EFortPowerRatingComparison : uint8 {
	InRange,
	OverLevel,
	UnderLevel,
	Unknown,
	EFortPowerRatingComparison_MAX,
};

// Enum FortniteGame.EFortInvalidActivityReason
enum class EFortInvalidActivityReason : uint8 {
	None,
	PartyTooBig,
	PartyTooSmall,
	NotPartyLeader,
	MatchmakingAlready,
	InvalidData,
	EFortInvalidActivityReason_MAX,
};

// Enum FortniteGame.EAcceptFriendInviteFailureReason
enum class EAcceptFriendInviteFailureReason : uint8 {
	InviterTooManyFriends,
	SelfTooManyFriends,
	UnknownError,
	EAcceptFriendInviteFailureReason_MAX,
};

// Enum FortniteGame.ESendFriendInviteFailureReason
enum class ESendFriendInviteFailureReason : uint8 {
	NotFound,
	AlreadyFriends,
	InvitePending,
	AddingSelfFail,
	AddingBlockedFail,
	AutoDeclined,
	BlockedByTarget,
	InviteeInboxFull,
	SelfOutboxFull,
	UnknownError,
	ESendFriendInviteFailureReason_MAX,
};

// Enum FortniteGame.EFortSocialFriendRequestMethod
enum class EFortSocialFriendRequestMethod : uint8 {
	LobbySuggestion,
	LobbyPlayerPanel,
	MassImportPlatformFriends,
	AutoImportPlatformFriends,
	PartyContextRewriteHelper,
	EFortSocialFriendRequestMethod_MAX,
};

// Enum FortniteGame.EFortSoundIndicatorTypes
enum class EFortSoundIndicatorTypes : uint8 {
	Generic,
	FootStep,
	Gunshot,
	Chest,
	Glider,
	Vehicle,
	COUNT,
	EFortSoundIndicatorTypes_MAX,
};

// Enum FortniteGame.EFortSpawnActorTime
enum class EFortSpawnActorTime : uint8 {
	PostPlaylistLoad,
	StartOfStormHoldTime,
	EFortSpawnActorTime_MAX,
};

// Enum FortniteGame.ESplineWaterAudioFacingDirection
enum class ESplineWaterAudioFacingDirection : uint8 {
	None,
	Inwards,
	Outwards,
	ESplineWaterAudioFacingDirection_MAX,
};

// Enum FortniteGame.ESplineWaterAudioWindingOrder
enum class ESplineWaterAudioWindingOrder : uint8 {
	Clockwise,
	Counterclockwise,
	ESplineWaterAudioWindingOrder_MAX,
};

// Enum FortniteGame.EFortEventConditionType
enum class EFortEventConditionType : uint8 {
	EFEC_StatCompare,
	EFEC_MAX,
};

// Enum FortniteGame.EFortCompare
enum class EFortCompare : uint8 {
	EFC_LessThan,
	EFC_LessThanOrEqual,
	EFC_GreaterThan,
	EFC_GreaterThanOrEqual,
	EFC_Equals,
	EFC_MAX,
};

// Enum FortniteGame.EFortEventRepeat
enum class EFortEventRepeat : uint8 {
	EFER_Inactive,
	EFER_Always,
	EFER_OncePerPlayer,
	EFER_OncePerCampaign,
	EFER_OncePerMap,
	EFER_MAX,
};

// Enum FortniteGame.EFortStatType
enum class EFortStatType : uint8 {
	Fortitude,
	Offense,
	Resistance,
	Technology,
	Fortitude_Team,
	Offense_Team,
	Resistance_Team,
	Technology_Team,
	Invalid,
	EFortStatType_MAX,
};

// Enum FortniteGame.UCPTypes
enum class UCPTypes : uint8 {
	UCPAudio,
	UCPVideo,
	UCPBoth,
	UCPNone,
	UCPTypes_MAX,
};

// Enum FortniteGame.ESupplyDropItemTrackType
enum class ESupplyDropItemTrackType : uint8 {
	SpecialActors,
	ESupplyDropItemTrackType_MAX,
};

// Enum FortniteGame.ESupplyDropSpawnType
enum class ESupplyDropSpawnType : uint8 {
	SafeZoneDriven,
	ItemDeliveryManagement,
	MutatorManaged,
	ESupplyDropSpawnType_MAX,
};

// Enum FortniteGame.EFortSwimmingAudioType
enum class EFortSwimmingAudioType : uint8 {
	Normal,
	Sprint,
	SprintStart,
	PickaxeSwing,
	NormalDBNO,
	SprintBoostStart,
	SwimStart,
	SwimEnd,
	Max_None,
	EFortSwimmingAudioType_MAX,
};

// Enum FortniteGame.EFortAutoTestState
enum class EFortAutoTestState : uint8 {
	InitialLoad,
	Login,
	FrontendLoad,
	FrontendPvELoad,
	FrontendPvETest,
	PvEMatchmaking,
	ZoneLoad,
	ZoneTest,
	Finished,
	MAX,
};

// Enum FortniteGame.EReplaySmokeTestStep
enum class EReplaySmokeTestStep : uint8 {
	Setup,
	TogglePause,
	StepForward,
	StepBackward,
	StepToEnd,
	StepToBeginning,
	SpeedUpPlayback,
	SlowDownPlayback,
	ToggleHideTimeline,
	IterateCameraModes,
	TogglePlayerOutlines,
	ToggleNamePlates,
	ToggleReplayRegion,
	ZoomIn,
	ZoomOut,
	ToggleAutoFollowThirdPerson,
	IncreaseExposure,
	DecreaseExposure,
	SetAutoExposure,
	IncreaseAperture,
	DecreaseAperture,
	IncreaseFocalLength,
	DecreaseFocalLength,
	IncreaseFocusDistance,
	DecreaseFocusDistance,
	SetAutoFocus,
	ToggleDamageEffects,
	ToggleHideUI,
	ToggleMap,
	Reset,
	MAX,
};

// Enum FortniteGame.EFortTheaterType
enum class EFortTheaterType : uint8 {
	Standard,
	Elder,
	PvP,
	PvP2,
	Tutorial,
	TutorialGate,
	Max_None,
	EFortTheaterType_MAX,
};

// Enum FortniteGame.EFortTheaterMapTileType
enum class EFortTheaterMapTileType : uint8 {
	Normal,
	CriticalMission,
	AlwaysActive,
	Outpost,
	NonMission,
	PvPFOB,
	EFortTheaterMapTileType_MAX,
};

// Enum FortniteGame.EFortMapNavigationDirection
enum class EFortMapNavigationDirection : uint8 {
	North,
	NorthEast,
	East,
	SouthEast,
	South,
	SouthWest,
	West,
	NorthWest,
	Invalid,
	EFortMapNavigationDirection_MAX,
};

// Enum FortniteGame.EFortMissionQuestValidityResult
enum class EFortMissionQuestValidityResult : uint8 {
	Invalid,
	InvalidNotPlayable,
	ValidLinked,
	ValidObjectiveCondition,
	ValidFallback,
	EFortMissionQuestValidityResult_MAX,
};

// Enum FortniteGame.EThresholdRequirement
enum class EThresholdRequirement : uint8 {
	LessThan,
	LessThanOrEqual,
	Equal,
	GreaterThan,
	GreaterThanOrEqual,
	EThresholdRequirement_MAX,
};

// Enum FortniteGame.ECollectionSelectionMethod
enum class ECollectionSelectionMethod : uint8 {
	TierAsIndex,
	TierAsIndexOverflowToLastValid,
	Modulo,
	Random,
	None,
	ECollectionSelectionMethod_MAX,
};

// Enum FortniteGame.EGlobalWeatherState
enum class EGlobalWeatherState : uint8 {
	Inactive,
	Active,
	BlendingIn,
	BlendingOut,
	EGlobalWeatherState_MAX,
};

// Enum FortniteGame.EWidgetInterfaceTimerStatus
enum class EWidgetInterfaceTimerStatus : uint8 {
	None,
	Active,
	Paused,
	Inactive,
	EWidgetInterfaceTimerStatus_MAX,
};

// Enum FortniteGame.EFortTipDisplayPlatformGroup
enum class EFortTipDisplayPlatformGroup : uint8 {
	None,
	Desktop,
	Console,
	Switch,
	Mobile,
	EFortTipDisplayPlatformGroup_MAX,
};

// Enum FortniteGame.EPayoutScoringType
enum class EPayoutScoringType : uint8 {
	Invalid,
	Points,
	Ranking,
	Percentile,
	Persistent,
	EPayoutScoringType_MAX,
};

// Enum FortniteGame.EPayoutRewardType
enum class EPayoutRewardType : uint8 {
	Invalid,
	Commerce,
	GameRelated,
	Token,
	Score,
	EPayoutRewardType_MAX,
};

// Enum FortniteGame.ETournamentDisplayType
enum class ETournamentDisplayType : uint8 {
	Default,
	Creative,
	ETournamentDisplayType_MAX,
};

// Enum FortniteGame.EScoreMatchOperator
enum class EScoreMatchOperator : uint8 {
	Invalid,
	LessThan,
	LessThanOrEqual,
	Equal,
	GreaterThan,
	GreaterThanOrEqual,
	EScoreMatchOperator_MAX,
};

// Enum FortniteGame.FTowhookExtensionState
enum class FTowhookExtensionState : uint8 {
	Hold,
	Extend,
	Contract,
	FTowhookExtensionState_MAX,
};

// Enum FortniteGame.EMessageFeedSubject
enum class EMessageFeedSubject : uint8 {
	ToyOwner,
	OtherPlayerInteractingWithToy,
	EMessageFeedSubject_MAX,
};

// Enum FortniteGame.EMessageFeedRelationshipFilter
enum class EMessageFeedRelationshipFilter : uint8 {
	Anyone,
	SquadAndTeamMembers,
	SquadMembersOnly,
	SelfOnly,
	EMessageFeedRelationshipFilter_MAX,
};

// Enum FortniteGame.ETrackVerticality
enum class ETrackVerticality : uint8 {
	Floor,
	Ramp,
	GradualRamp,
	Max_None,
	ETrackVerticality_MAX,
};

// Enum FortniteGame.ETrackIncline
enum class ETrackIncline : uint8 {
	NoNeighbor,
	Flat,
	Up,
	Down,
	GradualUp,
	GradualDown,
	Max_None,
	ETrackIncline_MAX,
};

// Enum FortniteGame.ETrackPieceType
enum class ETrackPieceType : uint8 {
	None,
	Straight,
	Turn,
	TShape,
	Cross,
	Max_None,
	ETrackPieceType_MAX,
};

// Enum FortniteGame.ETrackDirection
enum class ETrackDirection : uint8 {
	YNegative,
	XPositive,
	YPositive,
	XNegative,
	Max_None,
	ETrackDirection_MAX,
};

// Enum FortniteGame.EFortServerTickRate
enum class EFortServerTickRate : uint8 {
	UseDefault,
	Twenty,
	Thirty,
	EFortServerTickRate_MAX,
};

// Enum FortniteGame.EDuelState
enum class EDuelState : uint8 {
	Started,
	Won,
	Lost,
	EDuelState_MAX,
};

// Enum FortniteGame.EMissionStormShieldState
enum class EMissionStormShieldState : uint8 {
	IDLE,
	GROWING,
	SHRINKING,
	MAX,
};

// Enum FortniteGame.EDynamicBackgroudKey
enum class EDynamicBackgroudKey : uint8 {
	Lobby,
	Vault,
	Max_None,
	EDynamicBackgroudKey_MAX,
};

// Enum FortniteGame.EFortLeaderboardMetric
enum class EFortLeaderboardMetric : uint8 {
	Score,
	Kills,
	TeamScore,
	EFortLeaderboardMetric_MAX,
};

// Enum FortniteGame.UFortMatchmakingKnobsDataSource
enum class UFortMatchmakingKnobsDataSource : uint8 {
	None,
	Playlist,
	Mutator,
	GameMode,
	Permissions,
	UISettings,
	CreativeGlobalOption,
	Max,
};

// Enum FortniteGame.ECreativeItemCategory
enum class ECreativeItemCategory : uint8 {
	Prefabs,
	Devices,
	Weapons,
	Consumables,
	Gallery,
	None,
	ECreativeItemCategory_MAX,
};

// Enum FortniteGame.EFortPlaylistTeamSizeType
enum class EFortPlaylistTeamSizeType : uint8 {
	Solo,
	Duo,
	Trio,
	Squad,
	LargeTeam,
	MAX,
};

// Enum FortniteGame.EFortGameFeatureState
enum class EFortGameFeatureState : uint8 {
	Unknown,
	Unavailable,
	Downloading,
	DownloadFailed,
	Available,
	Preloading,
	Preloaded,
	Loading,
	Loaded,
	Count,
	EFortGameFeatureState_MAX,
};

// Enum FortniteGame.EFortGameFeature
enum class EFortGameFeature : uint8 {
	EarlyStartup,
	DedicatedServer,
	KairosInitial,
	KairosCapture,
	KairosLoadElectraPlayer,
	DanceRoyale,
	Frontend,
	GameplayAthena,
	GameplayCampaignTutorial,
	GameplayCampaign,
	GameplayCreative,
	Invalid,
	Count,
	EFortGameFeature_MAX,
};

// Enum FortniteGame.EFortStartupPhase
enum class EFortStartupPhase : uint8 {
	InitializingEngine,
	EarlyStartupLoading,
	EarlyStartupFinished,
	GameStartupLoading,
	GameStartupFinished,
	Invalid,
	Count,
	EFortStartupPhase_MAX,
};

// Enum FortniteGame.EFortCreativeAdColorPreset
enum class EFortCreativeAdColorPreset : uint8 {
	Default,
	Emphasized,
	Common,
	Uncommon,
	Rare,
	Epic,
	Legendary,
	EFortCreativeAdColorPreset_MAX,
};

// Enum FortniteGame.EFortCreativeAdType
enum class EFortCreativeAdType : uint8 {
	Default,
	Playset,
	Toy,
	Game,
	Island,
	Knob,
	EFortCreativeAdType_MAX,
};

// Enum FortniteGame.EEventTournamentType
enum class EEventTournamentType : uint8 {
	Online,
	Onsite,
	Test,
	Unknown,
	EEventTournamentType_MAX,
};

// Enum FortniteGame.EFortLobbyType
enum class EFortLobbyType : uint8 {
	Default,
	Tournament,
	Creative,
	Division,
	EFortLobbyType_MAX,
};

// Enum FortniteGame.EFortMatchmakingViolatorStyle
enum class EFortMatchmakingViolatorStyle : uint8 {
	None,
	Basic,
	HighStakes,
	Showdown,
	EFortMatchmakingViolatorStyle_MAX,
};

// Enum FortniteGame.EFortMatchmakingTileStyle
enum class EFortMatchmakingTileStyle : uint8 {
	None,
	Special,
	HighStakes,
	Showdown,
	EFortMatchmakingTileStyle_MAX,
};

// Enum FortniteGame.EFortErrorSeverity
enum class EFortErrorSeverity : uint8 {
	Unspecified,
	Silent,
	Passive,
	Blocking,
	SevereBlocking,
	EFortErrorSeverity_MAX,
};

// Enum FortniteGame.EFortPickerMode
enum class EFortPickerMode : uint8 {
	BuildingCategory,
	TrapCategory,
	WeaponCategory,
	SocialCategory,
	Building,
	Trap,
	TrapRadial,
	Weapon,
	Social,
	DirectPickEmote,
	DirectPickSpray,
	SquadQuickChat,
	WeaponsSlotted,
	BattleLabDevice,
	MusicSource,
	EFortPickerMode_MAX,
};

// Enum FortniteGame.EPTTState
enum class EPTTState : uint8 {
	Enabled,
	MicDisabled,
	AllSoundDisabled,
	EPTTState_MAX,
};

// Enum FortniteGame.EMobileInteractionIconTypes
enum class EMobileInteractionIconTypes : uint8 {
	Interact,
	Swap,
	Revive,
	Blocked,
	MAX,
};

// Enum FortniteGame.EAthenaPickerType
enum class EAthenaPickerType : uint8 {
	EditMode,
	Interact,
	MAX,
};

// Enum FortniteGame.EFortGliderType
enum class EFortGliderType : uint8 {
	Glider,
	Umbrella,
	EFortGliderType_MAX,
};

// Enum FortniteGame.EItemListViewDisplayType
enum class EItemListViewDisplayType : uint8 {
	World,
	Outpost,
	Account,
	DeployableBase,
	Max,
};

// Enum FortniteGame.EStormShieldDefense
enum class EStormShieldDefense : uint8 {
	NotSSD,
	StormShieldExpansion,
	WargameSimulation,
	EStormShieldDefense_MAX,
};

// Enum FortniteGame.EFortClientAnnouncementQueueType
enum class EFortClientAnnouncementQueueType : uint8 {
	Toasts,
	Stickies,
	Max,
};

// Enum FortniteGame.EFortNotificationQueueType
enum class EFortNotificationQueueType : uint8 {
	Toasts,
	Stickies,
	Messages,
	Max,
};

// Enum FortniteGame.EFortDialogResult
enum class EFortDialogResult : uint8 {
	Confirmed,
	Declined,
	Ignored,
	Killed,
	TimedOut,
	Unknown,
	EFortDialogResult_MAX,
};

// Enum FortniteGame.ETutorialType
enum class ETutorialType : uint8 {
	None,
	Callout,
	GuardScreen,
	WidgetIntro,
	Highlight,
	ETutorialType_MAX,
};

// Enum FortniteGame.EFortBangType
enum class EFortBangType : uint8 {
	Invalid,
	Custom,
	PlayTab,
	VaultTab,
	StoreTab,
	FriendsButton,
	PartyInviteButton,
	SubGameAccessChanged,
	DailyRewardsButton,
	QuestsButton,
	CompletedExpeditions,
	MainMenu,
	HelpMenu,
	VaultSchematics,
	VaultLeadSurvivors,
	VaultSurvivors,
	VaultHeroes,
	VaultDefenders,
	VaultResources,
	VaultMelee,
	VaultRanged,
	VaultConsumables,
	VaultIngredients,
	VaultTraps,
	BattlePassTab,
	SpecialEventTab,
	CosmeticsTab,
	CosmeticsOutfit,
	CosmeticGlider,
	CosmeticContrail,
	CosmeticBattleBus,
	CosmeticVehicle,
	CosmeticItemWrap,
	CosmeticCallingCard,
	CosmeticMapMarker,
	CosmeticMusicPack,
	CosmeticPetSkin,
	CosmeticLoadingScreen,
	CosmeticBackpack,
	CosmeticHat,
	CosmeticPickaxe,
	CosmeticDance,
	CosmeticCharm,
	AthenaDirectedAcquisitionTab,
	ItemShop_RMTItemOfferTab,
	ItemShop_FeaturedTab,
	ItemShop_DailyTab,
	ItemShop_SpecialFeaturedTab,
	ItemShop_SpecialDailyTab,
	ItemShop_StandaloneTab,
	ItemShop_CommunityVotingTab,
	ItemShop_MegaBundleTab,
	ItemShop_BattlePassTab,
	AthenaChallengesTab,
	AthenaShowdownTab,
	AthenaCareerTab,
	PlayerBanners,
	STWCommand,
	STWCommand_Heroes,
	STWCommand_Heroes_Manage,
	STWCommand_Heroes_HeroLoadout,
	STWCommand_Heroes_Defenders,
	STWCommand_Heroes_Expeditions,
	STWCommand_Survivors,
	STWCommand_Survivors_Manage,
	STWCommand_Survivors_Squads,
	STWCommand_Upgrades,
	STWCommand_Research,
	STWCommand_AccountXP,
	STWArmory,
	STWArmory_Schematics,
	STWArmory_Backpack,
	STWArmory_Storage,
	STWArmory_CollectionBook,
	STWArmory_Transform,
	STWArmory_Resources,
	STWLocker,
	EFortBangType_MAX,
};

// Enum FortniteGame.EItemShopNavigationAction
enum class EItemShopNavigationAction : uint8 {
	None,
	ShowOfferDetails,
	NavigateToOffer,
	EItemShopNavigationAction_MAX,
};

// Enum FortniteGame.EFortEventNameType
enum class EFortEventNameType : uint8 {
	Mission,
	Client,
	EFortEventNameType_MAX,
};

// Enum FortniteGame.EFortCraftFailCause
enum class EFortCraftFailCause : uint8 {
	Unknown,
	NotEnoughResources,
	InventoryFull,
	InsufficientTeamLevel,
	CraftingQueueFull,
	CurrentlyLocked,
	OverflowSchematic,
	EFortCraftFailCause_MAX,
};

// Enum FortniteGame.EKeepDefenseState
enum class EKeepDefenseState : uint8 {
	Inactive,
	Warmup,
	Defense,
	LastAlive,
	Max,
};

// Enum FortniteGame.EKeepContainerType
enum class EKeepContainerType : uint8 {
	Base,
	Storeroom,
	FirstAid,
	Armory,
	Workshop,
	AmmoStash,
	Max,
};

// Enum FortniteGame.EFortIndicatorState
enum class EFortIndicatorState : uint8 {
	Hidden,
	OnlyFriendsVisible,
	Visible,
	EFortIndicatorState_MAX,
};

// Enum FortniteGame.EFortAIUtility
enum class EFortAIUtility : uint8 {
	KillPlayersMelee,
	KillPlayersRanged,
	KillPlayersArtillery,
	DestroyBuildingsMelee,
	DestroyBuildingsRanged,
	DestroyBuildingsArtillery,
	DestroyTraps,
	Tank,
	Infiltrate,
	Mob,
	Support,
	Kiting,
	AreaOfDenial,
	DisableTraps,
	Dormant,
	Assassin,
	MAX,
};

// Enum FortniteGame.EFortTileEdgeType
enum class EFortTileEdgeType : uint8 {
	Undefined,
	Outer_2,
	Transition_3,
	Inner_4,
	Border_5,
	BorderTransitionSingle_6,
	BorderTransitionDouble_7,
	MAX,
};

// Enum FortniteGame.EFortMovementUrgency
enum class EFortMovementUrgency : uint8 {
	None,
	Low,
	Medium,
	High,
	NumLevels,
	EFortMovementUrgency_MAX,
};

// Enum FortniteGame.EFortMovementStyle
enum class EFortMovementStyle : uint8 {
	Running,
	Walking,
	Charging,
	Sprinting,
	PersonalVehicle,
	Flying,
	Tethered,
	Burrowing,
	EFortMovementStyle_MAX,
};

// Enum FortniteGame.EFortWeaponTriggerType
enum class EFortWeaponTriggerType : uint8 {
	OnPress,
	Automatic,
	OnRelease,
	OnPressAndRelease,
	EFortWeaponTriggerType_MAX,
};

// Enum FortniteGame.EFortDayPhasePrio
enum class EFortDayPhasePrio : uint8 {
	Default,
	DailySummary,
	EFortDayPhasePrio_MAX,
};

// Enum FortniteGame.EFortPawnDisplayContext
enum class EFortPawnDisplayContext : uint8 {
	BattleRoyale,
	VaultItemsFromOffer,
	VaultItem,
	VaultItems,
	VaultItemFromDefinition,
	CampaignFrontEndPlayer,
	CampaignNPC,
	CampaignHeroInspect,
	CampaignHeroLoadoutSupport,
	CampaignOutfitPicker,
	EFortPawnDisplayContext_MAX,
};

// Enum FortniteGame.EFortCustomCharmType
enum class EFortCustomCharmType : uint8 {
	Weapon,
	Lapel,
	Backpack1,
	Backpack2,
	NumTypes,
	EFortCustomCharmType_MAX,
};

// Enum FortniteGame.EFortDisplayGender
enum class EFortDisplayGender : uint8 {
	Unknown,
	Male,
	Female,
	NumTypes,
	EFortDisplayGender_MAX,
};

// Enum FortniteGame.EFortTargetSelectionFilter
enum class EFortTargetSelectionFilter : uint8 {
	Damageable,
	Everything,
	Pawns,
	Buildings,
	Walls,
	Traps,
	Players,
	AIPawns,
	Instigator,
	WeakSpots,
	World,
	Max,
};

// Enum FortniteGame.EFortWeaponType
enum class EFortWeaponType : uint8 {
	None,
	RangedAny,
	Pistol,
	Shotgun,
	Rifle,
	SMG,
	Sniper,
	GrenadeLauncher,
	RocketLauncher,
	Bow,
	Minigun,
	LMG,
	BiplaneGun,
	MeleeAny,
	Harvesting,
	MAX,
};

// Enum FortniteGame.EFortTargetSelectionTestType
enum class EFortTargetSelectionTestType : uint8 {
	Overlap,
	Swept,
	Ballistic,
	EFortTargetSelectionTestType_MAX,
};

// Enum FortniteGame.EFortTargetSelectionShape
enum class EFortTargetSelectionShape : uint8 {
	Sphere,
	Cone,
	Box,
	Capsule,
	Line,
	Cylinder,
	Custom,
	CustomOnSource,
	EFortTargetSelectionShape_MAX,
};

// Enum FortniteGame.EFortBrushSize
enum class EFortBrushSize : uint8 {
	VeryVerySmall,
	VerySmall,
	Small,
	Medium,
	Large,
	VeryLarge,
	EFortBrushSize_MAX,
};

// Enum FortniteGame.ESpecialActorStatType
enum class ESpecialActorStatType : uint8 {
	NumEliminationsNearby,
	TimeInWorld,
	PickupNumSpawns,
	PickupNumDespawns,
	PickupNumDropped,
	PickupNumTaken,
	PlayerWon,
	PlayerNumEliminations,
	PlayerNum,
	TotalStats,
	ESpecialActorStatType_MAX,
};

// Enum FortniteGame.EFortItemViewRotationMode
enum class EFortItemViewRotationMode : uint8 {
	None,
	BoundsPivot,
	World,
	Relative,
	EFortItemViewRotationMode_MAX,
};

// Enum FortniteGame.EChangeInStructDetected
enum class EChangeInStructDetected : uint8 {
	Dirty,
	Clean,
	EChangeInStructDetected_MAX,
};

// Enum FortniteGame.EFortInventoryCustomFilter
enum class EFortInventoryCustomFilter : uint8 {
	Mythic,
	Legendary,
	Epic,
	Rare,
	Uncommon,
	Common,
	EFortInventoryCustomFilter_MAX,
};

// Enum FortniteGame.EInventoryContentSortType
enum class EInventoryContentSortType : uint8 {
	ByName,
	ByRating,
	ByLevel,
	ByCategory,
	ByRarity,
	ByLocation,
	ByPersonality,
	ByBonus,
	BySubtype,
	ByGrantTime,
	Invalid,
	EInventoryContentSortType_MAX,
};

// Enum FortniteGame.EFortFrontendInventoryFilter
enum class EFortFrontendInventoryFilter : uint8 {
	Schematics,
	WorldItems,
	WorldItemsInGame,
	WorldItemsStorage,
	WorldItemsTransfer,
	ConsumablesAndAccountResources,
	Heroes,
	Defenders,
	Survivors,
	AthenaCharacter,
	AthenaBackpack,
	AthenaPickaxe,
	AthenaGliders,
	AthenaContrails,
	AthenaEmotes,
	AthenaItemWraps,
	AthenaLoadingScreens,
	AthenaLobbyMusic,
	AthenaCharm,
	HestiaWeapons,
	HestiaResources,
	StarlightInventory,
	Invisible,
	Max_None,
	EFortFrontendInventoryFilter_MAX,
};

// Enum FortniteGame.EFortInventoryFilter
enum class EFortInventoryFilter : uint8 {
	WeaponMelee,
	WeaponRanged,
	Ammo,
	Traps,
	Consumables,
	Ingredients,
	Gadget,
	Decorations,
	Badges,
	Heroes,
	LeadSurvivors,
	Survivors,
	Defenders,
	Resources,
	ConversionControl,
	AthenaCosmetics,
	Playset,
	CreativePlot,
	TeamPerk,
	Workers,
	Invisible,
	Max_None,
	EFortInventoryFilter_MAX,
};

// Enum FortniteGame.EFortItemCategoryOrdinal
enum class EFortItemCategoryOrdinal : uint8 {
	Primary,
	Secondary,
	Tertiary,
	EFortItemCategoryOrdinal_MAX,
};

// Enum FortniteGame.ESubGameMatchmakingStatus
enum class ESubGameMatchmakingStatus : uint8 {
	Disabled,
	Enabled,
	ESubGameMatchmakingStatus_MAX,
};

// Enum FortniteGame.ESubGameAccessStatus
enum class ESubGameAccessStatus : uint8 {
	Disabled,
	LimitedAccess,
	OpenAccess,
	ESubGameAccessStatus_MAX,
};

// Enum FortniteGame.EUIExtensionSlot
enum class EUIExtensionSlot : uint8 {
	Primary,
	TopRightCorner,
	GameInfoBox,
	Quickbar,
	QuickbarUnderlay,
	UpperCenter,
	CrosshairRight,
	UnderSquadInfo,
	FullScreenMap,
	BelowRespawnWidget,
	BelowCompass,
	UnderTeammateStatus,
	ControllerBindingCallout,
	AboveStormMessageSlot,
	CustomMinigameCallouts,
	UnderLocalPlayerInfo,
	PlayerHealthbarOverlay,
	InventoryScreenReplacement,
	Reticle,
	KillfeedSlot,
	PrioritizedContextualSlot,
	RightOfTeammateStatus,
	TeammateStatusPortraitOverlay,
	MobileHUDBottomRight,
	InventoryScreenTab,
	InventoryPanelSubTab,
	MiniMapOverlay,
	InventoryEquipSlot,
	InventoryItemInfo,
	HUDEquippedItemInfo,
	UnderneathTeammateStatusList,
	FullScreenMapSquadEliminationsOverlay,
	PrimaryQuickBarSlot,
	EUIExtensionSlot_MAX,
};

// Enum FortniteGame.EFortUIFriendNotificationType
enum class EFortUIFriendNotificationType : uint8 {
	Default,
	FriendRequest,
	PartyInvite,
	InviteFriendToParty,
	PartyRequest,
	AutoImportFriendSuggestion,
	PartyMemberCreated,
	EFortUIFriendNotificationType_MAX,
};

// Enum FortniteGame.EFortNotificationPriority
enum class EFortNotificationPriority : uint8 {
	Vote,
	Friend,
	BoostedXP,
	TwitchHigh,
	GeneralSendNotification,
	TwitchLow,
	Max,
};

// Enum FortniteGame.EFortNotificationType
enum class EFortNotificationType : uint8 {
	Default,
	Power,
	HealthWarning,
	Error,
	GiftSent,
	VoiceChannel,
	FriendSubscriptionNudge,
	DonutChallenge,
	HousepartyWelcome,
	HousepartyFOMO,
	HousepartyMic,
	IncomingFriendRequest,
	SocialNotification,
	BattlePassPageUnlock,
	Max,
};

// Enum FortniteGame.EFortContextualReticleTypes
enum class EFortContextualReticleTypes : uint8 {
	FCR_GenericFailure,
	FCR_Upgrade,
	FCR_Repair,
	FCR_Locked,
	FCR_Placement,
	FCR_Edit,
	FCR_NoTarget,
	FCR_InProgress,
	FCR_None,
	FCR_MAX,
};

// Enum FortniteGame.EFortUserCloudRequestResult
enum class EFortUserCloudRequestResult : uint8 {
	Success,
	Failure_CloudStorageDisabled,
	Failure_CloudStorageError,
	Failure_FileNotFoundInUserFileList,
	Failure_SavingNotAllowedForSpecifiedUser,
	EFortUserCloudRequestResult_MAX,
};

// Enum FortniteGame.EFortUserCloudRequestType
enum class EFortUserCloudRequestType : uint8 {
	LoadCloudFile,
	SaveCloudFile,
	EFortUserCloudRequestType_MAX,
};

// Enum FortniteGame.EFortValetVehicleType
enum class EFortValetVehicleType : uint8 {
	Default,
	Sport,
	BasicTruck,
	EFortValetVehicleType_MAX,
};

// Enum FortniteGame.EVehicleAudioTriggerDir
enum class EVehicleAudioTriggerDir : uint8 {
	Forward,
	Backward,
	EVehicleAudioTriggerDir_MAX,
};

// Enum FortniteGame.EVehicleAudioInterpolationType
enum class EVehicleAudioInterpolationType : uint8 {
	None,
	CustomCurve,
	Linear,
	EVehicleAudioInterpolationType_MAX,
};

// Enum FortniteGame.EVehicleFuelState
enum class EVehicleFuelState : uint8 {
	Uninitialized,
	UsingVehicleFuel,
	NotUsingVehicleFuel,
	EVehicleFuelState_MAX,
};

// Enum FortniteGame.EVehicleSessionEndReason
enum class EVehicleSessionEndReason : uint8 {
	Invalid,
	NoPassengers,
	EVehicleSessionEndReason_MAX,
};

// Enum FortniteGame.EVehicleMovementMode
enum class EVehicleMovementMode : uint8 {
	OnGround,
	InAir,
	WipeOut,
	MaxCount,
	EVehicleMovementMode_MAX,
};

// Enum FortniteGame.ETryExitVehicleBehavior
enum class ETryExitVehicleBehavior : uint8 {
	DoNotForce,
	ForceOnBlocking,
	ForceAlways,
	ETryExitVehicleBehavior_MAX,
};

// Enum FortniteGame.EFortVisibilityBehavior
enum class EFortVisibilityBehavior : uint8 {
	Proximity,
	OnceSeenAlwaysSeen,
	AlwaysSeen,
	Invalid,
	EFortVisibilityBehavior_MAX,
};

// Enum FortniteGame.EVolumeValidityResult
enum class EVolumeValidityResult : uint8 {
	Valid,
	Invalid,
	EVolumeValidityResult_MAX,
};

// Enum FortniteGame.EFortWeaponAbilityRemovalPolicy
enum class EFortWeaponAbilityRemovalPolicy : uint8 {
	GameDefault,
	Remove,
	Persist,
	EFortWeaponAbilityRemovalPolicy_MAX,
};

// Enum FortniteGame.EFortWeaponAbilityRemovalReason
enum class EFortWeaponAbilityRemovalReason : uint8 {
	RemovedFromInventory,
	EndPlay,
	Unequipped,
	INVALID_MAX,
	EFortWeaponAbilityRemovalReason_MAX,
};

// Enum FortniteGame.EFortWeaponReduceMeshWorkSetting
enum class EFortWeaponReduceMeshWorkSetting : uint8 {
	DisableTick,
	DontReduceWork,
	HandledInAnimInstance,
	EFortWeaponReduceMeshWorkSetting_MAX,
};

// Enum FortniteGame.EFortWeaponChargeStateForFireFX
enum class EFortWeaponChargeStateForFireFX : uint8 {
	Partial,
	Full,
	Over,
	Max_None,
	EFortWeaponChargeStateForFireFX_MAX,
};

// Enum FortniteGame.EFortReloadMontageSection
enum class EFortReloadMontageSection : uint8 {
	Intro,
	Loop,
	Outro,
	EFortReloadMontageSection_MAX,
};

// Enum FortniteGame.EFortRecoilCurveType
enum class EFortRecoilCurveType : uint8 {
	WithTime,
	WithOverheat,
	EFortRecoilCurveType_MAX,
};

// Enum FortniteGame.EFortDisplayTier
enum class EFortDisplayTier : uint8 {
	Invalid,
	Handmade,
	Copper,
	Silver,
	Malachite,
	Obsidian,
	Brightcore,
	Spectrolite,
	Shadowshard,
	Sunbeam,
	Moonglow,
	EFortDisplayTier_MAX,
};

// Enum FortniteGame.EFortMeleeFX
enum class EFortMeleeFX : uint8 {
	Idle,
	Swing,
	AnimTrail,
	EFortMeleeFX_MAX,
};

// Enum FortniteGame.EFortDualWieldStance
enum class EFortDualWieldStance : uint8 {
	TwoPicksInUse,
	SinglePickDataDriven,
	EFortDualWieldStance_MAX,
};

// Enum FortniteGame.EFortDualWieldSwingState
enum class EFortDualWieldSwingState : uint8 {
	None,
	MainHand,
	OffHand,
	EFortDualWieldSwingState_MAX,
};

// Enum FortniteGame.EWorldItemDropBehavior
enum class EWorldItemDropBehavior : uint8 {
	DropAsPickup,
	DestroyOnDrop,
	DropAsPickupDestroyOnEmpty,
	DropAsPickupEvenWhenEmpty,
	EWorldItemDropBehavior_MAX,
};

// Enum FortniteGame.EFortWorldManagerState
enum class EFortWorldManagerState : uint8 {
	WMS_Created,
	WMS_QueryingWorld,
	WMS_WorldQueryComplete,
	WMS_CreatingNewWorld,
	WMS_LoadingExistingWorld,
	WMS_Running,
	WMS_Failed,
	WMS_MAX,
};

// Enum FortniteGame.EFortLevelStreamingState
enum class EFortLevelStreamingState : uint8 {
	LSS_Unloaded,
	LSS_Loaded,
	LSS_UnconditionalFoundationsUpdated,
	LSS_AllFoundationsUpdated,
	LSS_NewActorsCreatedButNotUpdated,
	LSS_AllUpdated,
	LSS_Ready,
	LSS_MAX,
};

// Enum FortniteGame.EFortQueuedActionUserStatus
enum class EFortQueuedActionUserStatus : uint8 {
	Succeeded,
	Failed,
	WaitingForCloudRequest,
	WaitingForProfileSave,
	EFortQueuedActionUserStatus_MAX,
};

// Enum FortniteGame.EFortWorldRecordState
enum class EFortWorldRecordState : uint8 {
	StartProcessing,
	WaitingForResponse,
	RetrievingTheaterInformation,
	RetrievingZoneInformation,
	LoadingWorldRecord,
	LoadingZoneRecord,
	SavingZoneRecord,
	SavingPlayerProfiles,
	SavingPlayerDeployableBases,
	Succeeded,
	Failed,
	Max_None,
	EFortWorldRecordState_MAX,
};

// Enum FortniteGame.EFortWorldRecordAction
enum class EFortWorldRecordAction : uint8 {
	LoadWorldOnly,
	SaveWorldOnly,
	SaveZoneAndWorld,
	LoadZoneAndWorld,
	SaveDeployableBasesAndWorld,
	Max_None,
	EFortWorldRecordAction_MAX,
};

// Enum FortniteGame.EDeployableBaseUseType
enum class EDeployableBaseUseType : uint8 {
	Neighborhood,
	PvECombat,
	EDeployableBaseUseType_MAX,
};

// Enum FortniteGame.EFortZoneType
enum class EFortZoneType : uint8 {
	PVE,
	PVP,
	Keep,
	SingleZone,
	Max_None,
	EFortZoneType_MAX,
};

// Enum FortniteGame.EFrontEndCamera
enum class EFrontEndCamera : uint8 {
	Invalid,
	Command,
	Command_HeroLoadout,
	LegacyHeroLoadout,
	Cosmetics,
	Expeditions,
	FrontendDefault,
	Heroes,
	HeroSelect,
	HeroLoadout,
	Home,
	HomeBase,
	Login,
	Manage1,
	Manage2,
	Manage3,
	Manage4,
	MissionControl,
	Party,
	Play,
	Research,
	SkillTrees,
	SmallCosmetics,
	SpatialUI,
	SpecialEvent,
	SpecialEvent2,
	SpecialEvent3,
	Store,
	StoreItemInspect,
	StwFrontendDefault,
	SurvivorSquadBuilding1,
	SurvivorSquadBuilding2,
	SurvivorSquadBuilding3,
	SurvivorSquadBuilding4,
	TutorialPhaseOne,
	TutorialPhaseTwo,
	TutorialPhaseThree,
	Upgrades,
	Vault,
	WorldMap,
	LobbyCentered,
	CosmeticDisplay,
	BattlePass,
	Rewards,
	SpecialEventRewards,
	Armory,
	EFrontEndCamera_MAX,
};

// Enum FortniteGame.EPlayerAttributeClampType
enum class EPlayerAttributeClampType : uint8 {
	Minimum,
	Maximum,
	EPlayerAttributeClampType_MAX,
};

// Enum FortniteGame.EFortWeaponUpgradeInteractionResult
enum class EFortWeaponUpgradeInteractionResult : uint8 {
	Upgradable,
	NotEnoughResources,
	CannotUpgrade,
	CannotInteract,
	EFortWeaponUpgradeInteractionResult_MAX,
};

// Enum FortniteGame.EFortWeaponUpgradeDirection
enum class EFortWeaponUpgradeDirection : uint8 {
	NotSet,
	Vertical,
	Horizontal,
	EFortWeaponUpgradeDirection_MAX,
};

// Enum FortniteGame.EFortWeaponUpgradeCosts
enum class EFortWeaponUpgradeCosts : uint8 {
	NotSet,
	WoodUncommon,
	WoodRare,
	WoodVeryRare,
	WoodSuperRare,
	MetalUncommon,
	MetalRare,
	MetalVeryRare,
	MetalSuperRare,
	BrickUncommon,
	BrickRare,
	BrickVeryRare,
	BrickSuperRare,
	HorizontalWoodCommon,
	HorizontalWoodUncommon,
	HorizontalWoodRare,
	HorizontalWoodVeryRare,
	HorizontalWoodSuperRare,
	HorizontalMetalCommon,
	HorizontalMetalUncommon,
	HorizontalMetalRare,
	HorizontalMetalVeryRare,
	HorizontalMetalSuperRare,
	HorizontalBrickCommon,
	HorizontalBrickUncommon,
	HorizontalBrickRare,
	HorizontalBrickVeryRare,
	HorizontalBrickSuperRare,
	EFortWeaponUpgradeCosts_MAX,
};

// Enum FortniteGame.EDroneFacingLocationMode
enum class EDroneFacingLocationMode : uint8 {
	NotFacingLocation,
	FindingPoint,
	TrackingPoint,
	EDroneFacingLocationMode_MAX,
};

// Enum FortniteGame.EFireModeType
enum class EFireModeType : uint8 {
	Unset,
	TapToShoot,
	FireButton,
	AutoFire,
	ForceTouch,
	Custom,
	MAX,
};

// Enum FortniteGame.ELayoutDataType
enum class ELayoutDataType : uint8 {
	Custom,
	DefaultToolLayout,
	DefaultGameLayout,
	MAX_Local,
	CustomCloudLayout,
	ELayoutDataType_MAX,
};

// Enum FortniteGame.ESpawnPointState
enum class ESpawnPointState : uint8 {
	Inactive,
	Active_CarryObjectInRange,
	Active_CarryObjectOutOfRange,
	IntelCaptured,
	IntelDownloaded,
	ESpawnPointState_MAX,
};

// Enum FortniteGame.EIslandInspectorState
enum class EIslandInspectorState : uint8 {
	Initializing,
	Ready,
	AwaitingProcessCommand,
	ProcessingCommand,
	EIslandInspectorState_MAX,
};

// Enum FortniteGame.ELevelSaveRecordVersion
enum class ELevelSaveRecordVersion : uint8 {
	CloudSaveInfoAdded,
	TimestampConversion,
	SoftActorClassReferences,
	SoftActorComponentClassReferences,
	DuplicateNewActorRecordsRemoved,
	StartOfResaveWhenNotLatestVersion,
	LowerCloseThresholdForDuplicates,
	DeprecatedDeleteAndNewActorRecords,
	DependenciesFromSerializedWorld,
	RemovingSerializedDependencies,
	AddingVolumeInfoRecordsMap,
	AddingVolumeGridDependency,
	AddingScale,
	AddingDataHash,
	AddedIslandTemplateId,
	AddedLevelStreamedDeleteRecord,
	UsingSaveActorGUID,
	UsingActorFNameForEditorSpawning,
	AddedPlayerPersistenceUserWipeNumber,
	VersionPlusOne,
	LatestVersion,
	ELevelSaveRecordVersion_MAX,
};

// Enum FortniteGame.ELevelSaveCategory
enum class ELevelSaveCategory : uint8 {
	ActorInstance,
	VolumeInfoActor,
	ELevelSaveCategory_MAX,
};

// Enum FortniteGame.EFortEncounterSpawnLimitType
enum class EFortEncounterSpawnLimitType : uint8 {
	NoLimit,
	NumPawnsLimit,
	SpawnPointLimit,
	UserDefined,
	MAX,
};

// Enum FortniteGame.EFortEncounterUtilitiesMode
enum class EFortEncounterUtilitiesMode : uint8 {
	LockedOnly,
	LockedAndFree,
	EFortEncounterUtilitiesMode_MAX,
};

// Enum FortniteGame.EFortEncounterSpawnLocationManagementMode
enum class EFortEncounterSpawnLocationManagementMode : uint8 {
	Spawn,
	Search,
	EFortEncounterSpawnLocationManagementMode_MAX,
};

// Enum FortniteGame.EFortEncounterSpawnLocationPlacementMode
enum class EFortEncounterSpawnLocationPlacementMode : uint8 {
	Directional,
	Ring,
	Volume,
	Custom,
	Max_None,
	EFortEncounterSpawnLocationPlacementMode_MAX,
};

// Enum FortniteGame.EFortEncounterPacingMode
enum class EFortEncounterPacingMode : uint8 {
	SpawnPointsPercentageCurve,
	IntensityCurve,
	Burst,
	Fixed,
	EFortEncounterPacingMode_MAX,
};

// Enum FortniteGame.EFortMissionAudibility
enum class EFortMissionAudibility : uint8 {
	UseVisibility,
	Audible,
	Inaudible,
	EFortMissionAudibility_MAX,
};

// Enum FortniteGame.EFortMissionType
enum class EFortMissionType : uint8 {
	Primary,
	Secondary,
	Max_None,
	EFortMissionType_MAX,
};

// Enum FortniteGame.EFortObjectiveRequirement
enum class EFortObjectiveRequirement : uint8 {
	Optional,
	Required,
	RequiredButCanFail,
	EFortObjectiveRequirement_MAX,
};

// Enum FortniteGame.EFortMissionStatus
enum class EFortMissionStatus : uint8 {
	Created,
	InProgress,
	Succeeded,
	Failed,
	NeutralCompletion,
	Quit,
	Max_None,
	EFortMissionStatus_MAX,
};

// Enum FortniteGame.EMissionGenerationCategory
enum class EMissionGenerationCategory : uint8 {
	Primary,
	Secondary,
	Tertiary,
	Survivor,
	Max_None,
	EMissionGenerationCategory_MAX,
};

// Enum FortniteGame.EClipMessageSettings
enum class EClipMessageSettings : uint8 {
	DontShow,
	ShowString,
	DeduceUnicornAnnotation,
	ShotTitleScreen,
	EClipMessageSettings_MAX,
};

// Enum FortniteGame.EPegasusTimelineCategories
enum class EPegasusTimelineCategories : uint8 {
	Unassigned,
	Player,
	Combat,
	Building,
	Inventory,
	Social,
	Resources,
	EPegasusTimelineCategories_MAX,
};

// Enum FortniteGame.EPrimitiveCrosstalkFunctions
enum class EPrimitiveCrosstalkFunctions : uint8 {
	SendTagAsPayload,
	SendTaggedObjectPayload,
	SendTaggedStringPayload,
	SendTaggedIntPayload,
	GetTaggedObjectPayload,
	GetTaggedStringPayload,
	GetTaggedIntPayload,
	BindNoParamEventToTaggedDelegate,
	UnbindNoParamEventFromTaggedDelegate,
	UnbindObjectCallbacksFromAllTaggedDelegates,
	EPrimitiveCrosstalkFunctions_MAX,
};

// Enum FortniteGame.EQuickHealingRequirementFlags
enum class EQuickHealingRequirementFlags : uint8 {
	Nothing,
	NeedsHealing,
	NeedsShields,
	NeedsBoth,
	Invalid,
	EQuickHealingRequirementFlags_MAX,
};

// Enum FortniteGame.EVideoManagerJobTypes
enum class EVideoManagerJobTypes : uint8 {
	EliminationExtraction,
	DefinedShotSequence,
	EVideoManagerJobTypes_MAX,
};

// Enum FortniteGame.EVideoManagerStates
enum class EVideoManagerStates : uint8 {
	INVALID,
	LoadingReplay,
	ScrubbingReplay,
	WaitingForShotSetup,
	WatchingShot,
	ExportingShot,
	PostExportedShot,
	EVideoManagerStates_MAX,
};

// Enum FortniteGame.ERespawnAndSpectatePlayerRespawningState
enum class ERespawnAndSpectatePlayerRespawningState : uint8 {
	None,
	WaitingOnTimer,
	WaitingOnPlayerSelection,
	WaitingOnClientReady,
	Respawning,
	RespawnFinishing,
	ERespawnAndSpectatePlayerRespawningState_MAX,
};

// Enum FortniteGame.ESaveLocation
enum class ESaveLocation : uint8 {
	Local_ForDevice,
	Local_MAX,
};

// Enum FortniteGame.EIndexNavigationResult
enum class EIndexNavigationResult : uint8 {
	Succeeded,
	Modified,
	Clamped,
	StepOff,
	NoMove,
	EIndexNavigationResult_MAX,
};

// Enum FortniteGame.ESpecialRelevancyMode
enum class ESpecialRelevancyMode : uint8 {
	NormalRelevancy,
	SoloRelevancy,
	SquadRelevancy,
	MultiSquad,
	MAX,
};

// Enum FortniteGame.EFortThreatDeactivationType
enum class EFortThreatDeactivationType : uint8 {
	Off,
	Dormant,
	EFortThreatDeactivationType_MAX,
};

// Enum FortniteGame.EUnicornSocialFeatures
enum class EUnicornSocialFeatures : uint8 {
	INVALID,
	FriendPlay,
	DancePartyManpower,
	CongaLineManpower,
	SocialPartyDuration,
	COUNT,
	EUnicornSocialFeatures_MAX,
};

// Enum FortniteGame.EHighlightReelIds
enum class EHighlightReelIds : uint8 {
	INVALID,
	MainHighlightReel,
	ShortHighlightReel,
	MicroHighlights,
	EntireGameReel,
	ShortExtendedHighlightReel,
	MediumHighlightReel,
	MediumExtendedHighlightReel,
	ShorterHighlightReel,
	PlayerSpotlightReel,
	PlayerSpotlightNoDeathsReel,
	VATReel,
	COUNT,
	EHighlightReelIds_MAX,
};

// Enum FortniteGame.EWrapPreviewGridLockerMode
enum class EWrapPreviewGridLockerMode : uint8 {
	IgnoreLockerConfiguration,
	SupportedWeaponsOnly,
	UnsupportedWeaponsOnly,
	EWrapPreviewGridLockerMode_MAX,
};

// ScriptStruct FortniteGame.PawnDamageData
// Size: 0x50 (Inherited: 0x00)
struct FPawnDamageData {
	struct AActor* DamagedActor; // 0x00(0x08)
	float Damage; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct AController* InstigatedBy; // 0x10(0x08)
	struct AActor* DamageCauser; // 0x18(0x08)
	struct FVector HitLocation; // 0x20(0x0c)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UPrimitiveComponent* HitComponent; // 0x30(0x08)
	struct FName BoneName; // 0x38(0x08)
	struct FVector Momentum; // 0x40(0x0c)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// ScriptStruct FortniteGame.FortPawnMaterialOverride
// Size: 0x70 (Inherited: 0x00)
struct FFortPawnMaterialOverride {
	struct FGuid OverrideId; // 0x00(0x10)
	struct TSoftObjectPtr<struct UMaterialInterface> Material; // 0x10(0x28)
	struct FFortPawnMaterialOverrideCopiedParameters MaterialParamsToCopy; // 0x38(0x30)
	float Priority; // 0x68(0x04)
	bool bHideParticleSystems; // 0x6c(0x01)
	bool bApplyToWeapon; // 0x6d(0x01)
	char pad_6E[0x2]; // 0x6e(0x02)
};

// ScriptStruct FortniteGame.FortPawnMaterialOverrideCopiedParameters
// Size: 0x30 (Inherited: 0x00)
struct FFortPawnMaterialOverrideCopiedParameters {
	struct TArray<struct FName> ScalarParamNames; // 0x00(0x10)
	struct TArray<struct FName> VectorParamNames; // 0x10(0x10)
	struct TArray<struct FName> TextureParamNames; // 0x20(0x10)
};

// ScriptStruct FortniteGame.ProjectileEventData
// Size: 0x28 (Inherited: 0x00)
struct FProjectileEventData {
	struct AFortProjectileBase* SpawnedProjectile; // 0x00(0x08)
	struct TArray<struct FHitResult> Hits; // 0x08(0x10)
	struct TArray<struct AActor*> ExplodedActors; // 0x18(0x10)
};

// ScriptStruct FortniteGame.FortAthenaVehicleInputState
// Size: 0x2c (Inherited: 0x00)
struct FFortAthenaVehicleInputState {
	float ForwardAlpha; // 0x00(0x04)
	float RightAlpha; // 0x04(0x04)
	float PitchAlpha; // 0x08(0x04)
	float LookUpDelta; // 0x0c(0x04)
	float TurnDelta; // 0x10(0x04)
	float SteerAlpha; // 0x14(0x04)
	float GravityOffset; // 0x18(0x04)
	struct FVector MovementDir; // 0x1c(0x0c)
	char bIsSprinting : 1; // 0x28(0x01)
	char bIsJumping : 1; // 0x28(0x01)
	char bIsBraking : 1; // 0x28(0x01)
	char bIsHonking : 1; // 0x28(0x01)
	char bIgnoreForwardInAir : 1; // 0x28(0x01)
	char bMovementModifier0 : 1; // 0x28(0x01)
	char bMovementModifier1 : 1; // 0x28(0x01)
	char bMovementModifier2 : 1; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
};

// ScriptStruct FortniteGame.FortAIDirectorEvent
// Size: 0x20 (Inherited: 0x00)
struct FFortAIDirectorEvent {
	enum class EFortAIDirectorEvent event; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UObject* EventSource; // 0x08(0x08)
	struct UObject* EventTarget; // 0x10(0x08)
	float EventValue; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.FortTeamMemberInfo
// Size: 0x200 (Inherited: 0x00)
struct FFortTeamMemberInfo {
	struct FUniqueNetIdRepl MemberUniqueId; // 0x00(0x28)
	struct FUniqueNetIdRepl PartyLeaderUniqueId; // 0x28(0x28)
	struct FUniqueNetIdRepl ConsoleUniqueId; // 0x50(0x28)
	struct FString Platform; // 0x78(0x10)
	struct FText PlayerName; // 0x88(0x18)
	bool bPartyLeader; // 0xa0(0x01)
	bool bIsInZone; // 0xa1(0x01)
	bool bHasBoostXp; // 0xa2(0x01)
	bool bHasRestXp; // 0xa3(0x01)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FString BannerIconId; // 0xa8(0x10)
	struct FString BannerColorId; // 0xb8(0x10)
	bool bBattlePassPurchased; // 0xc8(0x01)
	char pad_C9[0x3]; // 0xc9(0x03)
	int32_t BattlePassLevel; // 0xcc(0x04)
	int32_t BattlePassSelfXpBoost; // 0xd0(0x04)
	int32_t BattlePassFriendXpBoost; // 0xd4(0x04)
	int32_t NumPlayersInParty; // 0xd8(0x04)
	int32_t PlayerIndex; // 0xdc(0x04)
	char TeamAffiliation; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
	struct FText HeroClass; // 0xe8(0x18)
	struct FText HeroLevel; // 0x100(0x18)
	int32_t HeroXP; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UFortItem* HeroItem; // 0x120(0x08)
	struct TArray<struct UFortItem*> SelectedGadgetItems; // 0x128(0x10)
	struct FSlateBrush HeroIcon; // 0x138(0x88)
	struct FFortHomeBaseInfo HomeBaseInfo; // 0x1c0(0x40)
};

// ScriptStruct FortniteGame.FortHomeBaseInfo
// Size: 0x40 (Inherited: 0x00)
struct FFortHomeBaseInfo {
	struct FString BannerIconId; // 0x00(0x10)
	struct FString BannerColorId; // 0x10(0x10)
	struct FText Name; // 0x20(0x18)
	bool ValidData; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// ScriptStruct FortniteGame.PurchasedItemInfo
// Size: 0x10 (Inherited: 0x00)
struct FPurchasedItemInfo {
	struct UFortItem* Item; // 0x00(0x08)
	int32_t Quantity; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.FortPublicAccountInfo
// Size: 0x34 (Inherited: 0x00)
struct FFortPublicAccountInfo {
	int32_t Level; // 0x00(0x04)
	int32_t MaxLevel; // 0x04(0x04)
	int32_t LevelXp; // 0x08(0x04)
	int32_t LevelXpForLevel; // 0x0c(0x04)
	struct FAthenaLevelInfo BattleRoyaleLevel; // 0x10(0x24)
};

// ScriptStruct FortniteGame.AthenaLevelInfo
// Size: 0x24 (Inherited: 0x00)
struct FAthenaLevelInfo {
	int32_t AccountLevel; // 0x00(0x04)
	int32_t Level; // 0x04(0x04)
	int32_t MaxLevel; // 0x08(0x04)
	int32_t LevelXp; // 0x0c(0x04)
	int32_t LevelXpForLevel; // 0x10(0x04)
	int32_t BookLevel; // 0x14(0x04)
	int32_t BookMaxLevel; // 0x18(0x04)
	int32_t BookLevelXp; // 0x1c(0x04)
	int32_t BookLevelXpForLevel; // 0x20(0x04)
};

// ScriptStruct FortniteGame.FortPrivateAccountInfo
// Size: 0x38 (Inherited: 0x34)
struct FFortPrivateAccountInfo : FFortPublicAccountInfo {
	int32_t MtxBalance; // 0x34(0x04)
};

// ScriptStruct FortniteGame.FortItemInstanceQuantityPair
// Size: 0x10 (Inherited: 0x00)
struct FFortItemInstanceQuantityPair {
	struct UFortItem* Item; // 0x00(0x08)
	enum class EFortInventoryType InventoryType; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32_t Quantity; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.McpPrivacySettings
// Size: 0x02 (Inherited: 0x00)
struct FMcpPrivacySettings {
	bool OptOutOfPublicLeaderboards; // 0x00(0x01)
	bool OptOutOfFriendsLeaderboards; // 0x01(0x01)
};

// ScriptStruct FortniteGame.McpBanInfo
// Size: 0x40 (Inherited: 0x00)
struct FMcpBanInfo {
	struct TArray<enum class EPlayerBanReasons> BanReasons; // 0x00(0x10)
	struct FString ExploitProgramName; // 0x10(0x10)
	struct FString AdditionalInfo; // 0x20(0x10)
	struct FDateTime BanStartTimeUtc; // 0x30(0x08)
	float BanDurationDays; // 0x38(0x04)
	enum class EPlayerCompetitiveBanReasons CompetitiveBanReason; // 0x3c(0x01)
	bool bRequiresUserAck; // 0x3d(0x01)
	bool bBanHasStarted; // 0x3e(0x01)
	char pad_3F[0x1]; // 0x3f(0x01)
};

// ScriptStruct FortniteGame.FortCampaignLoadout
// Size: 0x08 (Inherited: 0x00)
struct FFortCampaignLoadout {
	struct UFortPersonalVehicleItem* PersonalVehicle; // 0x00(0x08)
};

// ScriptStruct FortniteGame.FriendCode
// Size: 0x20 (Inherited: 0x00)
struct FFriendCode {
	struct FString Code; // 0x00(0x10)
	struct FString CodeType; // 0x10(0x10)
};

// ScriptStruct FortniteGame.FortAthenaLoadout
// Size: 0x140 (Inherited: 0x00)
struct FFortAthenaLoadout {
	struct FString BannerIconId; // 0x00(0x10)
	struct FString BannerColorId; // 0x10(0x10)
	struct UAthenaSkyDiveContrailItemDefinition* SkyDiveContrail; // 0x20(0x08)
	struct UAthenaGliderItemDefinition* Glider; // 0x28(0x08)
	struct UAthenaPickaxeItemDefinition* Pickaxe; // 0x30(0x08)
	bool bIsDefaultCharacter; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct UAthenaCharacterItemDefinition* Character; // 0x40(0x08)
	struct TArray<struct FMcpVariantChannelInfo> CharacterVariantChannels; // 0x48(0x10)
	bool bForceUpdateVariants; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct UAthenaHatItemDefinition* Hat; // 0x60(0x08)
	struct UAthenaBackpackItemDefinition* Backpack; // 0x68(0x08)
	struct UAthenaLoadingScreenItemDefinition* LoadingScreen; // 0x70(0x08)
	struct UAthenaBattleBusItemDefinition* BattleBus; // 0x78(0x08)
	struct UAthenaVehicleCosmeticItemDefinition* VehicleDecoration; // 0x80(0x08)
	struct UAthenaCallingCardItemDefinition* CallingCard; // 0x88(0x08)
	struct UAthenaMapMarkerItemDefinition* MapMarker; // 0x90(0x08)
	struct TArray<struct UAthenaDanceItemDefinition*> Dances; // 0x98(0x10)
	struct UAthenaVictoryPoseItemDefinition* VictoryPose; // 0xa8(0x08)
	struct UAthenaMusicPackItemDefinition* MusicPack; // 0xb0(0x08)
	struct UAthenaItemWrapDefinition* ItemWrapOverride; // 0xb8(0x08)
	struct TArray<struct UAthenaItemWrapDefinition*> ItemWraps; // 0xc0(0x10)
	struct UAthenaCharmItemDefinition* CharmOverride; // 0xd0(0x08)
	struct TArray<struct UAthenaCharmItemDefinition*> Charms; // 0xd8(0x10)
	struct UAthenaPetItemDefinition* PetSkin; // 0xe8(0x08)
	char pad_F0[0x50]; // 0xf0(0x50)
};

// ScriptStruct FortniteGame.CosmeticVariantInfo
// Size: 0x10 (Inherited: 0x00)
struct FCosmeticVariantInfo {
	struct FGameplayTag VariantChannelTag; // 0x00(0x08)
	struct FGameplayTag ActiveVariantTag; // 0x08(0x08)
};

// ScriptStruct FortniteGame.McpVariantChannelInfo
// Size: 0x48 (Inherited: 0x10)
struct FMcpVariantChannelInfo : FCosmeticVariantInfo {
	struct FGameplayTagContainer OwnedVariantTags; // 0x10(0x20)
	struct UFortItemDefinition* ItemVariantIsUsedFor; // 0x30(0x08)
	struct FString CustomData; // 0x38(0x10)
};

// ScriptStruct FortniteGame.AthenaTravelLogEntry
// Size: 0xd0 (Inherited: 0x00)
struct FAthenaTravelLogEntry {
	float Time; // 0x00(0x04)
	struct FVector Position; // 0x04(0x0c)
	struct FRotator Rotation; // 0x10(0x0c)
	enum class EAthenaTravelEventType Type; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	struct FName InstigatorName; // 0x20(0x08)
	struct FUniqueNetIdRepl InstigatorId; // 0x28(0x28)
	enum class EAthenaTravelLogPlayerType InstigatorPlayerType; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	struct FName ReceiverName; // 0x54(0x08)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FUniqueNetIdRepl ReceiverId; // 0x60(0x28)
	enum class EAthenaTravelLogPlayerType ReceiverPlayerType; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	float Value; // 0x8c(0x04)
	struct FJsonObjectWrapper Meta; // 0x90(0x20)
	struct FGameplayTagContainer LocationPOITags; // 0xb0(0x20)
};

// ScriptStruct FortniteGame.AthenaMatchLootReward
// Size: 0x18 (Inherited: 0x00)
struct FAthenaMatchLootReward {
	struct FString TemplateId; // 0x00(0x10)
	int32_t Amount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct FortniteGame.AthenaMatchXpReward
// Size: 0x20 (Inherited: 0x00)
struct FAthenaMatchXpReward {
	struct FText Text; // 0x00(0x18)
	int32_t Amount; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.AthenaTravelRecord
// Size: 0x10 (Inherited: 0x00)
struct FAthenaTravelRecord {
	struct TArray<struct FAthenaTravelLogEntry> Log; // 0x00(0x10)
};

// ScriptStruct FortniteGame.AthenaRewardResult
// Size: 0x40 (Inherited: 0x00)
struct FAthenaRewardResult {
	int32_t LevelsGained; // 0x00(0x04)
	int32_t BookLevelsGained; // 0x04(0x04)
	int32_t TotalSeasonXpGained; // 0x08(0x04)
	int32_t TotalBookXpGained; // 0x0c(0x04)
	int32_t PrePenaltySeasonXpGained; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<struct FAthenaMatchXpMultiplierGroup> XpMultipliers; // 0x18(0x10)
	struct TArray<struct FAthenaAwardGroup> Rewards; // 0x28(0x10)
	float AntiAddictionMultiplier; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct FortniteGame.AthenaAwardGroup
// Size: 0x28 (Inherited: 0x00)
struct FAthenaAwardGroup {
	enum class ERewardSource RewardSource; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct FMcpLootEntry> Items; // 0x08(0x10)
	int32_t Score; // 0x18(0x04)
	float SeasonXp; // 0x1c(0x04)
	int32_t BookXp; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct FortniteGame.AthenaMatchXpMultiplierGroup
// Size: 0x08 (Inherited: 0x00)
struct FAthenaMatchXpMultiplierGroup {
	enum class EAthenaMatchXpMultiplierSource Source; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t Amount; // 0x04(0x04)
};

// ScriptStruct FortniteGame.AthenaMatchTeamStats
// Size: 0x08 (Inherited: 0x00)
struct FAthenaMatchTeamStats {
	int32_t Place; // 0x00(0x04)
	int32_t TotalPlayers; // 0x04(0x04)
};

// ScriptStruct FortniteGame.AthenaMatchStats
// Size: 0xc8 (Inherited: 0x00)
struct FAthenaMatchStats {
	struct FString StatBucket; // 0x00(0x10)
	struct FString MatchID; // 0x10(0x10)
	struct FString MatchEndTime; // 0x20(0x10)
	struct FString MatchPlatform; // 0x30(0x10)
	int32_t Stats[0x14]; // 0x40(0x50)
	struct TArray<struct FAthenaWeaponStats> WeaponStats; // 0x90(0x10)
	struct TArray<struct FAthenaXPStats> XPStats; // 0xa0(0x10)
	bool bIsValid; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct FString FactionTag; // 0xb8(0x10)
};

// ScriptStruct FortniteGame.AthenaXPStats
// Size: 0x14 (Inherited: 0x00)
struct FAthenaXPStats {
	struct FName Stat; // 0x00(0x08)
	int32_t Count; // 0x08(0x04)
	int32_t XP; // 0x0c(0x04)
	enum class EFortAccoladeSubtype Subtype; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct FortniteGame.AthenaWeaponStats
// Size: 0x58 (Inherited: 0x00)
struct FAthenaWeaponStats {
	struct FString WeaponId; // 0x00(0x10)
	int32_t Stats[0x11]; // 0x10(0x44)
	char pad_54[0x4]; // 0x54(0x04)
};

// ScriptStruct FortniteGame.AsyncTaskResult
// Size: 0x30 (Inherited: 0x00)
struct FAsyncTaskResult {
	bool bSucceeded; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString ErrorCode; // 0x08(0x10)
	struct FText ErrorMessage; // 0x18(0x18)
};

// ScriptStruct FortniteGame.VolumePerformanceMetrics
// Size: 0x14 (Inherited: 0x00)
struct FVolumePerformanceMetrics {
	int32_t PerformanceValue; // 0x00(0x04)
	int32_t PerformanceMaxValue; // 0x04(0x04)
	int32_t PerformanceLowendThreshold; // 0x08(0x04)
	int32_t PreviewDeltaValue; // 0x0c(0x04)
	enum class EFortBudgetCategory Category; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct FortniteGame.AthenaGameMessageData
// Size: 0x40 (Inherited: 0x00)
struct FAthenaGameMessageData {
	enum class EAthenaGameMsgType MsgType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText MsgText; // 0x08(0x18)
	struct USoundCue* MsgSound; // 0x20(0x08)
	float MsgDelay; // 0x28(0x04)
	bool bIsTeamBased; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	int32_t TeamIndex; // 0x30(0x04)
	float DisplayTime; // 0x34(0x04)
	struct APlayerController* TargetPlayerController; // 0x38(0x08)
};

// ScriptStruct FortniteGame.HUDMessageData
// Size: 0x58 (Inherited: 0x40)
struct FHUDMessageData : FAthenaGameMessageData {
	enum class EHUDMessagePlacement Placement; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct APlayerState* PlayerState; // 0x48(0x08)
	int32_t MessageTargets; // 0x50(0x04)
	enum class ETextTransformPolicy TextTransformPolicy; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
};

// ScriptStruct FortniteGame.VolumeActorStats
// Size: 0x50 (Inherited: 0x00)
struct FVolumeActorStats {
	struct TMap<enum class EFortBuildingType, int32_t> BuildingTypeCounts; // 0x00(0x50)
};

// ScriptStruct FortniteGame.FortItemEntry
// Size: 0x190 (Inherited: 0x0c)
struct FFortItemEntry : FFastArraySerializerItem {
	int32_t Count; // 0x0c(0x04)
	int32_t PreviousCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UFortItemDefinition* ItemDefinition; // 0x18(0x08)
	int16_t OrderIndex; // 0x20(0x02)
	char pad_22[0x2]; // 0x22(0x02)
	float Durability; // 0x24(0x04)
	int32_t Level; // 0x28(0x04)
	int32_t LoadedAmmo; // 0x2c(0x04)
	int32_t PhantomReserveAmmo; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct TArray<struct FString> AlterationDefinitions; // 0x38(0x10)
	struct TArray<struct FFortSavedWeaponModSlot> SavedWeaponModSlots; // 0x48(0x10)
	struct FString ItemSource; // 0x58(0x10)
	struct FGuid ItemGuid; // 0x68(0x10)
	struct FGuid TrackerGuid; // 0x78(0x10)
	int32_t ControlOverride; // 0x88(0x04)
	bool inventory_overflow_date; // 0x8c(0x01)
	bool bWasGifted; // 0x8d(0x01)
	bool bIsReplicatedCopy; // 0x8e(0x01)
	bool bIsDirty; // 0x8f(0x01)
	bool bUpdateStatsOnCollection; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct FFortGiftingInfo GiftingInfo; // 0x98(0x28)
	struct TArray<struct FFortItemEntryStateValue> StateValues; // 0xc0(0x10)
	struct TWeakObjectPtr<struct AFortInventory> ParentInventory; // 0xd0(0x08)
	struct FGameplayAbilitySpecHandle GameplayAbilitySpecHandle; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct TArray<struct UFortAlterationItemDefinition*> AlterationInstances; // 0xe0(0x10)
	struct TArray<struct FFortWeaponModSlot> WeaponModSlots; // 0xf0(0x10)
	struct TSoftObjectPtr<struct UAthenaItemWrapDefinition> WrapOverride; // 0x100(0x28)
	struct TArray<float> GenericAttributeValues; // 0x128(0x10)
	char pad_138[0x50]; // 0x138(0x50)
	int32_t PickupVariantIndex; // 0x188(0x04)
	int32_t ItemVariantDataMappingIndex; // 0x18c(0x04)
};

// ScriptStruct FortniteGame.FortWeaponModSlot
// Size: 0x10 (Inherited: 0x00)
struct FFortWeaponModSlot {
	struct UFortWeaponModItemDefinition* WeaponMod; // 0x00(0x08)
	bool bIsDynamic; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct FortniteGame.FortItemEntryStateValue
// Size: 0x10 (Inherited: 0x00)
struct FFortItemEntryStateValue {
	int32_t IntValue; // 0x00(0x04)
	struct FName NameValue; // 0x04(0x08)
	enum class EFortItemEntryState StateType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct FortniteGame.FortGiftingInfo
// Size: 0x28 (Inherited: 0x00)
struct FFortGiftingInfo {
	struct FString PlayerName; // 0x00(0x10)
	struct UFortHeroType* HeroType; // 0x10(0x08)
	char pad_18[0x10]; // 0x18(0x10)
};

// ScriptStruct FortniteGame.FortSavedWeaponModSlot
// Size: 0x18 (Inherited: 0x00)
struct FFortSavedWeaponModSlot {
	struct FString WeaponModTemplateID; // 0x00(0x10)
	bool bIsDynamic; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct FortniteGame.ChoiceData
// Size: 0x30 (Inherited: 0x00)
struct FChoiceData {
	int32_t MenuIdentifier; // 0x00(0x04)
	bool bShowCloseButton; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	struct FText Title; // 0x08(0x18)
	struct TArray<struct FChoiceDataEntry> Items; // 0x20(0x10)
};

// ScriptStruct FortniteGame.ChoiceDataEntry
// Size: 0x50 (Inherited: 0x00)
struct FChoiceDataEntry {
	struct FText ButtonText; // 0x00(0x18)
	struct FText ButtonDescription; // 0x18(0x18)
	struct FText ConfirmText; // 0x30(0x18)
	bool bEnabled; // 0x48(0x01)
	bool bRequireConfirmation; // 0x49(0x01)
	bool bCloseAfterSelection; // 0x4a(0x01)
	char pad_4B[0x5]; // 0x4b(0x05)
};

// ScriptStruct FortniteGame.AttributeModifierInfo
// Size: 0x20 (Inherited: 0x00)
struct FAttributeModifierInfo {
	char pad_0[0x8]; // 0x00(0x08)
	struct UGameplayEffect* InstantGEs; // 0x08(0x08)
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct FortniteGame.BuildingWeakSpotData
// Size: 0x38 (Inherited: 0x00)
struct FBuildingWeakSpotData {
	struct TWeakObjectPtr<struct UObject> ParentObject; // 0x00(0x08)
	struct FVector_NetQuantizeNormal Normal; // 0x08(0x0c)
	struct FVector_NetQuantize10 Position; // 0x14(0x0c)
	int32_t HitCount; // 0x20(0x04)
	char pad_24[0x14]; // 0x24(0x14)
};

// ScriptStruct FortniteGame.FortRequirementsInfo
// Size: 0x60 (Inherited: 0x00)
struct FFortRequirementsInfo {
	int32_t CommanderLevel; // 0x00(0x04)
	int32_t PersonalPowerRating; // 0x04(0x04)
	int32_t MaxPersonalPowerRating; // 0x08(0x04)
	int32_t PartyPowerRating; // 0x0c(0x04)
	int32_t MaxPartyPowerRating; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<struct UFortQuestItemDefinition*> ActiveQuestDefinitions; // 0x18(0x10)
	struct UFortQuestItemDefinition* QuestDefinition; // 0x28(0x08)
	struct FDataTableRowHandle ObjectiveStatHandle; // 0x30(0x10)
	struct UFortQuestItemDefinition* UncompletedQuestDefinition; // 0x40(0x08)
	struct UFortItemDefinition* ItemDefinition; // 0x48(0x08)
	struct FString EventFlag; // 0x50(0x10)
};

// ScriptStruct FortniteGame.CreateBuildingActorData
// Size: 0x38 (Inherited: 0x00)
struct FCreateBuildingActorData {
	uint32_t BuildingClassHandle; // 0x00(0x04)
	struct FVector_NetQuantize10 BuildLoc; // 0x04(0x0c)
	struct FRotator BuildRot; // 0x10(0x0c)
	bool bMirrored; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float SyncKey; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FBuildingClassData BuildingClassData; // 0x28(0x10)
};

// ScriptStruct FortniteGame.BuildingClassData
// Size: 0x10 (Inherited: 0x00)
struct FBuildingClassData {
	struct ABuildingActor* BuildingClass; // 0x00(0x08)
	int32_t PreviousBuildingLevel; // 0x08(0x04)
	char UpgradeLevel; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct FortniteGame.FortPickupTossOverrideData
// Size: 0x10 (Inherited: 0x00)
struct FFortPickupTossOverrideData {
	bool bIsValid; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float MinTossDist; // 0x04(0x04)
	float MaxTossDist; // 0x08(0x04)
	float SpawnDirectionConeHalfAngle; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.FortMcpCollectedItemProperties
// Size: 0x48 (Inherited: 0x00)
struct FFortMcpCollectedItemProperties {
	struct FString VariantTag; // 0x00(0x10)
	struct TArray<struct FString> ContextTags; // 0x10(0x10)
	struct FJsonObjectWrapper Properties; // 0x20(0x20)
	enum class EFortCollectedState SeenState; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32_t Count; // 0x44(0x04)
};

// ScriptStruct FortniteGame.LockOnInfo
// Size: 0x38 (Inherited: 0x00)
struct FLockOnInfo {
	enum class ELockOnState State; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct TWeakObjectPtr<struct AFortWeapon> Weapon; // 0x04(0x08)
	struct TWeakObjectPtr<struct AActor> LockOnTarget; // 0x0c(0x08)
	struct FRotator CamRotAtTargetAcquisiton; // 0x14(0x0c)
	struct FVector2D LockOnCoords; // 0x20(0x08)
	float TargetAcquisitionTime; // 0x28(0x04)
	float TargetLockOnTime; // 0x2c(0x04)
	float TargetOutOfSightTime; // 0x30(0x04)
	float CooldownStartTime; // 0x34(0x04)
};

// ScriptStruct FortniteGame.FortPersistentGameplayStatContainer
// Size: 0x10 (Inherited: 0x00)
struct FFortPersistentGameplayStatContainer {
	struct TArray<struct FFortPersistentGameplayStatValue> GameplayStats; // 0x00(0x10)
};

// ScriptStruct FortniteGame.FortPersistentGameplayStatValue
// Size: 0x18 (Inherited: 0x00)
struct FFortPersistentGameplayStatValue {
	struct FString StatName; // 0x00(0x10)
	int32_t StatValue; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct FortniteGame.FortUpdatedObjectiveStat
// Size: 0x28 (Inherited: 0x00)
struct FFortUpdatedObjectiveStat {
	struct UFortQuestItemDefinition* Quest; // 0x00(0x08)
	struct FName BackendName; // 0x08(0x08)
	int32_t StatValue; // 0x10(0x04)
	int32_t ShadowStatValue; // 0x14(0x04)
	int32_t StatDelta; // 0x18(0x04)
	int32_t CurrentStage; // 0x1c(0x04)
	bool bSharedQuestUpdate; // 0x20(0x01)
	bool bShowToast; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
};

// ScriptStruct FortniteGame.FortRewardReport
// Size: 0x70 (Inherited: 0x00)
struct FFortRewardReport {
	struct FText MissionName; // 0x00(0x18)
	struct FText TheaterName; // 0x18(0x18)
	struct FText Difficulty; // 0x30(0x18)
	float DifficultyValue; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct FFortRewardActivity> RewardActivities; // 0x50(0x10)
	bool bIsFinalized; // 0x60(0x01)
	char pad_61[0xf]; // 0x61(0x0f)
};

// ScriptStruct FortniteGame.FortRewardActivity
// Size: 0x78 (Inherited: 0x00)
struct FFortRewardActivity {
	enum class EFortRewardActivityType ActivityType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FGuid ActivityGuid; // 0x04(0x10)
	char pad_14[0x4]; // 0x14(0x04)
	struct FText TitleText; // 0x18(0x18)
	struct FText DescriptionText; // 0x30(0x18)
	float RewardDisplayTime; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct FFortItemEntry> RewardItems; // 0x50(0x10)
	struct TArray<struct FFortItemEntry> MissedRewardItems; // 0x60(0x10)
	enum class EFortCompletionResult ActivityCompletionResult; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	int32_t AdditionalCompletionMissionPoints; // 0x74(0x04)
};

// ScriptStruct FortniteGame.QueuedItemsToDropViaPickup
// Size: 0x20 (Inherited: 0x00)
struct FQueuedItemsToDropViaPickup {
	struct AFortPawn* DestructionPawn; // 0x00(0x08)
	int32_t TotalNumItemsToDrop; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<struct UFortWorldItem*> ItemsToDrop; // 0x10(0x10)
};

// ScriptStruct FortniteGame.DelayedQuickBarActionContainer
// Size: 0x120 (Inherited: 0x108)
struct FDelayedQuickBarActionContainer : FFastArraySerializer {
	struct TArray<struct FDelayedQuickBarAction> Items; // 0x108(0x10)
	char pad_118[0x8]; // 0x118(0x08)
};

// ScriptStruct FortniteGame.DelayedQuickBarAction
// Size: 0x40 (Inherited: 0x0c)
struct FDelayedQuickBarAction : FFastArraySerializerItem {
	uint32_t ActionId; // 0x0c(0x04)
	enum class EFortDelayedQuickBarAction Action; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	struct FGuid ItemGuid; // 0x14(0x10)
	struct FPrimaryAssetId ItemDefinitionAssetId; // 0x24(0x10)
	enum class EFortQuickBars QuickBarType; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	int32_t QuickBarSlot; // 0x38(0x04)
	bool bForceExecution; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// ScriptStruct FortniteGame.RecentlyRemovedQuickbarInfo
// Size: 0x20 (Inherited: 0x00)
struct FRecentlyRemovedQuickbarInfo {
	struct FGuid ItemGuid; // 0x00(0x10)
	int32_t RemovedFromSlot; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UFortItemDefinition* ItemDefinition; // 0x18(0x08)
};

// ScriptStruct FortniteGame.FortDamageNumberInfo
// Size: 0x88 (Inherited: 0x00)
struct FFortDamageNumberInfo {
	struct FVector WorldLocation; // 0x00(0x0c)
	struct FVector HitNormal; // 0x0c(0x0c)
	bool bIsCriticalDamage; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	int32_t Damage; // 0x1c(0x04)
	enum class EFortDamageNumberType DamageNumberType; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float VisualDamageScale; // 0x24(0x04)
	enum class EFortElementalDamageType ElementalDamageType; // 0x28(0x01)
	enum class EStatCategory ScoreType; // 0x29(0x01)
	bool bAttachScoreNumberToPlayer; // 0x2a(0x01)
	char pad_2B[0x5]; // 0x2b(0x05)
	struct UStaticMeshComponent* StaticMeshComponent; // 0x30(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> MeshMIDs; // 0x38(0x10)
	struct TArray<int32_t> DamageNumberArray; // 0x48(0x10)
	struct FGameplayTagContainer DamagedActorTags; // 0x58(0x20)
	struct TWeakObjectPtr<struct AActor> DamagedActor; // 0x78(0x08)
	struct TWeakObjectPtr<struct APawn> DamageCauser; // 0x80(0x08)
};

// ScriptStruct FortniteGame.LastBuildableState
// Size: 0x10 (Inherited: 0x00)
struct FLastBuildableState {
	struct UBuildingEditModeMetadata* LastBuildableMetaData; // 0x00(0x08)
	bool LastBuildableMirrored; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	int32_t LastBuildableRotationIterations; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.AIDirectorDebugInfo
// Size: 0x28 (Inherited: 0x00)
struct FAIDirectorDebugInfo {
	float Timestamp; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<float> DebugGraphData; // 0x08(0x10)
	char pad_18[0x10]; // 0x18(0x10)
};

// ScriptStruct FortniteGame.VehicleDamageablePart
// Size: 0x10 (Inherited: 0x00)
struct FVehicleDamageablePart {
	int32_t ConfigIndex; // 0x00(0x04)
	int32_t BoneIndex; // 0x04(0x04)
	int32_t ShapeIndex; // 0x08(0x04)
	float Health; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.VehicleDamageablePartConfig
// Size: 0x18 (Inherited: 0x00)
struct FVehicleDamageablePartConfig {
	struct FName ShapeName; // 0x00(0x08)
	struct FName BoneName; // 0x08(0x08)
	float MaxHealth; // 0x10(0x04)
	bool bStartsDisabled; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
};

// ScriptStruct FortniteGame.FortEventName
// Size: 0x10 (Inherited: 0x00)
struct FFortEventName {
	struct FName CategoryName; // 0x00(0x08)
	struct FName EventName; // 0x08(0x08)
};

// ScriptStruct FortniteGame.FortClientEventName
// Size: 0x10 (Inherited: 0x10)
struct FFortClientEventName : FFortEventName {
};

// ScriptStruct FortniteGame.Voter
// Size: 0x38 (Inherited: 0x00)
struct FVoter {
	int32_t VoteDecision; // 0x00(0x04)
	int32_t LastVoteDecision; // 0x04(0x04)
	struct FUniqueNetIdRepl NetId; // 0x08(0x28)
	int32_t NumVotesCast; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// ScriptStruct FortniteGame.EndOfDayRecap
// Size: 0x20 (Inherited: 0x00)
struct FEndOfDayRecap {
	int32_t DayNumber; // 0x00(0x04)
	int32_t TeamScoreAtStartOfDay; // 0x04(0x04)
	int32_t TeamScoreAtEndOfDay; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<struct FFortPlayerScoreReport> ScoreReports; // 0x10(0x10)
};

// ScriptStruct FortniteGame.FortPlayerScoreReport
// Size: 0x2a8 (Inherited: 0x00)
struct FFortPlayerScoreReport {
	struct FUniqueNetIdRepl PlayerID; // 0x00(0x28)
	struct FString PlayerName; // 0x28(0x10)
	struct TWeakObjectPtr<struct AFortPlayerState> PlayerState; // 0x38(0x08)
	enum class EFortTeam PlayerTeam; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FReplicatedStatValues ReplicatedStats_Campaign[0x23]; // 0x44(0x118)
	struct FReplicatedStatValues ReplicatedStats_Zone[0x23]; // 0x15c(0x118)
	int32_t InitialLevel; // 0x274(0x04)
	int32_t InitialExperienceAmount; // 0x278(0x04)
	struct FFortExperienceDelta ExperienceInfoDelta; // 0x27c(0x24)
	int32_t LastExperienceDeltaAmount; // 0x2a0(0x04)
	int32_t LastScoreDeltaAmount; // 0x2a4(0x04)
};

// ScriptStruct FortniteGame.FortExperienceDelta
// Size: 0x24 (Inherited: 0x00)
struct FFortExperienceDelta {
	int32_t Level; // 0x00(0x04)
	int32_t XP; // 0x04(0x04)
	int32_t BaseXPEarned; // 0x08(0x04)
	int32_t BonusXPEarned; // 0x0c(0x04)
	int32_t BoostXPEarned; // 0x10(0x04)
	int32_t BoostXPMissed; // 0x14(0x04)
	int32_t RestXPEarned; // 0x18(0x04)
	int32_t GroupBoostXPEarned; // 0x1c(0x04)
	enum class EFortIsFinalXpUpdate IsFinalXpUpdate; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
};

// ScriptStruct FortniteGame.ReplicatedStatValues
// Size: 0x08 (Inherited: 0x00)
struct FReplicatedStatValues {
	int32_t StatValue; // 0x00(0x04)
	int32_t ScoreValue; // 0x04(0x04)
};

// ScriptStruct FortniteGame.BuildingContainerDebugInfo
// Size: 0x30 (Inherited: 0x00)
struct FBuildingContainerDebugInfo {
	struct FVector Location; // 0x00(0x0c)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FGameplayTagContainer LocationTags; // 0x10(0x20)
};

// ScriptStruct FortniteGame.GameStateLootInfo
// Size: 0x20 (Inherited: 0x00)
struct FGameStateLootInfo {
	struct TArray<struct FFortTreasureChestSpawnInfo> TreasureChestSpawnInfos; // 0x00(0x10)
	struct TArray<struct FFortAmmoBoxSpawnInfo> AmmoBoxSpawnInfos; // 0x10(0x10)
};

// ScriptStruct FortniteGame.FortAmmoBoxSpawnInfo
// Size: 0xa8 (Inherited: 0x00)
struct FFortAmmoBoxSpawnInfo {
	struct ABuildingContainer* AmmoBoxClass; // 0x00(0x08)
	struct FScalableFloat AmmoBoxMinSpawnPercent; // 0x08(0x28)
	struct FScalableFloat AmmoBoxMaxSpawnPercent; // 0x30(0x28)
	struct FScalableFloat GoldenPoiAmmoBoxMinSpawnPercent; // 0x58(0x28)
	struct FScalableFloat GoldenPoiAmmoBoxMaxSpawnPercent; // 0x80(0x28)
};

// ScriptStruct FortniteGame.FortTreasureChestSpawnInfo
// Size: 0xa8 (Inherited: 0x00)
struct FFortTreasureChestSpawnInfo {
	struct ABuildingContainer* TreasureChestClass; // 0x00(0x08)
	struct FScalableFloat TreasureChestMinSpawnPercent; // 0x08(0x28)
	struct FScalableFloat TreasureChestMaxSpawnPercent; // 0x30(0x28)
	struct FScalableFloat GoldenPoiTreasureChestMinSpawnPercent; // 0x58(0x28)
	struct FScalableFloat GoldenPoiTreasureChestMaxSpawnPercent; // 0x80(0x28)
};

// ScriptStruct FortniteGame.AppliedHomebaseData
// Size: 0x30 (Inherited: 0x00)
struct FAppliedHomebaseData {
	struct UAbilitySystemComponent* Source; // 0x00(0x08)
	struct UAbilitySystemComponent* Target; // 0x08(0x08)
	struct TArray<struct FActiveGameplayEffectHandle> AppliedEffects; // 0x10(0x10)
	struct TArray<struct FFortAbilitySetHandle> AppliedAbilitySets; // 0x20(0x10)
};

// ScriptStruct FortniteGame.FortAbilitySetHandle
// Size: 0x38 (Inherited: 0x00)
struct FFortAbilitySetHandle {
	struct TWeakObjectPtr<struct UAbilitySystemComponent> TargetAbilitySystemComponent; // 0x00(0x08)
	struct TArray<struct FGameplayAbilitySpecHandle> GrantedAbilityHandles; // 0x08(0x10)
	struct TArray<struct FActiveGameplayEffectHandle> AppliedEffectHandles; // 0x18(0x10)
	struct TArray<struct FGuid> ItemGuidsForAdditionalItems; // 0x28(0x10)
};

// ScriptStruct FortniteGame.TeamChangeRequest
// Size: 0x10 (Inherited: 0x00)
struct FTeamChangeRequest {
	struct AFortPlayerController* RequestingController; // 0x00(0x08)
	char DesiredTeam; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct FortniteGame.OnTimeHitInfo
// Size: 0x30 (Inherited: 0x00)
struct FOnTimeHitInfo {
	struct FDelegate TimeCallback; // 0x00(0x10)
	char pad_10[0x20]; // 0x10(0x20)
};

// ScriptStruct FortniteGame.AdditionalLevelStreamed
// Size: 0x0c (Inherited: 0x00)
struct FAdditionalLevelStreamed {
	struct FName LevelName; // 0x00(0x08)
	bool bIsServerOnly; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
};

// ScriptStruct FortniteGame.TieredWaveSetData
// Size: 0x1d0 (Inherited: 0x00)
struct FTieredWaveSetData {
	int32_t EDOIdx; // 0x00(0x04)
	float BreatherBetweenWaves; // 0x04(0x04)
	enum class EWaveRules WaveRules; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	struct FGameplayTag EnemyTypeToKillMod; // 0x0c(0x08)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<struct TSoftObjectPtr<struct UFortMissionInfo>> WaveMissions; // 0x18(0x10)
	float WaveLengthMod; // 0x28(0x04)
	float NumKillsMod; // 0x2c(0x04)
	float KillPointsMod; // 0x30(0x04)
	float DifficultyAddMod; // 0x34(0x04)
	bool bDeferTemporaryModifiers; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	SoftClassProperty OverrideSpawnPointsMultiplier; // 0x40(0x28)
	SoftClassProperty OverrideSpawnPointsCurve; // 0x68(0x28)
	SoftClassProperty OverrideSpawnProgression; // 0x90(0x28)
	SoftClassProperty OverrideUtilitiesAdjustment; // 0xb8(0x28)
	SoftClassProperty OverrideUtilitiesFree; // 0xe0(0x28)
	SoftClassProperty OverrideUtilitiesLocked; // 0x108(0x28)
	SoftClassProperty OverrideDistance; // 0x130(0x28)
	SoftClassProperty OverrideDirectionNumber; // 0x158(0x28)
	SoftClassProperty OverrideModifierTags; // 0x180(0x28)
	SoftClassProperty OverrideTimedModifierTags; // 0x1a8(0x28)
};

// ScriptStruct FortniteGame.ActiveGameplayModifierHandle
// Size: 0x04 (Inherited: 0x00)
struct FActiveGameplayModifierHandle {
	int32_t Handle; // 0x00(0x04)
};

// ScriptStruct FortniteGame.FortVoteConfig
// Size: 0x14 (Inherited: 0x00)
struct FFortVoteConfig {
	int32_t NumVoteOptions; // 0x00(0x04)
	float VoteDuration; // 0x04(0x04)
	float FailedVoteLockOutDuration; // 0x08(0x04)
	int32_t MaxVotesAllowedPerPlayer; // 0x0c(0x04)
	enum class EFortVoteArbitratorType VoteArbitratorType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct FortniteGame.VoteData
// Size: 0x78 (Inherited: 0x00)
struct FVoteData {
	enum class EFortVoteType VoteType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FUniqueNetIdRepl VoteInstigatorNetId; // 0x08(0x28)
	struct FFortVoteConfig VoteConfig; // 0x30(0x14)
	float VoteStartTime; // 0x44(0x04)
	float VoteEndTime; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct FVoter> Voters; // 0x50(0x10)
	int32_t NumVotersWithMaxVotes; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct FTimerHandle EndVoteTimerHandle; // 0x68(0x08)
	enum class EFortVoteStatus VoteStatus; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// ScriptStruct FortniteGame.PlayerBuildableClassContainer
// Size: 0x10 (Inherited: 0x00)
struct FPlayerBuildableClassContainer {
	struct TArray<struct ABuildingSMActor*> BuildingClasses; // 0x00(0x10)
};

// ScriptStruct FortniteGame.FortZoneMissionAlertData
// Size: 0x30 (Inherited: 0x00)
struct FFortZoneMissionAlertData {
	struct TArray<struct FFortItemQuantityPair> MissionAlertRewards; // 0x00(0x10)
	struct FString MissionAlertCategoryName; // 0x10(0x10)
	struct FString MissionAlertID; // 0x20(0x10)
};

// ScriptStruct FortniteGame.FortItemQuantityPair
// Size: 0x14 (Inherited: 0x00)
struct FFortItemQuantityPair {
	struct FPrimaryAssetId ItemPrimaryAssetId; // 0x00(0x10)
	int32_t Quantity; // 0x10(0x04)
};

// ScriptStruct FortniteGame.FortZoneDifficultyIncreaseRewardData
// Size: 0x10 (Inherited: 0x00)
struct FFortZoneDifficultyIncreaseRewardData {
	struct TArray<struct FFortItemQuantityPair> Rewards; // 0x00(0x10)
};

// ScriptStruct FortniteGame.ActiveGameplayModifierArray
// Size: 0x130 (Inherited: 0x108)
struct FActiveGameplayModifierArray : FFastArraySerializer {
	struct TArray<struct FActiveGameplayModifier> Items; // 0x108(0x10)
	struct TArray<struct FActiveGameplayModifier> DeferredGameplayModifiers; // 0x118(0x10)
	int32_t ModifierHandleGenerator; // 0x128(0x04)
	bool bSupportRuntimeModifierShutdown; // 0x12c(0x01)
	char pad_12D[0x3]; // 0x12d(0x03)
};

// ScriptStruct FortniteGame.ActiveGameplayModifier
// Size: 0xd8 (Inherited: 0x0c)
struct FActiveGameplayModifier : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct UFortGameplayModifierItemDefinition* ModifierDef; // 0x10(0x08)
	struct FActiveGameplayModifierHandle ModifierHandle; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct TArray<struct AFortGameplayMutator*> Mutators; // 0x20(0x10)
	int32_t Expiration; // 0x30(0x04)
	char pad_34[0xa4]; // 0x34(0xa4)
};

// ScriptStruct FortniteGame.ReplicatedMontageMap
// Size: 0x18 (Inherited: 0x00)
struct FReplicatedMontageMap {
	struct TArray<struct FReplicatedMontageIndexPair> Mappings; // 0x00(0x10)
	char pad_10[0x8]; // 0x10(0x08)
};

// ScriptStruct FortniteGame.ReplicatedMontageIndexPair
// Size: 0x10 (Inherited: 0x00)
struct FReplicatedMontageIndexPair {
	struct UAnimMontage* Montage; // 0x00(0x08)
	int32_t Index; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.EvaluationResult
// Size: 0x30 (Inherited: 0x00)
struct FEvaluationResult {
	bool bSucceeded; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString ErrorCode; // 0x08(0x10)
	struct FText ErrorMessage; // 0x18(0x18)
};

// ScriptStruct FortniteGame.PlayersLeft
// Size: 0x0c (Inherited: 0x00)
struct FPlayersLeft {
	int32_t Humans; // 0x00(0x04)
	int32_t Bots; // 0x04(0x04)
	int32_t Total; // 0x08(0x04)
};

// ScriptStruct FortniteGame.TotalPlayers
// Size: 0x0c (Inherited: 0x00)
struct FTotalPlayers {
	int32_t Humans; // 0x00(0x04)
	int32_t Bots; // 0x04(0x04)
	int32_t Total; // 0x08(0x04)
};

// ScriptStruct FortniteGame.AthenaStreamIdOverride
// Size: 0x20 (Inherited: 0x00)
struct FAthenaStreamIdOverride {
	struct FString SourceName; // 0x00(0x10)
	struct FString OverriddenId; // 0x10(0x10)
};

// ScriptStruct FortniteGame.CosmeticUsageReport
// Size: 0x80 (Inherited: 0x00)
struct FCosmeticUsageReport {
	struct TArray<struct UAthenaCosmeticItemDefinition*> TrackedCosmetics; // 0x00(0x10)
	char pad_10[0x50]; // 0x10(0x50)
	struct TArray<struct FVariantUsageReport> VariantUsageByCosmetic; // 0x60(0x10)
	struct TArray<int32_t> PrioritizedCosmeticIndices; // 0x70(0x10)
};

// ScriptStruct FortniteGame.VariantUsageReport
// Size: 0x18 (Inherited: 0x00)
struct FVariantUsageReport {
	struct TArray<struct FVariantUsageReportInner> VariantUsage; // 0x00(0x10)
	int32_t TotalUses; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct FortniteGame.VariantUsageReportInner
// Size: 0x14 (Inherited: 0x00)
struct FVariantUsageReportInner {
	struct FGameplayTag ChannelTag; // 0x00(0x08)
	struct FGameplayTag VariantTag; // 0x08(0x08)
	int32_t UseCount; // 0x10(0x04)
};

// ScriptStruct FortniteGame.SpawnMachineRepDataArray
// Size: 0x120 (Inherited: 0x108)
struct FSpawnMachineRepDataArray : FFastArraySerializer {
	struct TArray<struct FSpawnMachineRepData> SpawnMachineRepDataArray; // 0x108(0x10)
	struct AFortGameStateAthena* OwningGameState; // 0x118(0x08)
};

// ScriptStruct FortniteGame.SpawnMachineRepData
// Size: 0x28 (Inherited: 0x0c)
struct FSpawnMachineRepData : FFastArraySerializerItem {
	struct FVector Location; // 0x0c(0x0c)
	enum class ESpawnMachineState SpawnMachineState; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float SpawnMachineCooldownStartTime; // 0x1c(0x04)
	float SpawnMachineCooldownEndTime; // 0x20(0x04)
	int32_t SpawnMachineRepDataHandle; // 0x24(0x04)
};

// ScriptStruct FortniteGame.MeshNetworkStatus
// Size: 0x03 (Inherited: 0x00)
struct FMeshNetworkStatus {
	bool bEnabled; // 0x00(0x01)
	bool bConnectedToRoot; // 0x01(0x01)
	enum class EMeshNetworkNodeType GameServerNodeType; // 0x02(0x01)
};

// ScriptStruct FortniteGame.GameplayMutatorObjectDataArray
// Size: 0x118 (Inherited: 0x108)
struct FGameplayMutatorObjectDataArray : FFastArraySerializer {
	struct TArray<struct FGameplayMutatorObjectData> ObjectDataList; // 0x108(0x10)
};

// ScriptStruct FortniteGame.GameplayMutatorObjectData
// Size: 0x28 (Inherited: 0x0c)
struct FGameplayMutatorObjectData : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct UObject* TheObject; // 0x10(0x08)
	int32_t ObjectId; // 0x18(0x04)
	int32_t ObjectValue1; // 0x1c(0x04)
	int32_t ObjectValue2; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct FortniteGame.GameplayMutatorEventData
// Size: 0x10 (Inherited: 0x00)
struct FGameplayMutatorEventData {
	int32_t EventId; // 0x00(0x04)
	int32_t EventParam1; // 0x04(0x04)
	int32_t EventParam2; // 0x08(0x04)
	int32_t EventParam3; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.PlaylistPropertyArray
// Size: 0x1e8 (Inherited: 0x108)
struct FPlaylistPropertyArray : FFastArraySerializer {
	struct TArray<struct FPropertyOverride> PropertyOverrides; // 0x108(0x10)
	int32_t PlaylistReplicationKey; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct UFortPlaylistAthena* BasePlaylist; // 0x120(0x08)
	struct UFortPlaylistAthena* OverridePlaylist; // 0x128(0x08)
	struct TMap<struct FString, struct FPropertyOverrideScope> PropertyOverrideScopes; // 0x130(0x50)
	char pad_180[0x68]; // 0x180(0x68)
};

// ScriptStruct FortniteGame.PropertyOverrideScope
// Size: 0x10 (Inherited: 0x00)
struct FPropertyOverrideScope {
	struct TArray<struct FPropertyOverride> PropertyOverrides; // 0x00(0x10)
};

// ScriptStruct FortniteGame.PropertyOverride
// Size: 0x40 (Inherited: 0x0c)
struct FPropertyOverride : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString PropertyScope; // 0x10(0x10)
	struct FString PropertyName; // 0x20(0x10)
	struct FString PropertyData; // 0x30(0x10)
};

// ScriptStruct FortniteGame.AIPawnCustomizationPreloadData
// Size: 0x10 (Inherited: 0x00)
struct FAIPawnCustomizationPreloadData {
	float Priority; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UFortAIPawnCustomizationDefinition* Customization; // 0x08(0x08)
};

// ScriptStruct FortniteGame.AICharacterPartsPreloadData
// Size: 0x10 (Inherited: 0x00)
struct FAICharacterPartsPreloadData {
	float Priority; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UCustomCharacterPart* CharacterPart; // 0x08(0x08)
};

// ScriptStruct FortniteGame.DynamicLandData
// Size: 0xa0 (Inherited: 0x00)
struct FDynamicLandData {
	struct FName Name; // 0x00(0x08)
	struct FVector WorldPosition; // 0x08(0x0c)
	char pad_14[0x4]; // 0x14(0x04)
	struct FSlateBrush LandBrush; // 0x18(0x88)
};

// ScriptStruct FortniteGame.GameMemberInfoArray
// Size: 0x120 (Inherited: 0x108)
struct FGameMemberInfoArray : FFastArraySerializer {
	struct TArray<struct FGameMemberInfo> Members; // 0x108(0x10)
	struct AFortGameStateAthena* OwningGameState; // 0x118(0x08)
};

// ScriptStruct FortniteGame.GameMemberInfo
// Size: 0x38 (Inherited: 0x0c)
struct FGameMemberInfo : FFastArraySerializerItem {
	char SquadId; // 0x0c(0x01)
	char TeamIndex; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
	struct FUniqueNetIdRepl MemberUniqueId; // 0x10(0x28)
};

// ScriptStruct FortniteGame.AircraftFlightInfo
// Size: 0x28 (Inherited: 0x00)
struct FAircraftFlightInfo {
	struct FVector_NetQuantize100 FlightStartLocation; // 0x00(0x0c)
	struct FRotator FlightStartRotation; // 0x0c(0x0c)
	float FlightSpeed; // 0x18(0x04)
	float TimeTillFlightEnd; // 0x1c(0x04)
	float TimeTillDropStart; // 0x20(0x04)
	float TimeTillDropEnd; // 0x24(0x04)
};

// ScriptStruct FortniteGame.FortWinnerPlayerData
// Size: 0x04 (Inherited: 0x00)
struct FFortWinnerPlayerData {
	int32_t PlayerID; // 0x00(0x04)
};

// ScriptStruct FortniteGame.StormCapDamageThresholdInfo
// Size: 0x08 (Inherited: 0x00)
struct FStormCapDamageThresholdInfo {
	float ThresholdFloor; // 0x00(0x04)
	float ThresholdCeiling; // 0x04(0x04)
};

// ScriptStruct FortniteGame.FortPlayerAttributeSets
// Size: 0x50 (Inherited: 0x00)
struct FFortPlayerAttributeSets {
	struct UFortRegenHealthSet* HealthSet; // 0x00(0x08)
	struct UFortControlResistanceSet* ControlResistanceSet; // 0x08(0x08)
	struct UFortDamageSet* DamageSet; // 0x10(0x08)
	struct UFortMovementSet* MovementSet; // 0x18(0x08)
	struct UFortAdvancedMovementSet* AdvancedMovementSet; // 0x20(0x08)
	struct UFortConstructionSet* ConstructionSet; // 0x28(0x08)
	struct UFortPlayerAttrSet* PlayerAttrSet; // 0x30(0x08)
	struct UFortCharacterAttrSet* CharacterAttrSet; // 0x38(0x08)
	struct UFortWeaponAttrSet* WeaponAttrSet; // 0x40(0x08)
	struct UFortHomebaseSet* HomebaseSet; // 0x48(0x08)
};

// ScriptStruct FortniteGame.FortAppliedSwapItemAndVariantData
// Size: 0x28 (Inherited: 0x00)
struct FFortAppliedSwapItemAndVariantData {
	struct FGuid SwapId; // 0x00(0x10)
	enum class EFortAppliedSwapItemAndVariantState SwapState; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<struct FFortSwapItemAndVariantData> SwapData; // 0x18(0x10)
};

// ScriptStruct FortniteGame.FortSwapItemAndVariantData
// Size: 0x18 (Inherited: 0x00)
struct FFortSwapItemAndVariantData {
	struct UFortItemDefinition* Item; // 0x00(0x08)
	struct TArray<struct FMcpVariantChannelInfo> ChannelInfoList; // 0x08(0x10)
};

// ScriptStruct FortniteGame.CustomCharacterData
// Size: 0x78 (Inherited: 0x00)
struct FCustomCharacterData {
	char WasPartReplicatedFlags; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t RequiredVariantPartFlags; // 0x04(0x04)
	struct UCustomCharacterPart* Parts[0x7]; // 0x08(0x38)
	struct UAthenaCharmItemDefinition* Charms[0x4]; // 0x40(0x20)
	struct TArray<struct UCustomCharacterPart*> VariantRequiredCharacterParts; // 0x60(0x10)
	bool bReplicationFailed; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// ScriptStruct FortniteGame.PlayerBannerInfo
// Size: 0x28 (Inherited: 0x00)
struct FPlayerBannerInfo {
	struct FString IconId; // 0x00(0x10)
	struct FString ColorId; // 0x10(0x10)
	int32_t Level; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct FortniteGame.SimulatedAttributeEntry
// Size: 0x40 (Inherited: 0x00)
struct FSimulatedAttributeEntry {
	struct FGameplayAttribute Attribute; // 0x00(0x38)
	float CurrentValue; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct FortniteGame.AccumulatedItemEntry
// Size: 0x10 (Inherited: 0x00)
struct FAccumulatedItemEntry {
	struct UFortWorldItemDefinition* ItemDefinition; // 0x00(0x08)
	int32_t Quantity; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.FortSpectatorZoneArray
// Size: 0x120 (Inherited: 0x108)
struct FFortSpectatorZoneArray : FFastArraySerializer {
	struct TArray<struct FFortSpectatorZoneItem> SpectatorArray; // 0x108(0x10)
	struct AFortPlayerStateZone* OwningState; // 0x118(0x08)
};

// ScriptStruct FortniteGame.FortSpectatorZoneItem
// Size: 0x18 (Inherited: 0x0c)
struct FFortSpectatorZoneItem : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct AFortPlayerStateZone* PlayerState; // 0x10(0x08)
};

// ScriptStruct FortniteGame.FortCreativeMessageDispatcherErrorMessage
// Size: 0x30 (Inherited: 0x00)
struct FFortCreativeMessageDispatcherErrorMessage {
	enum class EMessageDispatcherErrorMessageType ErrorMessageType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText MessageName; // 0x08(0x18)
	struct FGameplayTag ChannelId; // 0x20(0x08)
	int32_t LimitValue; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct FortniteGame.EventTournamentIds
// Size: 0x40 (Inherited: 0x00)
struct FEventTournamentIds {
	struct FString EventId; // 0x00(0x10)
	struct FString WindowId; // 0x10(0x10)
	struct FString GroupId; // 0x20(0x10)
	struct FString SubGroupId; // 0x30(0x10)
};

// ScriptStruct FortniteGame.FortTournamentStatInfo
// Size: 0x20 (Inherited: 0x00)
struct FFortTournamentStatInfo {
	struct FString StatName; // 0x00(0x10)
	struct FName StatDisplayName; // 0x10(0x08)
	int32_t StatValue; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.DeathInfo
// Size: 0x90 (Inherited: 0x00)
struct FDeathInfo {
	struct AActor* FinisherOrDowner; // 0x00(0x08)
	struct AActor* Downer; // 0x08(0x08)
	bool bDBNO; // 0x10(0x01)
	enum class EDeathCause DeathCause; // 0x11(0x01)
	char DeathClassSlot; // 0x12(0x01)
	char pad_13[0x1]; // 0x13(0x01)
	float Distance; // 0x14(0x04)
	struct FVector DeathLocation; // 0x18(0x0c)
	bool bInitialized; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	struct FGameplayTagContainer DeathTags; // 0x28(0x20)
	struct FGameplayTagContainer FinisherOrDownerTags; // 0x48(0x20)
	struct FGameplayTagContainer VictimTags; // 0x68(0x20)
	char pad_88[0x8]; // 0x88(0x08)
};

// ScriptStruct FortniteGame.DetailedMetricInformation
// Size: 0x10 (Inherited: 0x00)
struct FDetailedMetricInformation {
	struct TArray<struct FMetricStateInformation> MetricStates; // 0x00(0x10)
};

// ScriptStruct FortniteGame.MetricStateInformation
// Size: 0x30 (Inherited: 0x00)
struct FMetricStateInformation {
	struct FString Name; // 0x00(0x10)
	struct FString Description; // 0x10(0x10)
	enum class EFortBudgetCategory Category; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	int32_t Cost; // 0x24(0x04)
	int32_t Budget; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct FortniteGame.SimpleMetricInformation
// Size: 0x60 (Inherited: 0x00)
struct FSimpleMetricInformation {
	struct TArray<enum class EFortBudgetCategory> CategoryNames; // 0x00(0x10)
	struct TArray<int32_t> CategoryValues; // 0x10(0x10)
	struct TArray<int32_t> CategoryBudgets; // 0x20(0x10)
	struct FVector Location; // 0x30(0x0c)
	float NormalizedGroupBudgetValue; // 0x3c(0x04)
	int32_t GroupTotalBudget; // 0x40(0x04)
	struct FVector NeighbourGroupCenter; // 0x44(0x0c)
	struct TArray<char> NeighbourGroupBudgetValue; // 0x50(0x10)
};

// ScriptStruct FortniteGame.FortResurrectionData
// Size: 0x18 (Inherited: 0x00)
struct FFortResurrectionData {
	bool bResurrectionChipAvailable; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float ResurrectionExpirationTime; // 0x04(0x04)
	float ResurrectionExpirationLength; // 0x08(0x04)
	struct FVector WorldLocation; // 0x0c(0x0c)
};

// ScriptStruct FortniteGame.ChangeTeamInfo
// Size: 0x28 (Inherited: 0x00)
struct FChangeTeamInfo {
	struct AActor* Instigator; // 0x00(0x08)
	struct FGameplayTagContainer ChangeTeamTags; // 0x08(0x20)
};

// ScriptStruct FortniteGame.FortRespawnData
// Size: 0x20 (Inherited: 0x00)
struct FFortRespawnData {
	bool bRespawnDataAvailable; // 0x00(0x01)
	bool bClientIsReady; // 0x01(0x01)
	bool bServerIsReady; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	struct FVector RespawnLocation; // 0x04(0x0c)
	struct FRotator RespawnRotation; // 0x10(0x0c)
	float RespawnCameraDistance; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.XPEventInfo
// Size: 0x50 (Inherited: 0x00)
struct FXPEventInfo {
	struct FName EventName; // 0x00(0x08)
	struct FText SimulatedText; // 0x08(0x18)
	struct UFortQuestItemDefinition* QuestDef; // 0x20(0x08)
	enum class EXPEventPriorityType Priority; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	int32_t EventXpValue; // 0x2c(0x04)
	int32_t TotalXpEarnedInMatch; // 0x30(0x04)
	struct FPrimaryAssetId Accolade; // 0x34(0x10)
	int32_t RestedValuePortion; // 0x44(0x04)
	int32_t SeasonBoostValuePortion; // 0x48(0x04)
	int32_t RestedXPRemaining; // 0x4c(0x04)
};

// ScriptStruct FortniteGame.VehicleTrickInfo
// Size: 0x140 (Inherited: 0x00)
struct FVehicleTrickInfo {
	float LastOnGroundTime; // 0x00(0x04)
	float mCreditDisabledTime; // 0x04(0x04)
	int32_t TrickScore; // 0x08(0x04)
	char pad_C[0x90]; // 0x0c(0x90)
	int32_t TrickAxisCount; // 0x9c(0x04)
	char pad_A0[0x18]; // 0xa0(0x18)
	float AirControlsAlpha; // 0xb8(0x04)
	float AirDistance; // 0xbc(0x04)
	float AirDistanceSqrd; // 0xc0(0x04)
	float AirTime; // 0xc4(0x04)
	float AirHeight; // 0xc8(0x04)
	float TimeAtLaunch; // 0xcc(0x04)
	struct FVector LocationAtLaunch; // 0xd0(0x0c)
	struct FVector ForwardVectorAtLaunch; // 0xdc(0x0c)
	struct FVector UpVectorAtLaunch; // 0xe8(0x0c)
	struct FVector FlatForwardVectorAtLaunch; // 0xf4(0x0c)
	struct FVector PrevForwardVec; // 0x100(0x0c)
	struct FVector PrevRightVec; // 0x10c(0x0c)
	struct FVector PrevUpVec; // 0x118(0x0c)
	int32_t PeterPanCount; // 0x124(0x04)
	int32_t StoopingSquirrelCount; // 0x128(0x04)
	char bDidPeterPan : 1; // 0x12c(0x01)
	char bDidStoopingSquirrel : 1; // 0x12c(0x01)
	char bInAirTrick : 1; // 0x12c(0x01)
	char bCreditTrick : 1; // 0x12c(0x01)
	char bTrickDeactivated : 1; // 0x12c(0x01)
	char bStuckLanding : 1; // 0x12c(0x01)
	char bDoingRotationTrick : 1; // 0x12c(0x01)
	char pad_12D[0x13]; // 0x12d(0x13)
};

// ScriptStruct FortniteGame.CreativeOptionVariableBase
// Size: 0x0c (Inherited: 0x00)
struct FCreativeOptionVariableBase {
	struct FGameplayTag VariableTag; // 0x00(0x08)
	int32_t Value; // 0x08(0x04)
};

// ScriptStruct FortniteGame.GhostModeRepData
// Size: 0x18 (Inherited: 0x00)
struct FGhostModeRepData {
	bool bInGhostMode; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UFortWorldItemDefinition* GhostModeItemDef; // 0x08(0x08)
	int32_t PreviousFocusedSlot; // 0x10(0x04)
	float TimeExitedGhostMode; // 0x14(0x04)
};

// ScriptStruct FortniteGame.FortPlayerDeathReport
// Size: 0x78 (Inherited: 0x00)
struct FFortPlayerDeathReport {
	float ServerTimeForRespawn; // 0x00(0x04)
	float ServerTimeForResurrect; // 0x04(0x04)
	float LethalDamage; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct AFortPlayerState* KillerPlayerState; // 0x10(0x08)
	struct AFortPawn* KillerPawn; // 0x18(0x08)
	float KillerHealthPercent; // 0x20(0x04)
	float KillerShieldPercent; // 0x24(0x04)
	struct UFortWeaponItemDefinition* KillerWeapon; // 0x28(0x08)
	struct AActor* DamageCauser; // 0x30(0x08)
	char bDroppedBackpack : 1; // 0x38(0x01)
	char bNotifyUI : 1; // 0x38(0x01)
	char pad_38_2 : 6; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FGameplayTagContainer Tags; // 0x40(0x20)
	struct FVector ViewLocationAtTimeOfDeath; // 0x60(0x0c)
	struct FRotator ViewRotationAtTimeOfDeath; // 0x6c(0x0c)
};

// ScriptStruct FortniteGame.FortDisplayQuestUpdateData
// Size: 0x38 (Inherited: 0x00)
struct FFortDisplayQuestUpdateData {
	struct FFortUpdatedObjectiveStat ObjectiveUpdated; // 0x00(0x28)
	struct AFortPlayerState* QuestOwner; // 0x28(0x08)
	struct AFortPlayerState* AssistingPlayer; // 0x30(0x08)
};

// ScriptStruct FortniteGame.GiftUINotificationInfo
// Size: 0x30 (Inherited: 0x00)
struct FGiftUINotificationInfo {
	struct TSoftObjectPtr<struct UFortItemDefinition> SoftItemPtr; // 0x00(0x28)
	int32_t Count; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct FortniteGame.ProfileGoScenario
// Size: 0x50 (Inherited: 0x00)
struct FProfileGoScenario {
	struct FString Name; // 0x00(0x10)
	struct FVector Position; // 0x10(0x0c)
	struct FRotator Orientation; // 0x1c(0x0c)
	struct FString OnBegin; // 0x28(0x10)
	struct FString OnEnd; // 0x38(0x10)
	bool AutoGenerated; // 0x48(0x01)
	bool UseSetupCheats; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// ScriptStruct FortniteGame.AthenaQuickChatActiveEntry
// Size: 0x14 (Inherited: 0x00)
struct FAthenaQuickChatActiveEntry {
	struct TWeakObjectPtr<struct UAthenaQuickChatBank> Bank; // 0x00(0x08)
	struct TWeakObjectPtr<struct UObject> ContextObject; // 0x08(0x08)
	int16_t ContextValue; // 0x10(0x02)
	int8_t Index; // 0x12(0x01)
	char pad_13[0x1]; // 0x13(0x01)
};

// ScriptStruct FortniteGame.PlayerStateEncryptionKey
// Size: 0x10 (Inherited: 0x00)
struct FPlayerStateEncryptionKey {
	struct TArray<char> Key; // 0x00(0x10)
};

// ScriptStruct FortniteGame.FortWorldMarkerData
// Size: 0x130 (Inherited: 0x0c)
struct FFortWorldMarkerData : FFastArraySerializerItem {
	struct FMarkerID MarkerID; // 0x0c(0x08)
	char pad_14[0x4]; // 0x14(0x04)
	struct AFortPlayerState* Owner; // 0x18(0x08)
	enum class EFortWorldMarkerType MarkerType; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	struct FVector BasePosition; // 0x24(0x0c)
	struct FVector BasePositionOffset; // 0x30(0x0c)
	struct FVector WorldNormal; // 0x3c(0x0c)
	struct UFortItemDefinition* ItemDefinition; // 0x48(0x08)
	int32_t ItemCount; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct AActor* MarkedActor; // 0x58(0x08)
	SoftClassProperty MarkedActorClass; // 0x60(0x28)
	bool bIncludeSquad; // 0x88(0x01)
	bool bHasCustomDisplayInfo; // 0x89(0x01)
	bool bUseHoveredMarkerDetail; // 0x8a(0x01)
	char pad_8B[0x5]; // 0x8b(0x05)
	struct FMarkedActorDisplayInfo CustomDisplayInfo; // 0x90(0x98)
	struct UFortWorldMarker* MarkerInstance; // 0x128(0x08)
};

// ScriptStruct FortniteGame.MarkedActorDisplayInfo
// Size: 0x98 (Inherited: 0x08)
struct FMarkedActorDisplayInfo : FTableRowBase {
	struct FText DisplayName; // 0x08(0x18)
	struct TSoftObjectPtr<struct UTexture2D> Icon; // 0x20(0x28)
	struct UUserWidget* CustomIndicatorClass; // 0x48(0x08)
	SoftClassProperty CustomDetailsClass; // 0x50(0x28)
	struct FLinearColor PrimaryColor; // 0x78(0x10)
	struct USoundBase* sound; // 0x88(0x08)
	enum class EFortMarkedActorScreenClamping ScreenClamping; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
};

// ScriptStruct FortniteGame.MarkerID
// Size: 0x08 (Inherited: 0x00)
struct FMarkerID {
	int32_t PlayerID; // 0x00(0x04)
	int32_t InstanceID; // 0x04(0x04)
};

// ScriptStruct FortniteGame.CreativePublishOptions
// Size: 0x58 (Inherited: 0x00)
struct FCreativePublishOptions {
	struct FString UserTitle; // 0x00(0x10)
	struct FString UserDescription; // 0x10(0x10)
	struct FString UserYoutubeVideoId; // 0x20(0x10)
	struct TArray<struct FString> DescriptionTags; // 0x30(0x10)
	bool bActivateLink; // 0x40(0x01)
	bool bClearPersistentData; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct FString UserLocale; // 0x48(0x10)
};

// ScriptStruct FortniteGame.TimeStampedPhysicsPawnState
// Size: 0x50 (Inherited: 0x00)
struct FTimeStampedPhysicsPawnState {
	float WorldTime; // 0x00(0x04)
	char pad_4[0xc]; // 0x04(0x0c)
	struct FReplicatedPhysicsPawnState PhysicsPawnState; // 0x10(0x40)
};

// ScriptStruct FortniteGame.ReplicatedPhysicsPawnState
// Size: 0x40 (Inherited: 0x00)
struct FReplicatedPhysicsPawnState {
	struct FVector_NetQuantize100 Translation; // 0x00(0x0c)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FQuat Rotation; // 0x10(0x10)
	struct FVector_NetQuantize10 LinearVelocity; // 0x20(0x0c)
	struct FVector_NetQuantize10 AngularVelocity; // 0x2c(0x0c)
	uint16_t SyncKey; // 0x38(0x02)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// ScriptStruct FortniteGame.QuickBarEquippedItemGuids
// Size: 0xa4 (Inherited: 0x00)
struct FQuickBarEquippedItemGuids {
	struct FGuid EquippedItemGuids[0xa]; // 0x00(0xa0)
	int32_t NumEnabledSlots; // 0xa0(0x04)
};

// ScriptStruct FortniteGame.FortPlaysetStreamingData
// Size: 0x2c (Inherited: 0x00)
struct FFortPlaysetStreamingData {
	struct FName PackageName; // 0x00(0x08)
	struct FName UniquePackageName; // 0x08(0x08)
	struct FVector Location; // 0x10(0x0c)
	struct FRotator Rotation; // 0x1c(0x0c)
	char bValid : 1; // 0x28(0x01)
	char pad_28_1 : 7; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
};

// ScriptStruct FortniteGame.CreativeIslandInfo
// Size: 0x30 (Inherited: 0x00)
struct FCreativeIslandInfo {
	struct FString IslandTitle; // 0x00(0x10)
	struct FString IslandIntroduction; // 0x10(0x10)
	struct FString UserLocale; // 0x20(0x10)
};

// ScriptStruct FortniteGame.CompositeBool
// Size: 0x18 (Inherited: 0x00)
struct FCompositeBool {
	bool bDefaultValue; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct TSoftObjectPtr<struct UObject>> ModifyingObjects; // 0x08(0x10)
};

// ScriptStruct FortniteGame.ItemAndCount
// Size: 0x10 (Inherited: 0x00)
struct FItemAndCount {
	int32_t Count; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UFortItemDefinition* Item; // 0x08(0x08)
};

// ScriptStruct FortniteGame.CreativePlotSessionData
// Size: 0x14 (Inherited: 0x00)
struct FCreativePlotSessionData {
	char pad_0[0x8]; // 0x00(0x08)
	int32_t TimesInventoryOpened; // 0x08(0x04)
	int32_t TimesIslandMenuOpened; // 0x0c(0x04)
	int32_t TimesGameStarted; // 0x10(0x04)
};

// ScriptStruct FortniteGame.BuildingEditAnalyticEvent
// Size: 0x10 (Inherited: 0x00)
struct FBuildingEditAnalyticEvent {
	enum class EFortBuildingType BuildingType; // 0x00(0x01)
	enum class EFortResourceType ResourceType; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	struct FVector Location; // 0x04(0x0c)
};

// ScriptStruct FortniteGame.BuildingStats
// Size: 0x20 (Inherited: 0x00)
struct FBuildingStats {
	int32_t BuildingsPlaced; // 0x00(0x04)
	int32_t WallsPlaced; // 0x04(0x04)
	int32_t StairsPlaced; // 0x08(0x04)
	int32_t FloorsPlaced; // 0x0c(0x04)
	int32_t RoofsPlaced; // 0x10(0x04)
	int32_t WoodBuildingsPlaced; // 0x14(0x04)
	int32_t StoneBuildingsPlaced; // 0x18(0x04)
	int32_t MetalBuildingsPlaced; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.QuickBarData
// Size: 0x10 (Inherited: 0x00)
struct FQuickBarData {
	struct TArray<struct FQuickBarSlotData> QuickbarSlots; // 0x00(0x10)
};

// ScriptStruct FortniteGame.QuickBarSlotData
// Size: 0x40 (Inherited: 0x00)
struct FQuickBarSlotData {
	struct TArray<enum class EFortItemType> AcceptedItemTypes; // 0x00(0x10)
	bool bStaticSlot; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TSoftObjectPtr<struct UFortWorldItemDefinition> DefaultItem; // 0x18(0x28)
};

// ScriptStruct FortniteGame.CreativeIslandData
// Size: 0x58 (Inherited: 0x00)
struct FCreativeIslandData {
	struct FString McpId; // 0x00(0x10)
	struct FText IslandName; // 0x10(0x18)
	struct FString PublishedIslandCode; // 0x28(0x10)
	int32_t PublishedIslandVersion; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FDateTime LastLoadedDate; // 0x40(0x08)
	struct FDateTime DeletedAt; // 0x48(0x08)
	bool bIsDeleted; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// ScriptStruct FortniteGame.LevelStreamRequestHandshakeState
// Size: 0x01 (Inherited: 0x00)
struct FLevelStreamRequestHandshakeState {
	bool bLevelStreamingCompleted; // 0x00(0x01)
};

// ScriptStruct FortniteGame.CumulativeFrameTimeWithoutSleepLimits
// Size: 0x18 (Inherited: 0x00)
struct FCumulativeFrameTimeWithoutSleepLimits {
	double FrameTimeWithoutSleep; // 0x00(0x08)
	double MaxCumulativeFrameTimeAboveThreshold; // 0x08(0x08)
	double MaxNumberOfFramesAboveThreshold; // 0x10(0x08)
};

// ScriptStruct FortniteGame.HotfixVolumePlacement
// Size: 0x50 (Inherited: 0x00)
struct FHotfixVolumePlacement {
	struct FString Map; // 0x00(0x10)
	struct FVector Center; // 0x10(0x0c)
	struct FVector Extent; // 0x1c(0x0c)
	struct FString GameInclude; // 0x28(0x10)
	struct FString GameExclude; // 0x38(0x10)
	bool bNeededOnClient; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct FortniteGame.FortSpawnActorData
// Size: 0x20 (Inherited: 0x00)
struct FFortSpawnActorData {
	struct UFortSpawnActorInfo* SpawnActorInfo; // 0x00(0x08)
	int32_t NumSpawnsRemaining; // 0x08(0x04)
	float TimeUntilNextSpawn; // 0x0c(0x04)
	struct TArray<struct AActor*> SpawnedFortSpawnActors; // 0x10(0x10)
};

// ScriptStruct FortniteGame.AthenaVehicleOverride
// Size: 0x60 (Inherited: 0x00)
struct FAthenaVehicleOverride {
	struct FString RequiredCalendarEvent; // 0x00(0x10)
	SoftClassProperty DefaultVehicleClass; // 0x10(0x28)
	SoftClassProperty OverrideVehicleClass; // 0x38(0x28)
};

// ScriptStruct FortniteGame.ExitCraftSpawnData
// Size: 0x08 (Inherited: 0x00)
struct FExitCraftSpawnData {
	struct UFortAthenaExitCraftInfo* ExitCraftInfo; // 0x00(0x08)
};

// ScriptStruct FortniteGame.BuildingGameplayActorSpawnData
// Size: 0x14 (Inherited: 0x00)
struct FBuildingGameplayActorSpawnData {
	int32_t BGAIndex; // 0x00(0x04)
	int32_t NumSpawnedBGAs; // 0x04(0x04)
	int32_t NumBGAsToSpawn; // 0x08(0x04)
	float NextSpawnTime; // 0x0c(0x04)
	enum class EBuildingGameplayActorAircraftSpawnSide LastSpawnSide; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct FortniteGame.SupplyDropSpawnData
// Size: 0x50 (Inherited: 0x00)
struct FSupplyDropSpawnData {
	struct UFortSupplyDropInfo* SupplyDropInfo; // 0x00(0x08)
	struct FSupplyDropZoneBasedSpawnData ZoneBasedData; // 0x08(0x28)
	struct FSupplyDropItemDeliverySpawnData ItemDeliveryData; // 0x30(0x20)
};

// ScriptStruct FortniteGame.SupplyDropItemDeliverySpawnData
// Size: 0x20 (Inherited: 0x00)
struct FSupplyDropItemDeliverySpawnData {
	int32_t NumItemsToDeliver; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<float> QueuedSpawnTimes; // 0x08(0x10)
	float NextSpawnTime; // 0x18(0x04)
	int32_t NumInitialSpawns; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.SupplyDropZoneBasedSpawnData
// Size: 0x28 (Inherited: 0x00)
struct FSupplyDropZoneBasedSpawnData {
	struct TArray<struct AFortAthenaSupplyDrop*> SpawnedSupplyDrops; // 0x00(0x10)
	int32_t NumDropsRemainingInWave; // 0x10(0x04)
	float NextWaveSpawnTime; // 0x14(0x04)
	float NextSpawnTime; // 0x18(0x04)
	enum class EAthenaGamePhase CurrGamePhase; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	int32_t CurrSubPhase; // 0x20(0x04)
	int32_t TotalSupplyDropsSpawnedInSubPhase; // 0x24(0x04)
};

// ScriptStruct FortniteGame.ScorePlacementTable
// Size: 0xe0 (Inherited: 0x00)
struct FScorePlacementTable {
	struct TArray<float> Solo; // 0x00(0x10)
	struct TArray<float> Duos; // 0x10(0x10)
	struct TArray<float> Squads; // 0x20(0x10)
	struct TArray<float> FiftyFifty; // 0x30(0x10)
	struct TArray<float> LargeTeam; // 0x40(0x10)
	struct TArray<float> MediumTeam; // 0x50(0x10)
	struct TArray<float> QuickSolo; // 0x60(0x10)
	struct TArray<float> QuickDuo; // 0x70(0x10)
	struct TArray<float> QuickSquad; // 0x80(0x10)
	struct TArray<float> QuickLargeTeam; // 0x90(0x10)
	struct TArray<float> QuickTwoTeam; // 0xa0(0x10)
	struct TArray<float> QuickMediumTeam; // 0xb0(0x10)
	struct TArray<float> SinglePlacement; // 0xc0(0x10)
	struct TArray<float> Default; // 0xd0(0x10)
};

// ScriptStruct FortniteGame.GCSettingsOverride
// Size: 0x10 (Inherited: 0x00)
struct FGCSettingsOverride {
	struct FName PlaylistName; // 0x00(0x08)
	bool bEnableGCOnServerDuringMatch; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float GCFrequency; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.TimeOfDayOverride
// Size: 0x10 (Inherited: 0x00)
struct FTimeOfDayOverride {
	struct FName PlaylistName; // 0x00(0x08)
	float TimeOfDay; // 0x08(0x04)
	float TimeOfDaySpeed; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.AdHocSquad_InviteData
// Size: 0x20 (Inherited: 0x0c)
struct FAdHocSquad_InviteData : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct AFortPlayerStateAthena* InvitingPlayerState; // 0x10(0x08)
	enum class EAdHocSquads_InviteStatus InviteStatus; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
};

// ScriptStruct FortniteGame.UrgentQuestData
// Size: 0x130 (Inherited: 0x00)
struct FUrgentQuestData {
	struct FGameplayTag EventTag; // 0x00(0x08)
	float TotalEventTime; // 0x08(0x04)
	bool bQuestCompleteOnTimeExpiration; // 0x0c(0x01)
	bool bDisplayHUDData; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
	struct FText EventTitle; // 0x10(0x18)
	struct FText EventSubtitle; // 0x28(0x18)
	struct FText EventSubtitleSecondary; // 0x40(0x18)
	struct FText EventDescription; // 0x58(0x18)
	int32_t SortPriority; // 0x70(0x04)
	bool bReverseProgressBar; // 0x74(0x01)
	bool bShowBountyThreatInformation; // 0x75(0x01)
	bool bShowBountyPriceAndDistance; // 0x76(0x01)
	char pad_77[0x1]; // 0x77(0x01)
	struct AFortPlayerStateAthena* DisplayPlayer; // 0x78(0x08)
	struct AFortPlayerStateAthena* AcceptingPlayer; // 0x80(0x08)
	struct TSoftObjectPtr<struct UTexture2D> SocialAvatarBrushPtr; // 0x88(0x28)
	struct UObject* BountyPriceImage; // 0xb0(0x08)
	struct TSoftObjectPtr<struct UObject> AlertIcon; // 0xb8(0x28)
	struct TSoftObjectPtr<struct USoundBase> SpecialEventStartedSound; // 0xe0(0x28)
	struct FDateTime EventStartTime; // 0x108(0x08)
	struct FTimerHandle EventTimerHandle; // 0x110(0x08)
	struct FLinearColor AlertIconBorderColor; // 0x118(0x10)
	struct FVector2D AlertIconBrushSize; // 0x128(0x08)
};

// ScriptStruct FortniteGame.PropertyOverrideData
// Size: 0x50 (Inherited: 0x00)
struct FPropertyOverrideData {
	struct TArray<struct FPropertyOverrideMk2> PropertyOverrides; // 0x00(0x10)
	struct TArray<struct FPropertyOverrideId> SharedPropertyIds; // 0x10(0x10)
	struct TArray<struct FPropertyOverrideId> PendingPropertyIds; // 0x20(0x10)
	char pad_30[0x8]; // 0x30(0x08)
	enum class EPropertyOverrideTargetType OverrideMode; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct UObject* BaseObject; // 0x40(0x08)
	struct UObject* MutableObject; // 0x48(0x08)
};

// ScriptStruct FortniteGame.PropertyOverrideId
// Size: 0x08 (Inherited: 0x00)
struct FPropertyOverrideId {
	uint64_t PropertyHashes; // 0x00(0x08)
};

// ScriptStruct FortniteGame.PropertyOverrideMk2
// Size: 0x48 (Inherited: 0x00)
struct FPropertyOverrideMk2 {
	struct FString PropertyScope; // 0x00(0x10)
	struct FString PropertyName; // 0x10(0x10)
	struct FString PropertyData; // 0x20(0x10)
	struct FString DefaultPropertyData; // 0x30(0x10)
	char pad_40[0x8]; // 0x40(0x08)
};

// ScriptStruct FortniteGame.FortAttributeInitializationKey
// Size: 0x10 (Inherited: 0x00)
struct FFortAttributeInitializationKey {
	struct FName AttributeInitCategory; // 0x00(0x08)
	struct FName AttributeInitSubCategory; // 0x08(0x08)
};

// ScriptStruct FortniteGame.BuildingGameplayActorAbilityDeliveryInfo
// Size: 0xa0 (Inherited: 0x00)
struct FBuildingGameplayActorAbilityDeliveryInfo {
	struct TArray<struct FBuildingGameplayActorAbilityDeliveryBucket> DeliveryBuckets; // 0x00(0x10)
	struct FScalableFloat ProximityPulseInterval; // 0x10(0x28)
	struct FScalableFloat ProximityPrePulseTime; // 0x38(0x28)
	char bHasGEsToApplyOnTouch : 1; // 0x60(0x01)
	char bHasGEsToApplyOnExit : 1; // 0x60(0x01)
	char bHasGEsToApplyOnPulseTimer : 1; // 0x60(0x01)
	char bHasPersistentEffects : 1; // 0x60(0x01)
	char pad_60_4 : 4; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct ABuildingGameplayActor* OwningActor; // 0x68(0x08)
	struct TArray<struct AActor*> DeferredTouchActorsToProcess; // 0x70(0x10)
	char pad_80[0x20]; // 0x80(0x20)
};

// ScriptStruct FortniteGame.BuildingGameplayActorAbilityDeliveryBucket
// Size: 0x90 (Inherited: 0x00)
struct FBuildingGameplayActorAbilityDeliveryBucket {
	struct FGameplayTag Tag; // 0x00(0x08)
	struct TArray<struct FProximityBasedGEDeliveryInfoHard> ProximityEffectBuckets; // 0x08(0x10)
	struct TArray<struct FFortAbilitySetDeliveryInfo> PawnPersistentAbilitySetBuckets; // 0x18(0x10)
	struct TArray<struct FFortAbilitySetHandle> PersistentlyAppliedAbilitySets; // 0x28(0x10)
	char bEnabled : 1; // 0x38(0x01)
	char bEnabledByDefault : 1; // 0x38(0x01)
	char bHasGEsToApplyOnTouch : 1; // 0x38(0x01)
	char bHasGEsToApplyOnExit : 1; // 0x38(0x01)
	char bHasGEsToApplyOnPulseTimer : 1; // 0x38(0x01)
	char bHasPersistentEffects : 1; // 0x38(0x01)
	char pad_38_6 : 2; // 0x38(0x01)
	char pad_39[0x57]; // 0x39(0x57)
};

// ScriptStruct FortniteGame.FortAbilitySetDeliveryInfo
// Size: 0xa8 (Inherited: 0x00)
struct FFortAbilitySetDeliveryInfo {
	struct FFortDeliveryInfoRequirementsFilter DeliveryRequirements; // 0x00(0x98)
	struct TArray<struct TSoftObjectPtr<struct UFortAbilitySet>> AbilitySets; // 0x98(0x10)
};

// ScriptStruct FortniteGame.FortDeliveryInfoRequirementsFilter
// Size: 0x98 (Inherited: 0x00)
struct FFortDeliveryInfoRequirementsFilter {
	struct FGameplayTagRequirements SourceTagRequirements; // 0x00(0x40)
	struct FGameplayTagRequirements TargetTagRequirements; // 0x40(0x40)
	enum class EFortTeamAffiliation ApplicableTeamAffiliation; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	char bConsiderTeamAffiliationToInstigator : 1; // 0x84(0x01)
	char pad_84_1 : 7; // 0x84(0x01)
	char pad_85[0x3]; // 0x85(0x03)
	enum class EFortTeam ApplicableTeam; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	char bConsiderTeam : 1; // 0x8c(0x01)
	char bApplyToPlayerPawns : 1; // 0x8c(0x01)
	char bApplyToAIPawns : 1; // 0x8c(0x01)
	char bApplyToBuildingActors : 1; // 0x8c(0x01)
	char pad_8C_4 : 4; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	enum class EFortDeliveryInfoBuildingActorSpecification BuildingActorSpecification; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	char bApplyToGlobalEnvironmentAbilityActor : 1; // 0x94(0x01)
	char pad_94_1 : 7; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
};

// ScriptStruct FortniteGame.ProximityBasedGEDeliveryInfoBase
// Size: 0xa8 (Inherited: 0x00)
struct FProximityBasedGEDeliveryInfoBase {
	char pad_0[0x8]; // 0x00(0x08)
	struct FFortDeliveryInfoRequirementsFilter DeliveryRequirements; // 0x08(0x98)
	enum class EFortProximityBasedGEApplicationType ProximityApplicationType; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// ScriptStruct FortniteGame.ProximityBasedGEDeliveryInfoHard
// Size: 0xb8 (Inherited: 0xa8)
struct FProximityBasedGEDeliveryInfoHard : FProximityBasedGEDeliveryInfoBase {
	struct TArray<struct FGameplayEffectApplicationInfoHard> EffectsToApply; // 0xa8(0x10)
};

// ScriptStruct FortniteGame.GameplayEffectApplicationInfoHard
// Size: 0x10 (Inherited: 0x00)
struct FGameplayEffectApplicationInfoHard {
	struct UGameplayEffect* GameplayEffect; // 0x00(0x08)
	float Level; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.TeamRoles
// Size: 0x02 (Inherited: 0x00)
struct FTeamRoles {
	char PusherTeam; // 0x00(0x01)
	char DefenderTeam; // 0x01(0x01)
};

// ScriptStruct FortniteGame.FortReplayFXState
// Size: 0x10 (Inherited: 0x00)
struct FFortReplayFXState {
	int32_t DefaultParticleLODBias; // 0x00(0x04)
	int32_t DefaultDepthOfFieldQuality; // 0x04(0x04)
	int32_t OverrideParticleLODBias; // 0x08(0x04)
	int32_t OverrideDepthOfFieldQuality; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.NotificationUISettings
// Size: 0x08 (Inherited: 0x00)
struct FNotificationUISettings {
	float DisplayTime; // 0x00(0x04)
	bool bShouldOverrideVisibilitySettings; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct FortniteGame.WeaponSeatDefinition
// Size: 0x40 (Inherited: 0x00)
struct FWeaponSeatDefinition {
	int32_t SeatIndex; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UFortWeaponItemDefinition* VehicleWeapon; // 0x08(0x08)
	struct TArray<struct FActionDefForUI> WeaponActionDefForUI; // 0x10(0x10)
	struct UFortWeaponItemDefinition* VehicleWeaponOverride; // 0x20(0x08)
	struct UFortWeaponItemDefinition* LastEquippedVehicleWeapon; // 0x28(0x08)
	char pad_30[0x10]; // 0x30(0x10)
};

// ScriptStruct FortniteGame.ActionDefForUI
// Size: 0x28 (Inherited: 0x00)
struct FActionDefForUI {
	struct FName InputAction; // 0x00(0x08)
	struct FName GamepadInputAction; // 0x08(0x08)
	struct FText ActionLabel; // 0x10(0x18)
};

// ScriptStruct FortniteGame.VehicleWeapon_RetainedData
// Size: 0x0c (Inherited: 0x00)
struct FVehicleWeapon_RetainedData {
	int32_t AmmoInClip; // 0x00(0x04)
	float LastFireTime; // 0x04(0x04)
	bool bHasPrevious; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
};

// ScriptStruct FortniteGame.FortCachedWeaponOverheatData
// Size: 0x18 (Inherited: 0x00)
struct FFortCachedWeaponOverheatData {
	float TimeWeaponWasUnequipped; // 0x00(0x04)
	float OverheatValueAtUneqip; // 0x04(0x04)
	float OverheatValue; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	float TimeOverheatedBegan; // 0x10(0x04)
	float TimeHeatWasLastAdded; // 0x14(0x04)
};

// ScriptStruct FortniteGame.CobaltWidgetRoundData
// Size: 0x28 (Inherited: 0x00)
struct FCobaltWidgetRoundData {
	int8_t RoundNumber; // 0x00(0x01)
	int8_t FirstRound; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct TArray<struct FCobaltWidgetMatchData> CurrentRoundMatches; // 0x08(0x10)
	struct TArray<char> PreviousRoundWinners; // 0x18(0x10)
};

// ScriptStruct FortniteGame.CobaltWidgetMatchData
// Size: 0x18 (Inherited: 0x00)
struct FCobaltWidgetMatchData {
	struct TArray<char> Teams; // 0x00(0x10)
	struct FGameplayTag POITag; // 0x10(0x08)
};

// ScriptStruct FortniteGame.SafeZoneRoute
// Size: 0x108 (Inherited: 0x00)
struct FSafeZoneRoute {
	struct FScalableFloat bIsEnabled; // 0x00(0x28)
	struct FScalableFloat bUsePOIStartLocation; // 0x28(0x28)
	struct FScalableFloat bUsePOINameOverride; // 0x50(0x28)
	struct FText POINameOverride; // 0x78(0x18)
	struct FScalableFloat StartRadius; // 0x90(0x28)
	struct FScalableFloat EndRadius; // 0xb8(0x28)
	struct FGameplayTag StartPOITag; // 0xe0(0x08)
	struct FGameplayTag EndPOITag; // 0xe8(0x08)
	struct FVector StartLocation; // 0xf0(0x0c)
	struct FVector EndLocation; // 0xfc(0x0c)
};

// ScriptStruct FortniteGame.FortMutatorAudioStinger
// Size: 0x10 (Inherited: 0x00)
struct FFortMutatorAudioStinger {
	struct USoundCue* SoundCue; // 0x00(0x08)
	float LoopTimeBeforeFade; // 0x08(0x04)
	float FadeTime; // 0x0c(0x04)
};

// ScriptStruct FortniteGame.UraniumRoundData
// Size: 0x18 (Inherited: 0x00)
struct FUraniumRoundData {
	int8_t CurrentRoundNumber; // 0x00(0x01)
	int8_t CurrentRoundCheckPoint; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct TArray<struct FUraniumSingleRoundInfo> SingleRoundInfos; // 0x08(0x10)
};

// ScriptStruct FortniteGame.UraniumSingleRoundInfo
// Size: 0x30 (Inherited: 0x00)
struct FUraniumSingleRoundInfo {
	char RoundTeamWinner; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FText RoundName; // 0x08(0x18)
	struct USoundBase* RoundSound; // 0x20(0x08)
	int32_t PointsForWinning; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct FortniteGame.UraniumPOIData
// Size: 0x18 (Inherited: 0x00)
struct FUraniumPOIData {
	struct FGameplayTag POITag; // 0x00(0x08)
	struct TWeakObjectPtr<struct AFortCheckPointSplineActor> SplineActor; // 0x08(0x08)
	struct TWeakObjectPtr<struct ACameraActor> CameraActor; // 0x10(0x08)
};

// ScriptStruct FortniteGame.CreativeLoadedLinkData
// Size: 0x150 (Inherited: 0x00)
struct FCreativeLoadedLinkData {
	struct FString CreatorName; // 0x00(0x10)
	struct FString SupportCode; // 0x10(0x10)
	struct FString Mnemonic; // 0x20(0x10)
	enum class EMMSPrivacy Privacy; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	int32_t Version; // 0x34(0x04)
	struct TArray<struct FLocalizedStringPair> LinkTitle; // 0x38(0x10)
	struct FText AltTitle; // 0x48(0x18)
	struct TArray<struct FLocalizedStringPair> LinkTagline; // 0x60(0x10)
	struct TArray<struct FString> DescriptionTags; // 0x70(0x10)
	struct TArray<struct FLocalizedStringPair> IslandIntroduction; // 0x80(0x10)
	struct FString LinkYoutubeId; // 0x90(0x10)
	struct FString ImageUrl; // 0xa0(0x10)
	struct FString IslandType; // 0xb0(0x10)
	struct FString QuestContextTag; // 0xc0(0x10)
	struct FString AccountId; // 0xd0(0x10)
	struct FCreativeIslandMatchmakingSettings MatchmakingSettings; // 0xe0(0x50)
	struct TArray<struct FString> PlaylistOptions; // 0x130(0x10)
	struct FString LinkType; // 0x140(0x10)
};

// ScriptStruct FortniteGame.CreativeIslandMatchmakingSettings
// Size: 0x50 (Inherited: 0x00)
struct FCreativeIslandMatchmakingSettings {
	int32_t MinimumNumberOfPlayers; // 0x00(0x04)
	int32_t MaximumNumberOfPlayers; // 0x04(0x04)
	struct FString MmsType; // 0x08(0x10)
	struct FString MmsPrivacy; // 0x18(0x10)
	struct FString Override_Playlist; // 0x28(0x10)
	int32_t PlayerCount; // 0x38(0x04)
	int32_t NumberOfTeams; // 0x3c(0x04)
	int32_t PlayersPerTeam; // 0x40(0x04)
	bool bAllowJoinInProgress; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	enum class EJoinInProgress JoinInProgressType; // 0x48(0x04)
	char JoinInProgressTeam; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
};

// ScriptStruct FortniteGame.LocalizedStringPair
// Size: 0x20 (Inherited: 0x00)
struct FLocalizedStringPair {
	struct FString Locale; // 0x00(0x10)
	struct FString TextLiteral; // 0x10(0x10)
};

// ScriptStruct FortniteGame.CollisionResponseRestoreState
// Size: 0x02 (Inherited: 0x00)
struct FCollisionResponseRestoreState {
	char OverlapResponse; // 0x00(0x01)
	char BlockingResponse; // 0x01(0x01)
};

// ScriptStruct FortniteGame.HeldObjectMovementReplicatedData
// Size: 0x28 (Inherited: 0x00)
struct FHeldObjectMovementReplicatedData {
	char RepIncrement; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector DetachLocation; // 0x04(0x0c)
	struct FRotator DetachRotation; // 0x10(0x0c)
	struct FVector MovementVelocity; // 0x1c(0x0c)
};

// ScriptStruct FortniteGame.HeldObjectThrownData
// Size: 0x50 (Inherited: 0x00)
struct FHeldObjectThrownData {
	struct FScalableFloat MaxSpeed; // 0x00(0x28)
	struct FScalableFloat GravityScale; // 0x28(0x28)
};

// ScriptStruct FortniteGame.ProjectileHomingData
// Size: 0x3c (Inherited: 0x00)
struct FProjectileHomingData {
	enum class EFortHomingStyle HomingStyle; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float MinTurnSpeed; // 0x04(0x04)
	float MaxTurnSpeed; // 0x08(0x04)
	float RampTimeFromMinToMaxTurnSpeed; // 0x0c(0x04)
	float LockTargetDistanceThreshold; // 0x10(0x04)
	int32_t RandomSeed; // 0x14(0x04)
	struct TWeakObjectPtr<struct AActor> LockedOnTarget; // 0x18(0x08)
	struct FVector LockedOnTargetPosition; // 0x20(0x0c)
	struct FVector TargetOffset; // 0x2c(0x0c)
	bool ResetTurnSpeedTimer; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
};

// ScriptStruct FortniteGame.FortStopSimulatingRepData
// Size: 0x10 (Inherited: 0x00)
struct FFortStopSimulatingRepData {
	char RepIncrement; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector StopLocation; // 0x04(0x0c)
};

// ScriptStruct FortniteGame.FortReplicatedVelocityData
// Size: 0x10 (Inherited: 0x00)
struct FFortReplicatedVelocityData {
	char RepIncrement; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector ReplicatedVelocity; // 0x04(0x0c)
};

// ScriptStruct FortniteGame.ChaseExternalForce
// Size: 0x28 (Inherited: 0x00)
struct FChaseExternalForce {
	float Duration; // 0x00(0x04)
	struct FVector Direction; // 0x04(0x0c)
	float Magnitude; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UCurveFloat* MagnitudeScaleCurve; // 0x18(0x08)
	char pad_20[0x8]; // 0x20(0x08)
};

// ScriptStruct FortniteGame.FortCurieCableSocketIdentifier
// Size: 0x0c (Inherited: 0x00)
struct FFortCurieCableSocketIdentifier {
	struct FGameplayTag Tag; // 0x00(0x08)
	int32_t Index; // 0x08(0x04)
};

// ScriptStruct FortniteGame.FortCurieCableSocket
// Size: 0xe0 (Inherited: 0x00)
struct FFortCurieCableSocket {
	struct FFortCurieCableSocketIdentifier SocketIdentifier; // 0x00(0x0c)
	struct FVector Location; // 0x0c(0x0c)
	struct FFortCurieCableSocketConnection SocketConnection; // 0x18(0x20)
	char bAutoSendSignalOnElementAttachment : 1; // 0x38(0x01)
	char bAutoSendSignalOnElementDetachment : 1; // 0x38(0x01)
	char bAutoRouteToCurieComponentOnReceive : 1; // 0x38(0x01)
	char bAutoCreateElectricLinksOnSend : 1; // 0x38(0x01)
	char pad_38_4 : 4; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct TMap<struct FGameplayTag, float> ReceivedElementToMagnitudeMap; // 0x40(0x50)
	char pad_90[0x50]; // 0x90(0x50)
};

// ScriptStruct FortniteGame.FortCurieCableSocketConnection
// Size: 0x20 (Inherited: 0x00)
struct FFortCurieCableSocketConnection {
	struct AActor* ConnectedActor; // 0x00(0x08)
	struct FFortCurieCableSocketIdentifier ConnectedSocketIdentifier; // 0x08(0x0c)
	char pad_14[0x4]; // 0x14(0x04)
	struct UFortCurieCableSocketComponent* ConnectedSocketComponent; // 0x18(0x08)
};

// ScriptStruct FortniteGame.MinigameScoreEntry
// Size: 0x60 (Inherited: 0x0c)
struct FMinigameScoreEntry : FFastArraySerializerItem {
	char pad_C[0x4]; // 0x0c(0x04)
	struct FUniqueNetIdRepl UniqueId; // 0x10(0x28)
	struct FString PlayerName; // 0x38(0x10)
	float Score; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct FDateTime TimeRecorded; // 0x50(0x08)
	char bHasScore : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
};

// ScriptStruct FortniteGame.RemoteViewRotSnapshotManager
// Size: 0x48 (Inherited: 0x00)
struct FRemoteViewRotSnapshotManager {
	int32_t BufferSize; // 0x00(0x04)
	float TimeDelay; // 0x04(0x04)
	bool bUseVariableTimeDelay; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float VariableTimeDelayMultiplier; // 0x0c(0x04)
	float TimeBeforeDormant; // 0x10(0x04)
	float InterpSpeedWhenNoSample; // 0x14(0x04)
	char pad_18[0x30]; // 0x18(0x30)
};

// ScriptStruct FortniteGame.SavedSpectatorCameras
// Size: 0x10 (Inherited: 0x00)
struct FSavedSpectatorCameras {
	struct TArray<struct FSavedSpectatorCameraShot> Shots; // 0x00(0x10)
};

// ScriptStruct FortniteGame.SavedSpectatorCameraShot
// Size: 0x1d0 (Inherited: 0x00)
struct FSavedSpectatorCameraShot {
	struct FSavedSpectatorCameraState CameraState; // 0x00(0x180)
	bool bIsShotStart; // 0x180(0x01)
	char pad_181[0x3]; // 0x181(0x03)
	float Timestamp; // 0x184(0x04)
	float ShotLength; // 0x188(0x04)
	char pad_18C[0x4]; // 0x18c(0x04)
	struct FString Message; // 0x190(0x10)
	struct FText LocalisedMessage; // 0x1a0(0x18)
	enum class ECameraShotNotificationTypes NotificationType; // 0x1b8(0x01)
	char pad_1B9[0x3]; // 0x1b9(0x03)
	struct FNotificationUISettings MessageUISettings; // 0x1bc(0x08)
	char pad_1C4[0xc]; // 0x1c4(0x0c)
};

// ScriptStruct FortniteGame.SavedSpectatorCameraState
// Size: 0x180 (Inherited: 0x00)
struct FSavedSpectatorCameraState {
	bool bDataIsValid; // 0x00(0x01)
	enum class ESpectatorCameraType CameraType; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct FUniqueNetIdRepl FollowedPlayerUniqueId; // 0x08(0x28)
	struct FCameraFilmbackSettings FilmbackSettings; // 0x30(0x0c)
	struct FCameraLensSettings LensSettings; // 0x3c(0x18)
	char pad_54[0x4]; // 0x54(0x04)
	struct FCameraFocusSettings FocusSettings; // 0x58(0x58)
	float CurrentFocalLength; // 0xb0(0x04)
	float CurrentAperture; // 0xb4(0x04)
	bool bAutoFocus; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	float CurrentFocusDistance; // 0xbc(0x04)
	bool bAutoExposure; // 0xc0(0x01)
	char pad_C1[0x3]; // 0xc1(0x03)
	float ManualExposureBias; // 0xc4(0x04)
	char pad_C8[0x8]; // 0xc8(0x08)
	struct FTransform Transform; // 0xd0(0x30)
	struct FRotator ControlRotation; // 0x100(0x0c)
	float ThirdPersonNormalizedDistance; // 0x10c(0x04)
	enum class EThirdPersonAutoFollowMode ThirdPersonAutoFollowMode; // 0x110(0x01)
	char pad_111[0x3]; // 0x111(0x03)
	float DroneSpeedIndex; // 0x114(0x04)
	float ReplayPlaybackSpeed; // 0x118(0x04)
	bool bNamePlatesEnabled; // 0x11c(0x01)
	bool bPlayerOutlinesEnabled; // 0x11d(0x01)
	bool bThirdPersonCamCollide; // 0x11e(0x01)
	bool bFollowDroneDoTest; // 0x11f(0x01)
	bool bBattleMapIsOnTimelineMode; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct FNamePlateFilter NamePlatesFilter; // 0x128(0x58)
};

// ScriptStruct FortniteGame.NamePlateFilter
// Size: 0x58 (Inherited: 0x00)
struct FNamePlateFilter {
	bool bIsSet; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TSet<struct FUniqueNetIdRepl> NamePlatesToShow; // 0x08(0x50)
};

// ScriptStruct FortniteGame.SavedPlayerSpectatorCameraData
// Size: 0x50 (Inherited: 0x00)
struct FSavedPlayerSpectatorCameraData {
	struct TMap<struct FUniqueNetIdRepl, struct FSavedSpectatorCameraState> PlayerToCameraStateMap; // 0x00(0x50)
};

// ScriptStruct FortniteGame.FortPlayerSurveyAnswer
// Size: 0x20 (Inherited: 0x00)
struct FFortPlayerSurveyAnswer {
	char pad_0[0x20]; // 0x00(0x20)
};

// ScriptStruct FortniteGame.FortPlayerSurveyAnswerContainerChangeEventInfo
// Size: 0x01 (Inherited: 0x00)
struct FFortPlayerSurveyAnswerContainerChangeEventInfo {
	enum class EFortPlayerSurveyAnswerContainerChangeReason Reason; // 0x00(0x01)
};

// ScriptStruct FortniteGame.FortCollectionBookRewards
// Size: 0x68 (Inherited: 0x00)
struct FFortCollectionBookRewards {
	enum class ECollectionBookRewardType RewardType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FName PageId; // 0x04(0x08)
	struct FName SectionId; // 0x0c(0x08)
	int32_t XpRequired; // 0x14(0x04)
	struct FText Description; // 0x18(0x18)
	bool bIsMajorReward; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FFortRewardInfo Rewards; // 0x38(0x30)
};

// ScriptStruct FortniteGame.FortRewardInfo
// Size: 0x30 (Inherited: 0x00)
struct FFortRewardInfo {
	struct TArray<struct FFortSelectableRewardOption> SelectableRewards; // 0x00(0x10)
	struct TArray<struct FFortItemQuantityPair> StandardRewards; // 0x10(0x10)
	struct TArray<struct FFortHiddenRewardQuantityPair> HiddenRewards; // 0x20(0x10)
};

// ScriptStruct FortniteGame.FortHiddenRewardQuantityPair
// Size: 0x0c (Inherited: 0x00)
struct FFortHiddenRewardQuantityPair {
	struct FName TemplateId; // 0x00(0x08)
	int32_t Quantity; // 0x08(0x04)
};

// ScriptStruct FortniteGame.FortSelectableRewardOption
// Size: 0x10 (Inherited: 0x00)
struct FFortSelectableRewardOption {
	struct TArray<struct FFortItemQuantityPair> Rewards; // 0x00(0x10)
};

// ScriptStruct FortniteGame.FortPendingSlottedItemOperation
// Size: 0x18 (Inherited: 0x00)
struct FFortPendingSlottedItemOperation {
	struct FString SlottedItemId; // 0x00(0x10)
	struct FName SlotRowName; // 0x10(0x08)
};

// ScriptStruct FortniteGame.McpVariantReader
// Size: 0x30 (Inherited: 0x00)
struct FMcpVariantReader {
	struct FString Channel; // 0x00(0x10)
	struct FString Active; // 0x10(0x10)
	struct TArray<struct FString> Owned; // 0x20(0x10)
};

// ScriptStruct FortniteGame.FortAthenaLoadoutData
// Size: 0x20 (Inherited: 0x00)
struct FFortAthenaLoadoutData {
	enum class EAthenaCustomizationCategory SlotName; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString ItemToSlot; // 0x08(0x10)
	int32_t IndexWithinSlot; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct FortniteGame.FortQuestObjectiveCompletion
// Size: 0x30 (Inherited: 0x00)
struct FFortQuestObjectiveCompletion {
	struct FString StatName; // 0x00(0x10)
	int32_t Count; // 0x10(0x04)
	int32_t TimestampOffset; // 0x14(0x04)
	char pad_18[0x18]; // 0x18(0x18)
};

// ScriptStruct FortniteGame.FortSubgameClientSettings
// Size: 0x10 (Inherited: 0x00)
struct FFortSubgameClientSettings {
	struct TArray<struct FString> PinnedQuestInstances; // 0x00(0x10)
};

// ScriptStruct FortniteGame.AccountIdAndScore
// Size: 0x20 (Inherited: 0x00)
struct FAccountIdAndScore {
	struct FString AccountId; // 0x00(0x10)
	int32_t TotalScore; // 0x10(0x04)
	int32_t IndividualContribution; // 0x14(0x04)
	bool bCriticalMatchBonus; // 0x18(0x01)
	bool bIsLeecherExempt; // 0x19(0x01)
	char pad_1A[0x6]; // 0x1a(0x06)
};

// ScriptStruct FortniteGame.AccountIdAndMatchEndData
// Size: 0x198 (Inherited: 0x00)
struct FAccountIdAndMatchEndData {
	struct FString AccountId; // 0x00(0x10)
	struct TArray<struct FFortQuestObjectiveCompletion> Advance; // 0x10(0x10)
	struct TArray<struct FFortQuestEarnedBadgeData> EarnedBadgeData; // 0x20(0x10)
	struct TArray<struct FString> EarnedItemCaches; // 0x30(0x10)
	int32_t TotalScore; // 0x40(0x04)
	bool bCriticalMatchBonus; // 0x44(0x01)
	bool bDidLeech; // 0x45(0x01)
	char pad_46[0x2]; // 0x46(0x02)
	int32_t NumMissionPoints; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TArray<struct FString> ShuffledLoadoutUsed; // 0x50(0x10)
	int32_t ShuffledLockerUsedIndex; // 0x60(0x04)
	int32_t TheaterNum; // 0x64(0x04)
	struct FMcpProfileChangeRequest TheaterItemUpdate; // 0x68(0x58)
	int32_t OutpostNum; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct FMcpProfileChangeRequest OutpostItemUpdate; // 0xc8(0x58)
	struct FString OutpostId; // 0x120(0x10)
	struct FFortOutpostCoreInfo OutpostInfo; // 0x130(0x28)
	struct FString DeployableBaseItemId; // 0x158(0x10)
	struct FFortCloudSaveInfo CloudSaveInfo; // 0x168(0x18)
	struct FString LockCode; // 0x180(0x10)
	bool bAbandoning; // 0x190(0x01)
	char pad_191[0x3]; // 0x191(0x03)
	float MissionLeechScaling; // 0x194(0x04)
};

// ScriptStruct FortniteGame.FortCloudSaveInfo
// Size: 0x18 (Inherited: 0x00)
struct FFortCloudSaveInfo {
	int32_t SaveCount; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FFortCloudSaveRecordInfo> SavedRecords; // 0x08(0x10)
};

// ScriptStruct FortniteGame.FortCloudSaveRecordInfo
// Size: 0x18 (Inherited: 0x00)
struct FFortCloudSaveRecordInfo {
	int32_t RecordIndex; // 0x00(0x04)
	int32_t ArchiveNumber; // 0x04(0x04)
	struct FString RecordFilename; // 0x08(0x10)
};

// ScriptStruct FortniteGame.FortOutpostCoreInfo
// Size: 0x28 (Inherited: 0x00)
struct FFortOutpostCoreInfo {
	struct TArray<struct FFortPlacedBuilding> PlacedBuildings; // 0x00(0x10)
	struct TArray<struct FString> AccountsWithEditPermission; // 0x10(0x10)
	uint32_t HighestEnduranceWaveReached; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct FortniteGame.FortPlacedBuilding
// Size: 0x20 (Inherited: 0x00)
struct FFortPlacedBuilding {
	struct FString BuildingTag; // 0x00(0x10)
	struct FString PlacedTag; // 0x10(0x10)
};

// ScriptStruct FortniteGame.FortQuestEarnedBadgeData
// Size: 0x18 (Inherited: 0x00)
struct FFortQuestEarnedBadgeData {
	struct FString TemplateId; // 0x00(0x10)
	int32_t Count; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct FortniteGame.EndZoneScoreAndAwards
// Size: 0x70 (Inherited: 0x00)
struct FEndZoneScoreAndAwards {
	bool bResultsPendingSave; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t TotalScore; // 0x04(0x04)
	bool bCriticalMatchBonus; // 0x08(0x01)
	bool bDidLeech; // 0x09(0x01)
	char pad_A[0x6]; // 0x0a(0x06)
	struct TArray<struct FFortQuestEarnedBadgeData> EarnedBadgeData; // 0x10(0x10)
	struct TArray<struct FString> EarnedItemCaches; // 0x20(0x10)
	int32_t NumMissionPoints; // 0x30(0x04)
	float MissionLeechScaling; // 0x34(0x04)
	char pad_38[0x38]; // 0x38(0x38)
};

// ScriptStruct FortniteGame.FortDialogDescription
// Size: 0x130 (Inherited: 0x00)
struct FFortDialogDescription {
	struct FSlateBrush Icon; // 0x00(0x88)
	struct FText MessageHeader; // 0x88(0x18)
	struct FText MessageBody; // 0xa0(0x18)
	struct FText AcceptButtonText; // 0xb8(0x18)
	struct FText IgnoreButtonText; // 0xd0(0x18)
	struct FText DismissButtonText; // 0xe8(0x18)
	float DisplayTime; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct UUserWidget* AdditionalContent; // 0x108(0x08)
	enum class EFortDialogFeedbackType FeedBackType; // 0x110(0x01)
	bool Dismissable; // 0x111(0x01)
	char pad_112[0x6]; // 0x112(0x06)
	struct UFortNotificationHandler* NotificationHandler; // 0x118(0x08)
	char pad_120[0x10]; // 0x120(0x10)
};

// ScriptStruct FortniteGame.FortEncounterSettings
// Size: 0xb8 (Inherited: 0x00)
struct FFortEncounterSettings {
	struct TArray<enum class EFortEncounterDirection> ForbiddenSpawnDirections; // 0x00(0x10)
	bool bRiftsDestroyPlayerBuiltBuildings; // 0x10(0x01)
	bool bValidateIfPlayerIsAtSpawnLocation; // 0x11(0x01)
	bool bMustFindSpawnPoints; // 0x12(0x01)
	bool bStopIfCantFindSpawnPoint; // 0x13(0x01)
	bool bIgnoreCollisionWhenSpawningAI; // 0x14(0x01)
	bool bTrackCombatParticipation; // 0x15(0x01)
	bool bDisplayThreatVisuals; // 0x16(0x01)
	char pad_17[0x1]; // 0x17(0x01)
	float BurstSpawnThreatVisualsEndDelayOverride; // 0x18(0x04)
	int32_t NumRiftsToUseOverride; // 0x1c(0x04)
	char bUseEQSQueryToFindAISpawnLocations : 1; // 0x20(0x01)
	char bRelevantForTotalAICap : 1; // 0x20(0x01)
	char bEnableRecreateRift : 1; // 0x20(0x01)
	char bRespawnRiftWhenRiftDead : 1; // 0x20(0x01)
	char bRandomiseQueryRiftLocations : 1; // 0x20(0x01)
	char bOverrideEqsFallback : 1; // 0x20(0x01)
	char pad_20_6 : 2; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FEncounterEnvironmentQueryInfo EqsFallbackOverride; // 0x28(0x28)
	float PreSpawnRequeryTime; // 0x50(0x04)
	float SpawnAIIntervalTime; // 0x54(0x04)
	float SpawnRiftIntervalTime; // 0x58(0x04)
	bool bSpawnFirstRiftNoDelay; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	struct UEnvQuery* RiftSelectionQuery; // 0x60(0x08)
	struct UEnvQuery* RiftSlotsEQSQueryOverride; // 0x68(0x08)
	struct TArray<struct AActor*> ScriptedSpawnPoints; // 0x70(0x10)
	struct ABuildingRift* RiftClassOverride; // 0x80(0x08)
	struct TArray<struct AActor*> WorkingScriptedSpawnPoints; // 0x88(0x10)
	int32_t EncounterGroupID; // 0x98(0x04)
	int32_t ZoneIndex; // 0x9c(0x04)
	int32_t DifficultyIndex; // 0xa0(0x04)
	float AIDespawnDistanceOverride; // 0xa4(0x04)
	struct TArray<struct UFortDifficultyOptionCategoryEncounter*> InjectedOverrideCategories; // 0xa8(0x10)
};

// ScriptStruct FortniteGame.EncounterEnvironmentQueryInfo
// Size: 0x28 (Inherited: 0x00)
struct FEncounterEnvironmentQueryInfo {
	struct UEnvQuery* EnvironmentQuery; // 0x00(0x08)
	struct TArray<struct FEnvNamedValue> QueryParams; // 0x08(0x10)
	char pad_18[0x8]; // 0x18(0x08)
	bool bIsDirectional; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
};

// ScriptStruct FortniteGame.FortStatManagerTag
// Size: 0x08 (Inherited: 0x08)
struct FFortStatManagerTag : FGameplayTag {
};

// ScriptStruct FortniteGame.FortVehicleInPersistent
// Size: 0x138 (Inherited: 0x00)
struct FFortVehicleInPersistent {
	char pad_0[0x8]; // 0x00(0x08)
	struct UFortPhysicsVehicleConfigs* FortPhysicsVehicleConfigs; // 0x08(0x08)
	char bUseForceHeading : 1; // 0x10(0x01)
	char pad_10_1 : 7; // 0x10(0x01)
	char pad_11[0xf]; // 0x11(0x0f)
	char pad_20_0 : 2; // 0x20(0x01)
	char bHasDriver : 1; // 0x20(0x01)
	char bHasPassengers : 1; // 0x20(0x01)
	char bIsTouchingAnything : 1; // 0x20(0x01)
	char bAttemptAsyncOrientationCorrection : 1; // 0x20(0x01)
	char pad_20_6 : 2; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float WaterLevel; // 0x24(0x04)
	struct FVector LocalFrontFrictionPt; // 0x28(0x0c)
	struct FVector LocalRearFrictionPt; // 0x34(0x0c)
	float FrontMassRatio; // 0x40(0x04)
	float RearMassRatio; // 0x44(0x04)
	struct FReplicatedAthenaVehicleAttributes VehicleAttributes; // 0x48(0x1c)
	char pad_64[0xd4]; // 0x64(0xd4)
};

// ScriptStruct FortniteGame.ReplicatedAthenaVehicleAttributes
// Size: 0x1c (Inherited: 0x00)
struct FReplicatedAthenaVehicleAttributes {
	float FrontLateralFrictionScale; // 0x00(0x04)
	float RearLateralFrictionScale; // 0x04(0x04)
	float BrakeForceTractionScale; // 0x08(0x04)
	float ForwardForceTractionScale; // 0x0c(0x04)
	float SlopeAntigravityScale; // 0x10(0x04)
	float TopSpeedScale; // 0x14(0x04)
	float VehicleGravityScale; // 0x18(0x04)
};

// ScriptStruct FortniteGame.FortVehicleOutContinuous
// Size: 0x28 (Inherited: 0x00)
struct FFortVehicleOutContinuous {
	char pad_0[0x8]; // 0x00(0x08)
	float SteeringAngle; // 0x08(0x04)
	struct FVector AverageSpringNormal; // 0x0c(0x0c)
	char pad_18[0x10]; // 0x18(0x10)
};

// ScriptStruct FortniteGame.FortVehicleOutPersistent
// Size: 0x10 (Inherited: 0x00)
struct FFortVehicleOutPersistent {
	char pad_0[0x8]; // 0x00(0x08)
	char bCanDriveOnIncline : 1; // 0x08(0x01)
	char bWheelsOnGround : 1; // 0x08(0x01)
	char bAnyWheelsOnGround : 1; // 0x08(0x01)
	char bIsTouchingDrivableGround : 1; // 0x08(0x01)
	char bIsAsyncCorrectingOrientation : 1; // 0x08(0x01)
	char bIsTouchingGroundWithoutWheels : 1; // 0x08(0x01)
	char pad_8_6 : 2; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct FortniteGame.FortVehicleInternalPersistent
// Size: 0x50 (Inherited: 0x00)
struct FFortVehicleInternalPersistent {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct FortniteGame.SpecialActorRepData
// Size: 0x230 (Inherited: 0x0c)
struct FSpecialActorRepData : FFastArraySerializerItem {
	struct FName SpecialActorID; // 0x0c(0x08)
	struct FGameplayTag CategoryTag; // 0x14(0x08)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct AActor* SpecialActor; // 0x20(0x08)
	struct APlayerState* PlayerState; // 0x28(0x08)
	float ReplicationInterval; // 0x30(0x04)
	float ReplicationIntervalDeviation; // 0x34(0x04)
	float NextReplicationTime; // 0x38(0x04)
	float LastActorNotRelevantTime; // 0x3c(0x04)
	bool bActorIsRelevant; // 0x40(0x01)
	bool bWasActorRelevantLastUpdate; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	struct FVector CurrentLocation; // 0x44(0x0c)
	float CurrentYaw; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct FSlateBrush MainIconBrush; // 0x58(0x88)
	struct FVector2D MinimapScale; // 0xe0(0x08)
	struct FSlateBrush CompassIconBrush; // 0xe8(0x88)
	struct FVector2D CompassScale; // 0x170(0x08)
	bool bDrawCompassIcon; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	float CurrentHealth; // 0x17c(0x04)
	float MaxHealth; // 0x180(0x04)
	float CurrentShield; // 0x184(0x04)
	float MaxShield; // 0x188(0x04)
	char pad_18C[0x4]; // 0x18c(0x04)
	struct FText DisplayName; // 0x190(0x18)
	float RenderDistance; // 0x1a8(0x04)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct FGameplayTagContainer RenderTags; // 0x1b0(0x20)
	float AddedToClientTime; // 0x1d0(0x04)
	char pad_1D4[0x4]; // 0x1d4(0x04)
	struct TArray<struct FSpecialActorSingleStatData> TrackedStats; // 0x1d8(0x10)
	float LastLocationReplicationTime; // 0x1e8(0x04)
	float PrevLocationReplicatedTime; // 0x1ec(0x04)
	struct FVector_NetQuantize100 LastRepLocation; // 0x1f0(0x0c)
	struct FVector_NetQuantize100 PrevRepLocation; // 0x1fc(0x0c)
	struct FVector LerpStartLocation; // 0x208(0x0c)
	float LastYawReplicationTime; // 0x214(0x04)
	float PrevYawReplicatedTime; // 0x218(0x04)
