// Class FortniteEngineLoadingScreen.FortniteUserInterfaceSettings
// Size: 0x588 (Inherited: 0x38)
struct UFortniteUserInterfaceSettings : UDeveloperSettings {
	struct FRuntimeFloatCurve WidthScaleCurve; // 0x38(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve; // 0xc0(0x88)
	struct FRuntimeFloatCurve WidthScaleCurve_iOS_InGame; // 0x148(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve_iOS_InGame; // 0x1d0(0x88)
	struct FRuntimeFloatCurve WidthScaleCurve_iOS_FrontEnd; // 0x258(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve_iOS_FrontEnd; // 0x2e0(0x88)
	struct FRuntimeFloatCurve WidthScaleCurve_Android_InGame; // 0x368(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve_Android_InGame; // 0x3f0(0x88)
	struct FRuntimeFloatCurve WidthScaleCurve_Android_FrontEnd; // 0x478(0x88)
	struct FRuntimeFloatCurve HeightScaleCurve_Android_FrontEnd; // 0x500(0x88)
};

