// AnimBlueprintGeneratedClass Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C
// Size: 0x1972 (Inherited: 0x520)
struct UFortnite_Base_Head_Export_Skeleton_AnimBP_C : UHeadPartAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x520(0x08)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x528(0xc0)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x5e8(0x1d8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7c0(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x840(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x908(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xa60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xa88(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xab0(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xc08(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xc50(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xd10(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xe68(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xe90(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xeb8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xfc0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xfe0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1000(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1158(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1180(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1220(0x28)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x1248(0xa0)
	struct FFortAnimNode_ScaleCharacterBones FortAnimGraphNode_ScaleCharacterBones; // 0x12e8(0x40)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1328(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x1358(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1408(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1430(0x28)
	struct FAnimNode_LiveLinkPose AnimGraphNode_LiveLinkPose_2; // 0x1458(0x50)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x14a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1600(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1628(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x16e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1710(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1738(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1760(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1810(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1838(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x18d8(0x28)
	struct FAnimNode_LiveLinkPose AnimGraphNode_LiveLinkPose; // 0x1900(0x50)
	struct USkeletalMeshComponent* MeshToCopy; // 0x1950(0x08)
	bool GetPlayerListUsesCustomCharacterParts; // 0x1958(0x01)
	bool bIsMoving; // 0x1959(0x01)
	bool bIsOnGround_1; // 0x195a(0x01)
	bool bIsSlopeSliding_1; // 0x195b(0x01)
	bool bIsFallingLocal; // 0x195c(0x01)
	bool bIsJumpingLocal; // 0x195d(0x01)
	bool bIsCrouching_1; // 0x195e(0x01)
	bool bIsCrouchWalking; // 0x195f(0x01)
	bool bIsCrouchSprinting_1; // 0x1960(0x01)
	bool bIsSprinting_1; // 0x1961(0x01)
	bool bIsJogging_1; // 0x1962(0x01)
	bool bIsDBNO_1; // 0x1963(0x01)
	bool bIsTargeting_1; // 0x1964(0x01)
	bool bIsDancing; // 0x1965(0x01)
	bool bIsMeleeSwing_1; // 0x1966(0x01)
	bool bIsLocomotion_1; // 0x1967(0x01)
	bool bRecentlyFired_1; // 0x1968(0x01)
	char pad_1969[0x3]; // 0x1969(0x03)
	float LastFireTime; // 0x196c(0x04)
	bool IsSkydiving0; // 0x1970(0x01)
	bool IsDive0; // 0x1971(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void BlueprintInitializeAnimation(); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP(int32_t EntryPoint); // Function Fortnite_Base_Head_Export_Skeleton_AnimBP.Fortnite_Base_Head_Export_Skeleton_AnimBP_C.ExecuteUbergraph_Fortnite_Base_Head_Export_Skeleton_AnimBP // (Final|UbergraphFunction) // @ game+0xda7c34
};

