// Class FortniteUI.FortUIGameFeatureAction
// Size: 0x28 (Inherited: 0x28)
struct UFortUIGameFeatureAction : UGameFeatureAction {
};

// Class FortniteUI.FortHoldableButton
// Size: 0xc50 (Inherited: 0xbd0)
struct UFortHoldableButton : UCommonButtonBase {
	bool bIsHoldableButton; // 0xbd0(0x01)
	bool bIgnoreLongPress; // 0xbd1(0x01)
	char pad_BD2[0x2]; // 0xbd2(0x02)
	float HoldTime; // 0xbd4(0x04)
	float StartingHoldPercentage; // 0xbd8(0x04)
	float QualifyingHoldTime; // 0xbdc(0x04)
	bool bHoldCancelledFromMovement; // 0xbe0(0x01)
	char pad_BE1[0x6f]; // 0xbe1(0x6f)

	void BP_OnPressed(); // Function FortniteUI.FortHoldableButton.BP_OnPressed // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHoldStarted(float HoldPercentage, bool bInUseSecondaryHoldAnimation); // Function FortniteUI.FortHoldableButton.BP_OnHoldStarted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHoldReset(); // Function FortniteUI.FortHoldableButton.BP_OnHoldReset // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHoldIncreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnHoldIncreased // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHoldEnded(float HoldPercentage, bool bInUseSecondaryHoldAnimation); // Function FortniteUI.FortHoldableButton.BP_OnHoldEnded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHoldDecreased(float HoldPercentage); // Function FortniteUI.FortHoldableButton.BP_OnHoldDecreased // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHoldCompleted(); // Function FortniteUI.FortHoldableButton.BP_OnHoldCompleted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.FortActivatablePanel
// Size: 0x490 (Inherited: 0x458)
struct UFortActivatablePanel : UCommonActivatablePanelLegacy {
	char pad_458[0x8]; // 0x458(0x08)
	bool bIsPushedOnToContentPanelStack; // 0x460(0x01)
	bool bIsAlreadyOnContentPanelStack; // 0x461(0x01)
	enum class EInputPriority InputPriority; // 0x462(0x01)
	bool bIsClosableByPlayerInput; // 0x463(0x01)
	struct FPrimaryContentSetup PrimaryContentSetup; // 0x464(0x01)
	char pad_465[0x2b]; // 0x465(0x2b)

	void RestoreScrollWidget(struct UWidget* FallbackWidget); // Function FortniteUI.FortActivatablePanel.RestoreScrollWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x6a48300
	void RestoreCenterWidget(struct UWidget* FallbackWidget); // Function FortniteUI.FortActivatablePanel.RestoreCenterWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x6a48264
	void AsyncPlaySound2D(struct UObject* WorldContextObject, struct TSoftObjectPtr<struct USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime); // Function FortniteUI.FortActivatablePanel.AsyncPlaySound2D // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x6a46f90
};

// Class FortniteUI.FortItemPreviewScreen
// Size: 0x5b0 (Inherited: 0x490)
struct UFortItemPreviewScreen : UFortActivatablePanel {
	char pad_490[0x10]; // 0x490(0x10)
	struct FDataTableRowHandle ItemViewUnifiedSupportsCameraControlInputAction; // 0x4a0(0x10)
	struct FDataTableRowHandle ItemViewUnifiedZoomInputAction; // 0x4b0(0x10)
	struct FDataTableRowHandle ItemViewZoomOutInputAction; // 0x4c0(0x10)
	struct FDataTableRowHandle ItemViewZoomInInputAction; // 0x4d0(0x10)
	struct FDataTableRowHandle ItemViewRotateInputAction; // 0x4e0(0x10)
	struct UWidgetAnimation* AnimationToHideItemInfo; // 0x4f0(0x08)
	bool bAutoShowDetails; // 0x4f8(0x01)
	bool bItemDetailsHidden; // 0x4f9(0x01)
	char pad_4FA[0x2]; // 0x4fa(0x02)
	float HideItemInfoHeaderDurationSecs; // 0x4fc(0x04)
	char pad_500[0x8]; // 0x500(0x08)
	bool bAllowItemRotation; // 0x508(0x01)
	bool bAllowItemZooming; // 0x509(0x01)
	enum class EFrontEndCamera FrontEndCamera; // 0x50a(0x01)
	char pad_50B[0x1]; // 0x50b(0x01)
	struct FGameplayTag PreviewSceneChangerTag; // 0x50c(0x08)
	char pad_514[0x4]; // 0x514(0x04)
	struct AFortItemPreviewSceneChanger* PreviewSceneChanger; // 0x518(0x08)
	struct UFortItemView* ItemViewObject; // 0x520(0x08)
	float CameraEntryTransitionDuration; // 0x528(0x04)
	char pad_52C[0x4]; // 0x52c(0x04)
	struct UCurveFloat* CameraEntryTransitionCurve; // 0x530(0x08)
	char pad_538[0x60]; // 0x538(0x60)
	struct UWidget* Widget_CameraFrame; // 0x598(0x08)
	struct UCommonButtonLegacy* Button_PreviewAction; // 0x5a0(0x08)
	struct UCommonActivatableWidget* OverrideFocusWidget; // 0x5a8(0x08)

	void ShowItemDetails(); // Function FortniteUI.FortItemPreviewScreen.ShowItemDetails // (Final|Native|Public|BlueprintCallable) // @ game+0x6a83c98
	void OnPreviewActionButtonUpdated(struct FText RowDisplayName); // Function FortniteUI.FortItemPreviewScreen.OnPreviewActionButtonUpdated // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void HideItemDetails(); // Function FortniteUI.FortItemPreviewScreen.HideItemDetails // (Final|Native|Public|BlueprintCallable) // @ game+0x6a82910
};

// Class FortniteUI.BattlePassScreenBase
// Size: 0x7c8 (Inherited: 0x5b0)
struct UBattlePassScreenBase : UFortItemPreviewScreen {
	struct FDataTableRowHandle RefundGiftToken; // 0x5b0(0x10)
	char pad_5C0[0x8]; // 0x5c0(0x08)
	SoftClassProperty SeasonLevelPurchaseScreenClass; // 0x5c8(0x28)
	SoftClassProperty SeasonAboutScreenClass; // 0x5f0(0x28)
	struct FGameplayTagContainer WrapPreviewExcludedTags; // 0x618(0x20)
	enum class EBattlePassView CurrentView; // 0x638(0x01)
	char pad_639[0x7]; // 0x639(0x07)
	struct UAthenaSeasonItemDefinition* SeasonData; // 0x640(0x08)
	struct AFortItemPreviewWorld* CachedVaultWorld; // 0x648(0x08)
	struct UFortAccountItemDefinition* CurrentDisplayedItem; // 0x650(0x08)
	char pad_658[0x90]; // 0x658(0x90)
	struct UFortAccountItemDefinition* LastViewedItem; // 0x6e8(0x08)
	struct UAthenaCosmeticItemDefinition* CyclingCosmeticItem; // 0x6f0(0x08)
	struct UFortItemDefinition* CyclingItem; // 0x6f8(0x08)
	char pad_700[0xc8]; // 0x700(0xc8)

	bool ShouldPlayBPVideo(bool bAllowUpdate); // Function FortniteUI.BattlePassScreenBase.ShouldPlayBPVideo // (Final|Native|Public|BlueprintCallable) // @ game+0x6a3deec
	void OnWatchVideo(); // Function FortniteUI.BattlePassScreenBase.OnWatchVideo // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnViewReward(struct FFortRarityItemData Rarity, bool bNoReward, struct UFortItemDefinition* RewardItem); // Function FortniteUI.BattlePassScreenBase.OnViewReward // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnVariantUpdate(int32_t CurrentIndex, int32_t TotalNumVariants); // Function FortniteUI.BattlePassScreenBase.OnVariantUpdate // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnSetPurchasedAnnualPass(bool bIsPurchased); // Function FortniteUI.BattlePassScreenBase.OnSetPurchasedAnnualPass // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnSetDifferentBPText(); // Function FortniteUI.BattlePassScreenBase.OnSetDifferentBPText // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnRequestViewRewardComplete(); // Function FortniteUI.BattlePassScreenBase.OnRequestViewRewardComplete // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnRequestViewReward(); // Function FortniteUI.BattlePassScreenBase.OnRequestViewReward // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnNoCurrentSeason(); // Function FortniteUI.BattlePassScreenBase.OnNoCurrentSeason // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnBattlePassViewChanged(enum class EBattlePassView NewView); // Function FortniteUI.BattlePassScreenBase.OnBattlePassViewChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	int32_t GetNumberOfRewardsToPurchase(); // Function FortniteUI.BattlePassScreenBase.GetNumberOfRewardsToPurchase // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a3dc84
};

// Class FortniteUI.FortHUDElementWidget
// Size: 0x2c8 (Inherited: 0x288)
struct UFortHUDElementWidget : UCommonUserWidget {
	char pad_288[0x8]; // 0x288(0x08)
	struct FGameplayTag ElementTag; // 0x290(0x08)
	struct FGameplayTagContainer HUDElementTag; // 0x298(0x20)
	enum class ESlateVisibility HiddenVisibility; // 0x2b8(0x01)
	char pad_2B9[0x7]; // 0x2b9(0x07)
	struct UTutorialHighlight* TutorialHighlight; // 0x2c0(0x08)

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility); // Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer HiddenHUDElementTags); // Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged // (Native|Protected|HasOutParms) // @ game+0x6a727d4
};

// Class FortniteUI.FortActorIndicatorWidget
// Size: 0x300 (Inherited: 0x2c8)
struct UFortActorIndicatorWidget : UFortHUDElementWidget {
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct AActor* IndicatedActor; // 0x2d0(0x08)
	struct UPrimitiveComponent* IndicatedActorComponent; // 0x2d8(0x08)
	struct FVector RelativeLocation; // 0x2e0(0x0c)
	float MaxDistance; // 0x2ec(0x04)
	bool bClampOnScreen; // 0x2f0(0x01)
	bool bShowClampToScreenArrow; // 0x2f1(0x01)
	bool bUseScreenSpacePosition; // 0x2f2(0x01)
	char pad_2F3[0x1]; // 0x2f3(0x01)
	struct FVector2D ScreenSpaceRelativeOffset; // 0x2f4(0x08)
	int32_t ScreenPriority; // 0x2fc(0x04)

	void SetIndicatedActor(struct AActor* NewIndicatorActor); // Function FortniteUI.FortActorIndicatorWidget.SetIndicatedActor // (Native|Public|BlueprintCallable) // @ game+0xee9b10
	bool IsIndicatingActor(struct AActor* OtherActor); // Function FortniteUI.FortActorIndicatorWidget.IsIndicatingActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a49a98
};

// Class FortniteUI.FortRadialSlot
// Size: 0xc70 (Inherited: 0xc20)
struct UFortRadialSlot : UCommonButtonLegacy {
	char pad_C20[0x10]; // 0xc20(0x10)
	struct UCommonLazyImage* Image_Icon; // 0xc30(0x08)
	struct UCommonTextBlock* Text_Main; // 0xc38(0x08)
	struct UWidget* Overlay_EquippedItem; // 0xc40(0x08)
	struct TSoftObjectPtr<struct UTexture2D> LockedTexture; // 0xc48(0x28)
};

// Class FortniteUI.FortRadialPickerEntry
// Size: 0xc70 (Inherited: 0xc70)
struct UFortRadialPickerEntry : UFortRadialSlot {

	void OnAvailabilityChanged(bool bIsAvailable); // Function FortniteUI.FortRadialPickerEntry.OnAvailabilityChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaQuickBarSlotButtonBase
// Size: 0xbe0 (Inherited: 0xbd0)
struct UAthenaQuickBarSlotButtonBase : UCommonButtonBase {
	enum class EFortQuickBars QuickbarIndex; // 0xbd0(0x01)
	char pad_BD1[0x3]; // 0xbd1(0x03)
	int32_t SlotIndex; // 0xbd4(0x04)
	struct UAthenaItemIcon* ItemIcon; // 0xbd8(0x08)

	void OnSlottedItemChanged(struct UFortItem* SlottedItem); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnSlottedItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnOwnerDeactivated(); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnOwnerDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnOwnerActivated(); // Function FortniteUI.AthenaQuickBarSlotButtonBase.OnOwnerActivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleQuickbarContentsChanged(enum class EFortQuickBars InQuickBarIndex, struct TArray<int32_t> ChangedSlots); // Function FortniteUI.AthenaQuickBarSlotButtonBase.HandleQuickbarContentsChanged // (Final|Native|Private|HasOutParms) // @ game+0x6a317d8
	void HandleInventoryItemSelected(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaQuickBarSlotButtonBase.HandleInventoryItemSelected // (Final|Native|Private) // @ game+0x6a31718
};

// Class FortniteUI.AthenaQuickBarSlotExtensionWidgetBase
// Size: 0x288 (Inherited: 0x288)
struct UAthenaQuickBarSlotExtensionWidgetBase : UCommonUserWidget {

	void OnOwnerUnhovered(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerUnhovered // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnOwnerSelected(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerSelected // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnOwnerHovered(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerHovered // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnOwnerDeselected(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerDeselected // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnOwnerDeactivated(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnOwnerActivated(); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnOwnerActivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemChanged(struct UFortItem* Item); // Function FortniteUI.AthenaQuickBarSlotExtensionWidgetBase.OnItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.FortWeaponReticleExtensionWidgetBase
// Size: 0x298 (Inherited: 0x288)
struct UFortWeaponReticleExtensionWidgetBase : UCommonUserWidget {
	struct AFortWeapon* CachedAssociatedWeapon; // 0x288(0x08)
	char pad_290[0x8]; // 0x290(0x08)

	void OnWeaponSingleFire(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponSingleFire // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponReloadStarted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnWeaponReloadCancelled(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnWeaponReloadCancelled // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnTargetingChanged(bool bIsADS); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.OnTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleOnTargetingChanged(bool bNewIsADS); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleOnTargetingChanged // (Native|Protected) // @ game+0x2ed2a60
	void HandleFullyExitVehicle(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleFullyExitVehicle // (Final|Native|Private) // @ game+0x3db7810
	void HandleEnterVehiclePassenger(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleEnterVehiclePassenger // (Final|Native|Private) // @ game+0x51c8fec
	void HandleEnterVehicleDriver(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.HandleEnterVehicleDriver // (Final|Native|Private) // @ game+0x3db7858
	bool GetIsADS(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.GetIsADS // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x2ed2a40
	struct AFortWeapon* GetEquippedWeapon(); // Function FortniteUI.FortWeaponReticleExtensionWidgetBase.GetEquippedWeapon // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6acbbb8
};

// Class FortniteUI.FortAthenaVehicleDashboardWidget
// Size: 0x348 (Inherited: 0x2c8)
struct UFortAthenaVehicleDashboardWidget : UFortHUDElementWidget {
	char pad_2C8[0xc]; // 0x2c8(0x0c)
	bool bIsWidgetShowing; // 0x2d4(0x01)
	char pad_2D5[0x3]; // 0x2d5(0x03)
	struct AFortAthenaVehicle* CurrentVehicleActor; // 0x2d8(0x08)
	float CurrentSpeed; // 0x2e0(0x04)
	float TargetFuelPercent; // 0x2e4(0x04)
	float DisplayedFuelPercent; // 0x2e8(0x04)
	float FillBlendSpeed; // 0x2ec(0x04)
	float SpeedTextMaxInterpolationRate; // 0x2f0(0x04)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	struct FGameplayTagContainer WidgetTagsToHideWhenVisible; // 0x2f8(0x20)
	char pad_318[0x4]; // 0x318(0x04)
	float HUDTopSpeed; // 0x31c(0x04)
	enum class EHorizontalAlignment MobileFuelGaugeHorizontalAlignment; // 0x320(0x01)
	enum class EVerticalAlignment MobileFuelGaugeVerticalAlignment; // 0x321(0x01)
	char pad_322[0x2]; // 0x322(0x02)
	struct FMargin MobileFuelGaugePadding; // 0x324(0x10)
	char pad_334[0x4]; // 0x334(0x04)
	struct UCommonNumericTextBlock* NumericText_Speed; // 0x338(0x08)
	struct UOverlay* Overlay_Gauge; // 0x340(0x08)

	void UpdateSpeedometer(float NormalizedSpeed); // Function FortniteUI.FortAthenaVehicleDashboardWidget.UpdateSpeedometer // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void ShowNoFuelMessage(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.ShowNoFuelMessage // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel); // Function FortniteUI.FortAthenaVehicleDashboardWidget.SetVehicleHasInfiniteFuel // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void SetupVehicleFuelWidget(struct AActor* NewVehicle, bool bRequestShowWidget); // Function FortniteUI.FortAthenaVehicleDashboardWidget.SetupVehicleFuelWidget // (Native|Public) // @ game+0x6a4eb8c
	void OnWidgetVisibilityChanged(bool bNewVisibility); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnWidgetVisibilityChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnUpdateBoostChargePercent(float BoostPercent); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnUpdateBoostChargePercent // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnOutOfFuel(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnOutOfFuel // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnLowFuel(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnLowFuel // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnFuelValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnBoostStarted(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostStarted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnBoostFinished(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostFinished // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnBoostChargeFilled(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnBoostChargeFilled // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnAddedFuel(float NewFuelPercent); // Function FortniteUI.FortAthenaVehicleDashboardWidget.OnAddedFuel // (Final|Native|Public) // @ game+0x6a4e4a0
	struct AFortAthenaVehicle* GetVehicle(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.GetVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x5243888
	float GetHUDTopSpeed(); // Function FortniteUI.FortAthenaVehicleDashboardWidget.GetHUDTopSpeed // (Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a4e314
};

// Class FortniteUI.HUDWidgetBehavior
// Size: 0xb0 (Inherited: 0x28)
struct UHUDWidgetBehavior : UObject {
	struct FText HUDLayoutToolName; // 0x28(0x18)
	struct TArray<struct UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents; // 0x40(0x10)
	struct TMap<struct FGameplayTag, struct FString> CustomPropertyDefaultOverrides; // 0x50(0x50)
	struct TArray<struct UFortMobileHUDWidgetBehaviorExtension*> BehaviorExtensions; // 0xa0(0x10)
};

// Class FortniteUI.FortMobileActionButtonBehavior
// Size: 0x108 (Inherited: 0xb0)
struct UFortMobileActionButtonBehavior : UHUDWidgetBehavior {
	struct TArray<struct FName> ActionNames; // 0xb0(0x10)
	struct UPaperSprite* Sprite; // 0xc0(0x08)
	struct FGameplayTag HUDLayoutToolSaveTag_Legacy; // 0xc8(0x08)
	char pad_D0[0x10]; // 0xd0(0x10)
	struct TArray<struct UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents; // 0xe0(0x10)
	char pad_F0[0x10]; // 0xf0(0x10)
	int32_t ForcedZOrder; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
};

// Class FortniteUI.FortMobileHUDElement
// Size: 0x2f0 (Inherited: 0x2c8)
struct UFortMobileHUDElement : UFortHUDElementWidget {
	struct FGameplayTag SizePropertyTag; // 0x2c8(0x08)
	char pad_2D0[0x10]; // 0x2d0(0x10)
	int32_t ForcedZOrder; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct UScaleBox* ScaleBox_HUDWidgetScale; // 0x2e8(0x08)
};

// Class FortniteUI.BacchusHUDElement
// Size: 0x310 (Inherited: 0x2f0)
struct UBacchusHUDElement : UFortMobileHUDElement {
	bool bHideWhenNotUsingTouch; // 0x2f0(0x01)
	bool bUpdatesWithHUDState; // 0x2f1(0x01)
	bool bAlwaysShow; // 0x2f2(0x01)
	enum class EBacchusHUDStateType OnInBuildMode; // 0x2f3(0x01)
	enum class EBacchusHUDStateType OnInCombatMode; // 0x2f4(0x01)
	enum class EBacchusHUDStateType OnInEditMode; // 0x2f5(0x01)
	enum class EBacchusHUDStateType OnInCreativeMode; // 0x2f6(0x01)
	enum class EBacchusHUDStateType OnInBattleLabMode; // 0x2f7(0x01)
	enum class EBacchusHUDStateType IsFreeFalling; // 0x2f8(0x01)
	enum class EBacchusHUDStateType IsGliding; // 0x2f9(0x01)
	enum class EBacchusHUDStateType CanOpenChute; // 0x2fa(0x01)
	enum class EBacchusHUDStateType InLockedBus; // 0x2fb(0x01)
	enum class EBacchusHUDStateType InUnlockedBus; // 0x2fc(0x01)
	enum class EBacchusHUDStateType OnTargeting; // 0x2fd(0x01)
	enum class EBacchusHUDStateType OnUsingScopeTargeting; // 0x2fe(0x01)
	enum class EBacchusHUDStateType OnCanTarget; // 0x2ff(0x01)
	enum class EBacchusHUDStateType OnCanUseScopeTargeting; // 0x300(0x01)
	enum class EBacchusHUDStateType OnCrouching; // 0x301(0x01)
	enum class EBacchusHUDStateType OnCanUseSecondaryAbility; // 0x302(0x01)
	enum class EBacchusHUDStateType OnDBNO; // 0x303(0x01)
	enum class EBacchusHUDStateType OnCarryingDBNO; // 0x304(0x01)
	enum class EBacchusHUDStateType OnCarryingHeldObject; // 0x305(0x01)
	enum class EBacchusHUDStateType OnControllingRCPawn; // 0x306(0x01)
	enum class EBacchusHUDStateType OnInVehicle; // 0x307(0x01)
	enum class EBacchusHUDStateType OnDrivingVehicle; // 0x308(0x01)
	enum class EBacchusHUDStateType OnZiplining; // 0x309(0x01)
	char pad_30A[0x6]; // 0x30a(0x06)

	void ShowHighlight(bool Show); // Function FortniteUI.BacchusHUDElement.ShowHighlight // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnHUDStateUpdate(struct FFortHUDState NewState); // Function FortniteUI.BacchusHUDElement.OnHUDStateUpdate // (Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x6a3c6fc
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType); // Function FortniteUI.BacchusHUDElement.HandleInputMethodChanged // (Final|Native|Protected) // @ game+0x6a3c3d4
};

// Class FortniteUI.BacchusButton
// Size: 0x388 (Inherited: 0x310)
struct UBacchusButton : UBacchusHUDElement {
	struct UPaperSprite* DefaultIcon; // 0x310(0x08)
	struct FLinearColor PressedColor; // 0x318(0x10)
	struct FLinearColor UnpressedColor; // 0x328(0x10)
	enum class EButtonClickMethod ClickMethod; // 0x338(0x01)
	enum class EButtonTouchMethod TouchMethod; // 0x339(0x01)
	char pad_33A[0x2]; // 0x33a(0x02)
	float ButtonSize; // 0x33c(0x04)
	float ButtonDisplayScale; // 0x340(0x04)
	bool ShowRadialProgress; // 0x344(0x01)
	char pad_345[0x3]; // 0x345(0x03)
	struct FGameplayTag ListenedGamePlayTag; // 0x348(0x08)
	struct UImage* Image_Background; // 0x350(0x08)
	char pad_358[0x8]; // 0x358(0x08)
	struct USizeBox* SizeBox_ButtonSize; // 0x360(0x08)
	struct USizeBox* SizeBox_ImageSize; // 0x368(0x08)
	struct UImage* Image_Icon; // 0x370(0x08)
	struct URadialBacchusButtonBase* RadialButton_ButtonCooldown; // 0x378(0x08)
	struct UButton* Button_InternalButton; // 0x380(0x08)

	void SetIconPressed(bool bIsPressed); // Function FortniteUI.BacchusButton.SetIconPressed // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a3cf00
	void SetDefaultIcon(struct UPaperSprite* Icon); // Function FortniteUI.BacchusButton.SetDefaultIcon // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a3ce6c
	void SetButtonSprite(struct UPaperSprite* NewSprite); // Function FortniteUI.BacchusButton.SetButtonSprite // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x51f1d78
	void SetButtonSize(float NewButtonSize); // Function FortniteUI.BacchusButton.SetButtonSize // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x6a3cdc8
	void SetButtonDisplayScale(float NewDisplayScale); // Function FortniteUI.BacchusButton.SetButtonDisplayScale // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x6a3cd24
	void OnClicked(); // Function FortniteUI.BacchusButton.OnClicked // (Native|Event|Protected|BlueprintEvent) // @ game+0x51c526c
	void HandleCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.BacchusButton.HandleCursorModeChanged // (Final|Native|Private) // @ game+0x6a3bf54
};

// Class FortniteUI.BacchusActionButton
// Size: 0x3d0 (Inherited: 0x388)
struct UBacchusActionButton : UBacchusButton {
	struct TArray<struct FBacchusActionIconMapping> ActionMapping; // 0x388(0x10)
	struct FName TempActionMapping; // 0x398(0x08)
	struct TArray<struct FGameplayTag> ItemsAllowingClickThrough; // 0x3a0(0x10)
	bool bCapturesInput; // 0x3b0(0x01)
	char pad_3B1[0x1f]; // 0x3b1(0x1f)

	void OnCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.BacchusActionButton.OnCursorModeChanged // (Final|Native|Protected) // @ game+0x270f1b0
	void AddActionMappings(struct TArray<struct FBacchusActionIconMapping> NewActionMappings); // Function FortniteUI.BacchusActionButton.AddActionMappings // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a3bd9c
};

// Class FortniteUI.LTMWidgetBase
// Size: 0x320 (Inherited: 0x2c8)
struct ULTMWidgetBase : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)
	struct AFortGameplayMutator* MutatorClassToWaitFor; // 0x308(0x08)
	struct AFortGameplayMutator* CachedGameplayMutator; // 0x310(0x08)
	char pad_318[0x1]; // 0x318(0x01)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x319(0x02)
	char pad_31B[0x5]; // 0x31b(0x05)

	void SetPlayerPortrait(struct AFortPlayerStateAthena* Player, struct UFortLazyImage* PortraitImage); // Function FortniteUI.LTMWidgetBase.SetPlayerPortrait // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x3dd1950
	void OnStompFailed(); // Function FortniteUI.LTMWidgetBase.OnStompFailed // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnStompedByOtherWidget(); // Function FortniteUI.LTMWidgetBase.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnMutatorAvailable_BP(struct AFortGameplayMutator* MutatorActor); // Function FortniteUI.LTMWidgetBase.OnMutatorAvailable_BP // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnHandleSpectatingChanged(struct AFortPlayerStateZone* SpectatingTarget); // Function FortniteUI.LTMWidgetBase.OnHandleSpectatingChanged // (Native|Protected) // @ game+0x51dd05c
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase); // Function FortniteUI.LTMWidgetBase.OnGamePhaseChanged // (Native|Protected) // @ game+0x51dd4b4
	void K2_OnBecomeInactive(); // Function FortniteUI.LTMWidgetBase.K2_OnBecomeInactive // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void K2_OnBecomeActive(); // Function FortniteUI.LTMWidgetBase.K2_OnBecomeActive // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	bool K2_HasActiveContent(); // Function FortniteUI.LTMWidgetBase.K2_HasActiveContent // (Event|Protected|BlueprintEvent|Const) // @ game+0xda7c34
	char GetViewingTeam(); // Function FortniteUI.LTMWidgetBase.GetViewingTeam // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ad0644
	struct AFortPlayerStateAthena* GetViewingPlayerState(); // Function FortniteUI.LTMWidgetBase.GetViewingPlayerState // (Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ad061c
};

// Class FortniteUI.AthenaAboutModal
// Size: 0x468 (Inherited: 0x320)
struct UAthenaAboutModal : UCommonActivatableWidget {
	struct FMulticastInlineDelegate BP_OnAboutModalClosed; // 0x320(0x10)
	bool bForceShowPage; // 0x330(0x01)
	char pad_331[0x7]; // 0x331(0x07)
	struct FText Title; // 0x338(0x18)
	struct TArray<struct FText> Entries; // 0x350(0x10)
	struct TSoftObjectPtr<struct UObject> HeroImage; // 0x360(0x28)
	struct FString BPSTrailerVideoUID; // 0x388(0x10)
	struct FString BPSHowToVideoUID; // 0x398(0x10)
	SoftClassProperty SeasonMovieWidgetClass; // 0x3a8(0x28)
	struct UFortStreamMediaSource* VideoStream_Source; // 0x3d0(0x08)
	struct UScrollBox* ScrollBox_Content; // 0x3d8(0x08)
	struct UFortLazyImage* Image_Item; // 0x3e0(0x08)
	struct UCommonButtonLegacy* Button_Close; // 0x3e8(0x08)
	struct UCommonButtonLegacy* Button_Close_Mobile; // 0x3f0(0x08)
	struct UCommonButtonLegacy* Button_BPSTrailer; // 0x3f8(0x08)
	struct UCommonButtonLegacy* Button_BPSTrailer_Mobile; // 0x400(0x08)
	struct UCommonButtonLegacy* Button_BPSHowTo; // 0x408(0x08)
	struct UCommonButtonLegacy* Button_BPSHowTo_Mobile; // 0x410(0x08)
	char pad_418[0x50]; // 0x418(0x50)

	void OnSetContent(struct FText InTitle, struct TArray<struct FText> InEntries); // Function FortniteUI.AthenaAboutModal.OnSetContent // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnAboutModalClosedDynamic__DelegateSignature(); // DelegateFunction FortniteUI.AthenaAboutModal.OnAboutModalClosedDynamic__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void CloseModal(); // Function FortniteUI.AthenaAboutModal.CloseModal // (Final|Native|Protected|BlueprintCallable) // @ game+0x2ed20a0
};

// Class FortniteUI.AlternativeCarryPickupButton
// Size: 0x3d8 (Inherited: 0x3d0)
struct UAlternativeCarryPickupButton : UBacchusActionButton {
	char pad_3D0[0x8]; // 0x3d0(0x08)
};

// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
// Size: 0x480 (Inherited: 0x460)
struct UAthenaLoadingScreenPreviewPanelBase : UAthenaLoadingScreenPreviewPanel {
	struct UNativeWidgetHost* LoadingScreenSlot; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)
	struct UCommonButtonLegacy* Button_Close; // 0x470(0x08)
	struct UCommonButtonLegacy* Button_CloseMobile; // 0x478(0x08)
};

// Class FortniteUI.ApolloIntroLoadingPanel
// Size: 0x488 (Inherited: 0x480)
struct UApolloIntroLoadingPanel : UAthenaLoadingScreenPreviewPanelBase {
	struct UFortPlaylistAthena* ApolloIntroPlaylist; // 0x480(0x08)
};

// Class FortniteUI.ApolloIntroShimBase
// Size: 0x260 (Inherited: 0x260)
struct UApolloIntroShimBase : UUserWidget {

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase); // Function FortniteUI.ApolloIntroShimBase.HandleGamePhaseChanged // (Final|Native|Private) // @ game+0x6a1a354
};

// Class FortniteUI.AshtonWidgetBase
// Size: 0x338 (Inherited: 0x320)
struct UAshtonWidgetBase : ULTMWidgetBase {
	struct AFortAthenaMutator_Ashton* AshtonMutatorRef; // 0x320(0x08)
	char pad_328[0x10]; // 0x328(0x10)

	void UpdateAllUI(bool bFirstUpdate); // Function FortniteUI.AshtonWidgetBase.UpdateAllUI // (Final|Native|Protected) // @ game+0x6a1b9e0
	void OnVillainRespawnsRemainingChanged(); // Function FortniteUI.AshtonWidgetBase.OnVillainRespawnsRemainingChanged // (Final|Native|Protected) // @ game+0x6a1b398
	void OnVillainRespawnCountChanged(int32_t NumRespawnsLeft, float RespawnPercentLeft); // Function FortniteUI.AshtonWidgetBase.OnVillainRespawnCountChanged // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnStoneListChanged(); // Function FortniteUI.AshtonWidgetBase.OnStoneListChanged // (Final|Native|Protected) // @ game+0x6a1b384
	void OnStoneChanged(enum class EAshtonStoneType StoneType, enum class EAshtonStoneStateType StoneState); // Function FortniteUI.AshtonWidgetBase.OnStoneChanged // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnOpenWidget(); // Function FortniteUI.AshtonWidgetBase.OnOpenWidget // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnCloseWidget(); // Function FortniteUI.AshtonWidgetBase.OnCloseWidget // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
// Size: 0x50 (Inherited: 0x30)
struct UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate Finished; // 0x30(0x10)
	struct UFortPlayerSurveyDispatcher* Dispatcher; // 0x40(0x08)
	char pad_48[0x8]; // 0x48(0x08)

	void OnAllSurveysFinishedDelegate__DelegateSignature(); // DelegateFunction FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.OnAllSurveysFinishedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void HandleAllSurveysFinished(struct UObject* Source); // Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.HandleAllSurveysFinished // (Final|Native|Private) // @ game+0x6a1a048
	struct UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* DisplaySurveys(struct UFortPlayerSurveyDispatcher* Dispatcher, int32_t SurveyCount); // Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.DisplaySurveys // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x6a19a58
};

// Class FortniteUI.AthenaAccoladeWrapper
// Size: 0x48 (Inherited: 0x28)
struct UAthenaAccoladeWrapper : UObject {
	struct FAthenaAccolades AccoladeData; // 0x28(0x20)
};

// Class FortniteUI.AthenaAccoladeListEntryWidget
// Size: 0x290 (Inherited: 0x288)
struct UAthenaAccoladeListEntryWidget : UCommonUserWidget {
	char pad_288[0x8]; // 0x288(0x08)

	void SetTitle(struct FText TitleText); // Function FortniteUI.AthenaAccoladeListEntryWidget.SetTitle // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void SetSource(struct FText SourceText); // Function FortniteUI.AthenaAccoladeListEntryWidget.SetSource // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void SetIcon(struct UFortAccoladeItemDefinition* ItemDef); // Function FortniteUI.AthenaAccoladeListEntryWidget.SetIcon // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void SetCount(int32_t Count); // Function FortniteUI.AthenaAccoladeListEntryWidget.SetCount // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaAccoladeListWidget
// Size: 0x370 (Inherited: 0x370)
struct UAthenaAccoladeListWidget : UCommonListView {

	void PopulateWidget(); // Function FortniteUI.AthenaAccoladeListWidget.PopulateWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1b5f8
};

// Class FortniteUI.AthenaAccoladesWidget
// Size: 0x348 (Inherited: 0x2c8)
struct UAthenaAccoladesWidget : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)
	struct TArray<struct FXPUIEvent> XPEvents; // 0x308(0x10)
	struct FXPUIEvent CurrentEvent; // 0x318(0x28)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x340(0x02)
	char pad_342[0x6]; // 0x342(0x06)

	void OpenWidget(struct UFortAccoladeItemDefinition* AccoladeDef, int32_t XpValue, struct FText DisplayName); // Function FortniteUI.AthenaAccoladesWidget.OpenWidget // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x6a1b470
	void OnXpEvent(struct FXPUIEvent XPEvent); // Function FortniteUI.AthenaAccoladesWidget.OnXpEvent // (Final|Native|Protected|HasOutParms) // @ game+0x6a1b3ac
	void OnStompedByOtherWidget(); // Function FortniteUI.AthenaAccoladesWidget.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	bool HasMoreXPEvents(); // Function FortniteUI.AthenaAccoladesWidget.HasMoreXPEvents // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1b2f8
	void ForwardEvent(); // Function FortniteUI.AthenaAccoladesWidget.ForwardEvent // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a19b90
	void EventAdded(); // Function FortniteUI.AthenaAccoladesWidget.EventAdded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void CloseWidget(); // Function FortniteUI.AthenaAccoladesWidget.CloseWidget // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x3db7810
};

// Class FortniteUI.AthenaAccountContext
// Size: 0x30 (Inherited: 0x30)
struct UAthenaAccountContext : UBlueprintContextBase {

	void SimulateBattleBookPurchase(int32_t NumLevelsToPurchase, int32_t BonusLevelsGranted, bool bOverLimit); // Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a1b83c
	bool ShouldReplaceBattleStarsWithAlternateReward(); // Function FortniteUI.AthenaAccountContext.ShouldReplaceBattleStarsWithAlternateReward // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1b7ac
	bool IsAtMaxBattlePassTier(); // Function FortniteUI.AthenaAccountContext.IsAtMaxBattlePassTier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1b314
	struct FText GetCurrentSeasonNumberAsText(bool bFullText); // Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumberAsText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a19f24
	int32_t GetCurrentSeasonNumber(); // Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a19ed4
	struct UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition(); // Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition // (Final|Native|Public|BlueprintCallable) // @ game+0x6a19e90
	struct FText GetCurrentChapterNumberAsText(bool bFullText); // Function FortniteUI.AthenaAccountContext.GetCurrentChapterNumberAsText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a19d70
	struct FText GetCurrentChapterAndSeasonText(); // Function FortniteUI.AthenaAccountContext.GetCurrentChapterAndSeasonText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a19ca8
	void GetBattleBookPurchaseLimit(int32_t MaxNumLevelsPossibleToPurchase, int32_t BonusLevelsGranted); // Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a19ba4
};

// Class FortniteUI.AthenaChatModalWrapper
// Size: 0x328 (Inherited: 0x320)
struct UAthenaChatModalWrapper : UCommonActivatableWidget {
	struct UFortChatContainer* ChatContainer_Chat; // 0x320(0x08)
};

// Class FortniteUI.AthenaActivatableChatWidget
// Size: 0x340 (Inherited: 0x320)
struct UAthenaActivatableChatWidget : UCommonActivatableWidget {
	struct UAthenaChatModalWrapper* Activatable_ModalBindings; // 0x320(0x08)
	struct UCommonButtonLegacy* Button_HoldToOpen; // 0x328(0x08)
	struct UDataTable* InputActionDataTable; // 0x330(0x08)
	char pad_338[0x8]; // 0x338(0x08)

	void FocusChat(bool bFocus); // Function FortniteUI.AthenaActivatableChatWidget.FocusChat // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void BacchusFrontendFocusChat(); // Function FortniteUI.AthenaActivatableChatWidget.BacchusFrontendFocusChat // (Final|Native|Public|BlueprintCallable) // @ game+0x6a19a10
};

// Class FortniteUI.AthenaAerialFeedback
// Size: 0x318 (Inherited: 0x2c8)
struct UAthenaAerialFeedback : UFortHUDElementWidget {
	struct FGameplayTagContainer GliderRedeployTags; // 0x2c8(0x20)
	struct FGameplayTag AirbagDeployTag; // 0x2e8(0x08)
	struct UFortItemDefinition* AirbagItemDefinition; // 0x2f0(0x08)
	struct UFortKeybindWidget* KeyBind; // 0x2f8(0x08)
	struct UCommonTextBlock* Text_Feedback; // 0x300(0x08)
	char pad_308[0x10]; // 0x308(0x10)

	void HandleSkydiveLeaderChanged(bool bEnabled, bool bLocal, struct AFortPlayerState* LeaderPlayerState); // Function FortniteUI.AthenaAerialFeedback.HandleSkydiveLeaderChanged // (Final|Native|Private) // @ game+0x6a1a8e4
	void HandleKeybindsChanged(); // Function FortniteUI.AthenaAerialFeedback.HandleKeybindsChanged // (Final|Native|Private) // @ game+0x6a1a57c
	void HandleBalloonMovementChanged(bool bUsingBalloonMovement); // Function FortniteUI.AthenaAerialFeedback.HandleBalloonMovementChanged // (Final|Native|Private) // @ game+0x6a1a0e4
	void BP_HandleTextChanged(); // Function FortniteUI.AthenaAerialFeedback.BP_HandleTextChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaAIKillsBase
// Size: 0x2e0 (Inherited: 0x2c8)
struct UAthenaAIKillsBase : UFortHUDElementWidget {
	struct UTextBlock* KillsText; // 0x2c8(0x08)
	struct UObject* KillsSource; // 0x2d0(0x08)
	bool bCustomKillSource; // 0x2d8(0x01)
	char pad_2D9[0x7]; // 0x2d9(0x07)

	void SetKillsSourcePlayerState(struct AFortPlayerStateAthena* InPlayerState); // Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1b710
	void SetKillsSourcePlayerController(struct AFortPlayerControllerAthena* InPlayerController); // Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1b710
};

// Class FortniteUI.AthenaAvailableSquadSlotsListBase
// Size: 0x2e8 (Inherited: 0x2c8)
struct UAthenaAvailableSquadSlotsListBase : UFortHUDElementWidget {
	int32_t MaxNumberOfAvailableSquadSlots; // 0x2c8(0x04)
	bool bAlwaysDisplayTopEntryAsDetailed; // 0x2cc(0x01)
	char pad_2CD[0xb]; // 0x2cd(0x0b)
	struct UDynamicEntryBox* EntryBox_AvailableSlotsList; // 0x2d8(0x08)
	struct UAthenaPlayerViewModel* CachedPlayerVM; // 0x2e0(0x08)

	void UpdateSquadFromMinigameOptionChange(); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateSquadFromMinigameOptionChange // (Final|Native|Private) // @ game+0x6a1c0a0
	void UpdateIsTeamMiniGameOnMinigameVolumeChanged(struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateIsTeamMiniGameOnMinigameVolumeChanged // (Final|Native|Private) // @ game+0x6a1bb64
	void UpdateIsTeamMiniGameOnGameStateChanged(struct AFortMinigame* Minigame, enum class EFortMinigameState MinigameState); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.UpdateIsTeamMiniGameOnGameStateChanged // (Final|Native|Private) // @ game+0x6a1ba7c
	void HandleSquadMemberDisconnected(struct AFortPlayerStateAthena* Player); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandleSquadMemberDisconnected // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandlePlayerUniqueIdReplicated(struct FUniqueNetIdRepl UniqueId); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerUniqueIdReplicated // (Final|Native|Private|HasOutParms) // @ game+0x6a1a760
	void HandlePlayerExitVolume(struct APlayerState* ClientPlayerState, struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerExitVolume // (Final|Native|Private) // @ game+0x6a1a678
	void HandlePlayerEnterVolume(struct APlayerState* ClientPlayerState, struct AFortVolume* Volume); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandlePlayerEnterVolume // (Final|Native|Private) // @ game+0x6a1a590
	void HandleGameMemberChanged(char InSquadId, char InTeamIndex, struct AFortPlayerStateAthena* ChangedPS); // Function FortniteUI.AthenaAvailableSquadSlotsListBase.HandleGameMemberChanged // (Final|Native|Private) // @ game+0x6a1a214
};

// Class FortniteUI.AthenaAvailableSquadSlotsListEntryBase
// Size: 0x2d0 (Inherited: 0x2c8)
struct UAthenaAvailableSquadSlotsListEntryBase : UFortHUDElementWidget {
	enum class EAvailableSquadSlotsListEntryState CurrentEntryState; // 0x2c8(0x01)
	char pad_2C9[0x7]; // 0x2c9(0x07)

	void BP_OnEntryStateUpdated(enum class EAvailableSquadSlotsListEntryState NewEntryState); // Function FortniteUI.AthenaAvailableSquadSlotsListEntryBase.BP_OnEntryStateUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaAwardAlertBase
// Size: 0x268 (Inherited: 0x260)
struct UAthenaAwardAlertBase : UUserWidget {
	struct UAthenaPlayerViewModel* PlayerVM; // 0x260(0x08)

	void SetDataSource(struct UAthenaPlayerViewModel* PlayerViewModel); // Function FortniteUI.AthenaAwardAlertBase.SetDataSource // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1b60c
	void OnAwardGranted(struct UFortAwardItemDefinition* AwardDefinition); // Function FortniteUI.AthenaAwardAlertBase.OnAwardGranted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaBattleMapClickHandler
// Size: 0x268 (Inherited: 0x260)
struct UAthenaBattleMapClickHandler : UUserWidget {
	char pad_260[0x8]; // 0x260(0x08)

	void HandleToggledBattleMapLive(struct ABattleMapPawnLive* BattleMapPawn); // Function FortniteUI.AthenaBattleMapClickHandler.HandleToggledBattleMapLive // (Final|Native|Protected) // @ game+0x6a1adc8
};

// Class FortniteUI.AthenaBattleMapNodeTooltip
// Size: 0x2c8 (Inherited: 0x288)
struct UAthenaBattleMapNodeTooltip : UCommonUserWidget {
	struct UCommonTextBlock* TextBlock_NodeTitle; // 0x288(0x08)
	struct UCommonTextBlock* TextBlock_NodeDescription; // 0x290(0x08)
	struct UCommonTextBlock* TextBlock_NodeTime; // 0x298(0x08)
	struct UWidget* Widget_Selection; // 0x2a0(0x08)
	struct UWidget* Widget_Scrubbing; // 0x2a8(0x08)
	struct UWidget* Widget_ScrubbingGamepad; // 0x2b0(0x08)
	char pad_2B8[0x10]; // 0x2b8(0x10)

	void OnReplayLevelStreamingChanged(bool bStreaming); // Function FortniteUI.AthenaBattleMapNodeTooltip.OnReplayLevelStreamingChanged // (Final|Native|Protected) // @ game+0x182f234
	void HandleUnhoveredNode(struct ABattleMapNode* Node, enum class BattleMapHoveredReason Reason); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleUnhoveredNode // (Final|Native|Protected) // @ game+0x6a1afa0
	void HandleToggledBattleMapLive(struct ABattleMapPawnLive* BattleMapPawn); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleToggledBattleMapLive // (Final|Native|Protected) // @ game+0x6a1ae68
	void HandleTimelineModeChanged(bool bEnabled); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleTimelineModeChanged // (Final|Native|Protected) // @ game+0x6a1ab50
	void HandleInputMethodChanged(enum class ECommonInputType NewInputType); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleInputMethodChanged // (Final|Native|Protected) // @ game+0x6a1a4dc
	void HandleHoveredNode(struct ABattleMapNode* Node, enum class BattleMapHoveredReason Reason); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleHoveredNode // (Final|Native|Protected) // @ game+0x6a1a3f4
	void HandleCameraTypeChanged(struct AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType); // Function FortniteUI.AthenaBattleMapNodeTooltip.HandleCameraTypeChanged // (Final|Native|Protected) // @ game+0x182f490
};

// Class FortniteUI.AthenaBattleMapTimelineWidget
// Size: 0x550 (Inherited: 0x490)
struct UAthenaBattleMapTimelineWidget : UFortActivatablePanel {
	struct UCommonButtonLegacy* Button_Forward; // 0x490(0x08)
	struct UCommonButtonLegacy* Button_Backward; // 0x498(0x08)
	float ForwardButtonPositionAlpha; // 0x4a0(0x04)
	float BackwardButtonPositionAlpha; // 0x4a4(0x04)
	struct FDataTableRowHandle ForwardDataTableRow; // 0x4a8(0x10)
	struct FDataTableRowHandle BackwardDataTableRow; // 0x4b8(0x10)
	struct FDataTableRowHandle StopDataTableRow; // 0x4c8(0x10)
	struct FDataTableRowHandle ScrubToDataTableRow; // 0x4d8(0x10)
	struct FDataTableRowHandle ExitBattleMapDataTableRow; // 0x4e8(0x10)
	struct FDataTableRowHandle ZoomInDataTableRow; // 0x4f8(0x10)
	struct FDataTableRowHandle ZoomOutDataTableRow; // 0x508(0x10)
	char pad_518[0x38]; // 0x518(0x38)

	void OnReplayLevelStreamingChanged(bool bStreaming); // Function FortniteUI.AthenaBattleMapTimelineWidget.OnReplayLevelStreamingChanged // (Final|Native|Private) // @ game+0x182dbf4
	void HandleZoomOutPressed(bool bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomOutPressed // (Final|Native|Private|HasOutParms) // @ game+0x6a1b260
	void HandleZoomOutHeld(float HeldPercent); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomOutHeld // (Final|Native|Private) // @ game+0x6a1b1c0
	void HandleZoomInPressed(bool bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomInPressed // (Final|Native|Private|HasOutParms) // @ game+0x6a1b128
	void HandleZoomInHeld(float HeldPercent); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleZoomInHeld // (Final|Native|Private) // @ game+0x6a1b088
	void HandleToggledBattleMapLive(struct ABattleMapPawnLive* BattleMapPawn); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleToggledBattleMapLive // (Final|Native|Private) // @ game+0x6a1af04
	void HandleTimelineStopPressed(bool bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineStopPressed // (Final|Native|Private|HasOutParms) // @ game+0x6a1ad28
	void HandleTimelineScrubToPressed(bool bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineScrubToPressed // (Final|Native|Private|HasOutParms) // @ game+0x6a1ac88
	void HandleTimelineModeChanged(bool bEnabled); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineModeChanged // (Final|Native|Private) // @ game+0x6a1abec
	void HandleTimelineForwardPressed(bool bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineForwardPressed // (Final|Native|Private|HasOutParms) // @ game+0x6a1aab0
	void HandleTimelineBackwardPressed(bool bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleTimelineBackwardPressed // (Final|Native|Private|HasOutParms) // @ game+0x6a1aa10
	void HandleSelectedNode(struct ABattleMapNode* InSelectedNode); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleSelectedNode // (Final|Native|Private) // @ game+0x6a1a848
	void HandleExitBattleMapPressed(bool bPassThrough); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleExitBattleMapPressed // (Final|Native|Private|HasOutParms) // @ game+0x6a1a180
	void HandleCameraTypeChanged(struct AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType); // Function FortniteUI.AthenaBattleMapTimelineWidget.HandleCameraTypeChanged // (Final|Native|Private) // @ game+0x182f5b4
};

// Class FortniteUI.AthenaBattlePassItemTracker
// Size: 0x298 (Inherited: 0x288)
struct UAthenaBattlePassItemTracker : UCommonUserWidget {
	struct UCommonTextBlock* Text_Category; // 0x288(0x08)
	struct UCommonNumericTextBlock* Text_Counter; // 0x290(0x08)

	void OnInterpStarted(); // Function FortniteUI.AthenaBattlePassItemTracker.OnInterpStarted // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnInterpEnded(struct UCommonNumericTextBlock* NumericTextBlock, bool HadCompleted); // Function FortniteUI.AthenaBattlePassItemTracker.OnInterpEnded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaBattlePassTracker
// Size: 0x388 (Inherited: 0x288)
struct UAthenaBattlePassTracker : UCommonUserWidget {
	char pad_288[0x8]; // 0x288(0x08)
	struct UAthenaPassPurchaseScreen* PassPurchaseScreenClass; // 0x290(0x08)
	struct FText OutfitsText; // 0x298(0x18)
	struct FText VBucksText; // 0x2b0(0x18)
	struct FText EmotesText; // 0x2c8(0x18)
	struct FText MoreRewardsText; // 0x2e0(0x18)
	struct FText BuyBattlePassTextFormat; // 0x2f8(0x18)
	char pad_310[0x40]; // 0x310(0x40)
	struct UAthenaPassPurchaseScreen* PushedPurchaseScreen; // 0x350(0x08)
	struct UCommonRichTextBlock* RichText_PaidItemsCollected; // 0x358(0x08)
	struct UAthenaBattlePassItemTracker* BattlePassItemTracker_01; // 0x360(0x08)
	struct UAthenaBattlePassItemTracker* BattlePassItemTracker_02; // 0x368(0x08)
	struct UAthenaBattlePassItemTracker* BattlePassItemTracker_03; // 0x370(0x08)
	struct UAthenaBattlePassItemTracker* BattlePassItemTracker_04; // 0x378(0x08)
	struct UBattlePassScreenPurchaseButton* Button_PurchaseBattlePass; // 0x380(0x08)

	void HandlePassPurchaseFlowComplete(bool bClosePresentationScreen); // Function FortniteUI.AthenaBattlePassTracker.HandlePassPurchaseFlowComplete // (Final|Native|Private) // @ game+0x6a1c2bc
};

// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
// Size: 0x2f0 (Inherited: 0x2c8)
struct UAthenaBroadcastFollowedPlayerInfoBase : UFortHUDElementWidget {
	struct UAthenaSpectatorPlayerWidgetBase* PlayerWidget; // 0x2c8(0x08)
	struct UAthenaSpectatorHitPointBarBase* HitPointBar_Health; // 0x2d0(0x08)
	struct UAthenaSpectatorHitPointBarBase* HitPointBar_Shield; // 0x2d8(0x08)
	struct UAthenaSpectatorHitPointBarBase* HitPointBar_Vehicle; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)

	void OnVehicleStateChanged(struct AActor* NewVehicle, struct AActor* OldVehicle); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnVehicleStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPipModeChanged(bool bPipModeEnabled); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnPipModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnFollowedPlayerChanged(struct AFortPlayerControllerSpectating* SpectatingPC, struct AFortPlayerState* FollowedPlayerState); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnFollowedPlayerChanged // (Final|Native|Private) // @ game+0x19ef510
	void OnEliminatedStateChanged(struct UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated); // Function FortniteUI.AthenaBroadcastFollowedPlayerInfoBase.OnEliminatedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaGamePhaseWidgetBase
// Size: 0x2e8 (Inherited: 0x2c8)
struct UAthenaGamePhaseWidgetBase : UFortHUDElementWidget {
	struct UMaterialInterface* StormComingFontMaterial; // 0x2c8(0x08)
	float StormComingWarningTime; // 0x2d0(0x04)
	char pad_2D4[0x4]; // 0x2d4(0x04)
	struct UTextBlock* TimeText; // 0x2d8(0x08)
	char pad_2E0[0x8]; // 0x2e0(0x08)

	void OnGameStateSet(struct AFortGameState* InGameState); // Function FortniteUI.AthenaGamePhaseWidgetBase.OnGameStateSet // (Final|Native|Protected) // @ game+0x6a255d8
	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaGamePhaseWidgetBase.OnGamePhaseStepChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleGamePhaseStepChanged(struct TScriptInterface<None> SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaGamePhaseWidgetBase.HandleGamePhaseStepChanged // (Final|Native|Protected|HasOutParms) // @ game+0x1917dbc
	void HandleCountdownUpdate(int32_t TimeRemaining); // Function FortniteUI.AthenaGamePhaseWidgetBase.HandleCountdownUpdate // (Final|Native|Protected) // @ game+0x6a23ac0
};

// Class FortniteUI.AthenaBroadcastGamePhaseWidget
// Size: 0x2f0 (Inherited: 0x2e8)
struct UAthenaBroadcastGamePhaseWidget : UAthenaGamePhaseWidgetBase {
	struct AFortMinigame* MinigameOverride; // 0x2e8(0x08)

	void SetMinigameOverride(struct AFortMinigame* Minigame); // Function FortniteUI.AthenaBroadcastGamePhaseWidget.SetMinigameOverride // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1d19c
};

// Class FortniteUI.FortUIStateWidgetBase
// Size: 0x338 (Inherited: 0x320)
struct UFortUIStateWidgetBase : UCommonActivatableWidget {
	char pad_320[0x10]; // 0x320(0x10)
	struct UCommonActivatableWidgetStack* WidgetStack_PrimaryContent; // 0x330(0x08)
};

// Class FortniteUI.AthenaHUDBase
// Size: 0x4d8 (Inherited: 0x338)
struct UAthenaHUDBase : UFortUIStateWidgetBase {
	struct TArray<struct UUserWidget*> MinigameWidgets; // 0x338(0x10)
	char pad_348[0x18]; // 0x348(0x18)
	struct TArray<struct UFortWeaponReticleExtensionData*> WeaponReticleExtensionDatas; // 0x360(0x10)
	char pad_370[0x10]; // 0x370(0x10)
	struct UOverlay* ScalableOverlay; // 0x380(0x08)
	struct UAthenaMapScreenContainer* MapScreenContainer; // 0x388(0x08)
	struct UAthenaHUDMenu* AthenaHUDMenu; // 0x390(0x08)
	struct UAthenaPlayerTeamKillsBase* AthenaTeamKillsWidget; // 0x398(0x08)
	struct UAthenaSquadListBase* TeamInfo; // 0x3a0(0x08)
	struct UAthenaPlayerHitPointInfo* LocalPlayerHitPointInfo; // 0x3a8(0x08)
	struct UAthenaEquippedItemBase* AthenaEquippedItemWidget; // 0x3b0(0x08)
	struct UAthenaSkydivingInformation* SkydivingInfoWidget; // 0x3b8(0x08)
	struct UWidgetSwitcher* CompassSwitcher; // 0x3c0(0x08)
	struct URetainerBox* RetainerBox_TempFrit; // 0x3c8(0x08)
	struct AFortVolume* CreativeLinkedVolume; // 0x3d0(0x08)
	struct UAthenaIndicatorLayerBase* AthenaIndicatorLayer; // 0x3d8(0x08)
	struct UUserWidget* KairosHUDLayerClass; // 0x3e0(0x08)
	struct TArray<struct FMutatorAddedWidgets> MutatorAddedWidgets; // 0x3e8(0x10)
	struct UInZoneTitleBarBase* InZoneTitleBar; // 0x3f8(0x08)
	char pad_400[0x20]; // 0x400(0x20)
	struct TArray<struct FUIExtension> TournamentUIExtensions; // 0x420(0x10)
	struct TArray<struct FUIExtension> ArenaTournamentUIExtensions; // 0x430(0x10)
	struct UFortWeaponReticleExtensionWidgetBase* CurrentCustomReticleExtension; // 0x440(0x08)
	struct TArray<struct UFortWeaponReticleExtensionWidgetBase*> RecentReticleExtensions; // 0x448(0x10)
	char pad_458[0x8]; // 0x458(0x08)
	SoftClassProperty NewEmotePicker; // 0x460(0x28)
	SoftClassProperty SquadComsPickerClass; // 0x488(0x28)
	SoftClassProperty WeaponWheelClass; // 0x4b0(0x28)

	void UpdateUIExtensions(struct AFortPlayerState* ClientState, struct AFortMinigame* Minigame); // Function FortniteUI.AthenaHUDBase.UpdateUIExtensions // (Final|Native|Protected) // @ game+0x6a26278
	void UpdateCreativePlotLinkedVolume(struct AFortVolume* Volume); // Function FortniteUI.AthenaHUDBase.UpdateCreativePlotLinkedVolume // (Final|Native|Private) // @ game+0x6a26018
	void SetZoneCompleted(bool bValue); // Function FortniteUI.AthenaHUDBase.SetZoneCompleted // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a25f6c
	void SetQuickBarNative(bool bShouldDoQuickBarNative); // Function FortniteUI.AthenaHUDBase.SetQuickBarNative // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void SetFullscreenMapVisibilityNative(bool bIsVisible); // Function FortniteUI.AthenaHUDBase.SetFullscreenMapVisibilityNative // (Native|Protected) // @ game+0x3d9d538
	void PrepareToShowEndGameUI(); // Function FortniteUI.AthenaHUDBase.PrepareToShowEndGameUI // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void PlaylistExtensionWidgetCreatedNotSupported(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.PlaylistExtensionWidgetCreatedNotSupported // (Final|Native|Private|BlueprintCallable) // @ game+0x6a25e4c
	void OnVolumeShowPublishWatermarkChanged(struct AFortVolume* Volume, bool bShowPublishWatermark); // Function FortniteUI.AthenaHUDBase.OnVolumeShowPublishWatermarkChanged // (Final|Native|Private) // @ game+0x6a25a78
	void OnMinigamePlayModeChanged(struct AFortMinigame* Minigame, bool bIsInPlayMode); // Function FortniteUI.AthenaHUDBase.OnMinigamePlayModeChanged // (Final|Native|Protected) // @ game+0x6a2573c
	void OnMinigameHideHUD(bool bLoading); // Function FortniteUI.AthenaHUDBase.OnMinigameHideHUD // (Final|Native|Protected) // @ game+0x6a256a0
	void OnHUDScaleChanged(float HUDScale); // Function FortniteUI.AthenaHUDBase.OnHUDScaleChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase); // Function FortniteUI.AthenaHUDBase.OnGamePhaseChanged // (Final|Native|Private) // @ game+0x276e1f4
	void OnExtensionWidgetRemoved(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.OnExtensionWidgetRemoved // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnExtensionWidgetCreated(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // Function FortniteUI.AthenaHUDBase.OnExtensionWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnDisplayGameOver(); // Function FortniteUI.AthenaHUDBase.OnDisplayGameOver // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	bool HUDOwnsExtensionSlot(enum class EUIExtensionSlot ExtensionSlot); // Function FortniteUI.AthenaHUDBase.HUDOwnsExtensionSlot // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x20374e4
	void HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaHUDBase.HandleWeaponEquipped // (Final|Native|Private) // @ game+0x1598f5c
	void HandleVolumeUnloaded(struct APlayerState* ClientState, struct AFortVolume* Volume); // Function FortniteUI.AthenaHUDBase.HandleVolumeUnloaded // (Final|Native|Protected) // @ game+0x6a250bc
	void HandleVolumeStateChanged(enum class EVolumeState NewState, struct AFortVolume* Volume); // Function FortniteUI.AthenaHUDBase.HandleVolumeStateChanged // (Final|Native|Private) // @ game+0x6a24f5c
	void HandleVolumeLoaded(struct APlayerState* ClientState, struct AFortVolume* Volume); // Function FortniteUI.AthenaHUDBase.HandleVolumeLoaded // (Final|Native|Protected) // @ game+0x6a24d2c
	void HandleUpdateMinigameUIExtensions(struct AFortMinigame* Minigame); // Function FortniteUI.AthenaHUDBase.HandleUpdateMinigameUIExtensions // (Final|Native|Protected) // @ game+0x6a24c90
	void HandlePickerOpenRequest(enum class EFortPickerMode Mode, int32_t InitialOption, bool bIgnoreFirstAccept); // Function FortniteUI.AthenaHUDBase.HandlePickerOpenRequest // (Final|Native|Protected) // @ game+0x6a24788
	void HandleOnUpdateInZoneTitleBarVisibility(bool bNewVisibility); // Function FortniteUI.AthenaHUDBase.HandleOnUpdateInZoneTitleBarVisibility // (Final|Native|Protected) // @ game+0x6a246ec
	void HandleOnMutatorRemoved(struct AFortGameplayMutator* NewMutator); // Function FortniteUI.AthenaHUDBase.HandleOnMutatorRemoved // (Final|Native|Protected) // @ game+0x6a245b4
	void HandleOnMutatorAdded(struct AFortGameplayMutator* NewMutator); // Function FortniteUI.AthenaHUDBase.HandleOnMutatorAdded // (Final|Native|Protected) // @ game+0x6a24518
	void HandleNewPanelFromMutator(struct UUserWidget* PanelClass); // Function FortniteUI.AthenaHUDBase.HandleNewPanelFromMutator // (Final|Native|Protected) // @ game+0x6a24300
	void HandleLocalPlayerDied(struct FFortPlayerDeathReport DeathReport); // Function FortniteUI.AthenaHUDBase.HandleLocalPlayerDied // (Final|Native|Private|HasOutParms) // @ game+0x6a24134
	void HandleExitVolume(struct APlayerState* ClientState, struct AFortVolume* Volume); // Function FortniteUI.AthenaHUDBase.HandleExitVolume // (Final|Native|Private) // @ game+0x6a23cf8
	void HandleEnteredVolume(struct APlayerState* ClientState, struct AFortVolume* Volume); // Function FortniteUI.AthenaHUDBase.HandleEnteredVolume // (Final|Native|Private) // @ game+0x6a23c0c
	void HandleCursorModeChanging(bool bCursorModeEnabled, struct FName ActionName); // Function FortniteUI.AthenaHUDBase.HandleCursorModeChanging // (Final|Native|Protected) // @ game+0x210a614
	void HandleCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CustomWidget); // Function FortniteUI.AthenaHUDBase.HandleCursorModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	bool GetZoneCompleted(); // Function FortniteUI.AthenaHUDBase.GetZoneCompleted // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a23a78
	void ClearUIExtensions(); // Function FortniteUI.AthenaHUDBase.ClearUIExtensions // (Final|Native|Protected) // @ game+0x6a23a50
	void BindVolumeEvents(); // Function FortniteUI.AthenaHUDBase.BindVolumeEvents // (Native|Protected) // @ game+0x51c6398
};

// Class FortniteUI.AthenaBroadcastHUDBase
// Size: 0x650 (Inherited: 0x4d8)
struct UAthenaBroadcastHUDBase : UAthenaHUDBase {
	struct FDataTableRowHandle ToggleMatchStatusActionRowHandle; // 0x4d8(0x10)
	struct FDataTableRowHandle ToggleSquadStatusActionRowHandle; // 0x4e8(0x10)
	struct FDataTableRowHandle ToggleRemainingPlayersActionRowHandle; // 0x4f8(0x10)
	struct FDataTableRowHandle ToggleActiveGridScreenActionRowHandle; // 0x508(0x10)
	struct FDataTableRowHandle ToggleEliminatedGridScreenActionRowHandle; // 0x518(0x10)
	struct FDataTableRowHandle ToggleMatchStatusScreenActionRowHandle; // 0x528(0x10)
	struct FDataTableRowHandle ToggleScoreboardScreenActionRowHandle; // 0x538(0x10)
	struct FDataTableRowHandle ToggleKillFeedActionRowHandle; // 0x548(0x10)
	struct FDataTableRowHandle ToggleActionFeedScreenActionRowHandle; // 0x558(0x10)
	struct FDataTableRowHandle ToggleGotoTimeRowHandle; // 0x568(0x10)
	struct FDataTableRowHandle TogglePipModeActionRowHandle; // 0x578(0x10)
	struct FDataTableRowHandle ToggleFollowedPlayerInfoActionRowHandle; // 0x588(0x10)
	struct FDataTableRowHandle ToggleFullscreenMapActionRowHandle; // 0x598(0x10)
	struct TMap<SoftClassProperty, struct FUIExtension> ExtensionWidgetOverrides; // 0x5a8(0x50)
	struct UAthenaSpectatorHUDControlsBase* BroadcastHUDControls; // 0x5f8(0x08)
	struct UAthenaSpectatorNameplateLayerBase* NameplateLayer; // 0x600(0x08)
	struct UAthenaBroadcastMapPanelBase* AthenaBroadcastMapPanel; // 0x608(0x08)
	struct UCommonWidgetSwitcherLegacy* EventMatchInfoSwitcher; // 0x610(0x08)
	struct UCommonWidgetSwitcherLegacy* Switcher_TopLeft; // 0x618(0x08)
	struct USpacer* TopLeft_Empty; // 0x620(0x08)
	struct UFortBroadcastViewSettings* TopLeft_ViewSettings; // 0x628(0x08)
	struct UAthenaReplayActionFeedScreenBase* TopLeft_ActionFeed; // 0x630(0x08)
	struct UFortReplayGoToTimeDialogue* TopLeft_GoToTime; // 0x638(0x08)
	struct UFortReplayHighlightsWindow* TopLeft_Highlights; // 0x640(0x08)
	char pad_648[0x8]; // 0x648(0x08)

	void TryHandleIfPlayerStateAlreadyInVolume(); // Function FortniteUI.AthenaBroadcastHUDBase.TryHandleIfPlayerStateAlreadyInVolume // (Final|Native|Private) // @ game+0x6a1d234
	void SetFullscreenMapVisibility(bool bIsVisible); // Function FortniteUI.AthenaBroadcastHUDBase.SetFullscreenMapVisibility // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnVolumeMinigameChanged(struct AFortMinigame* Minigame); // Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeMinigameChanged // (Final|Native|Private) // @ game+0x6a1d0ac
	void OnVolumeEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeEndOverlap // (Final|Native|Private) // @ game+0x6a1cf18
	void OnVolumeBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x6a1ccac
	void OnVolumeAdded(struct AFortVolume* Volume); // Function FortniteUI.AthenaBroadcastHUDBase.OnVolumeAdded // (Final|Native|Private) // @ game+0x6a1cac8
	void OnUnableToPerformAction(struct FGameplayTagContainer FailedReason, struct FText FailureText); // Function FortniteUI.AthenaBroadcastHUDBase.OnUnableToPerformAction // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnToggleSquadStatusActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleSquadStatusActionExecuted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnToggleScoreboardScreenActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleScoreboardScreenActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x6a1c998
	void OnToggleRemainingPlayersActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleRemainingPlayersActionExecuted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnTogglePipModeActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnTogglePipModeActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x6a1c908
	void OnToggleMatchStatusScreenActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleMatchStatusScreenActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x6a1c874
	void OnToggleMatchStatusActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleMatchStatusActionExecuted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnToggleKillFeedActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleKillFeedActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x6a1c7e4
	void OnToggleFollowedPlayerInfoActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleFollowedPlayerInfoActionExecuted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnToggleEliminatedGridScreenActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleEliminatedGridScreenActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x6a1c750
	void OnToggleActiveGridScreenActionExecuted(bool bPassThrough); // Function FortniteUI.AthenaBroadcastHUDBase.OnToggleActiveGridScreenActionExecuted // (Final|Native|Private|HasOutParms) // @ game+0x6a1c6bc
	void OnPlaylistDataChanged(struct UFortPlaylistAthena* PlaylistData); // Function FortniteUI.AthenaBroadcastHUDBase.OnPlaylistDataChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerTargetingChanged(bool bIsTargeting); // Function FortniteUI.AthenaBroadcastHUDBase.OnPlayerTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPipModeChanged(bool bEnabled); // Function FortniteUI.AthenaBroadcastHUDBase.OnPipModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnMinigameChanged(struct AFortMinigame* NewMinigame); // Function FortniteUI.AthenaBroadcastHUDBase.OnMinigameChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnIndicatorModeChanged(bool bIndicatorsEnabled); // Function FortniteUI.AthenaBroadcastHUDBase.OnIndicatorModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnHudVisibilityChanged(enum class EHudVisibilityState NewVisibility); // Function FortniteUI.AthenaBroadcastHUDBase.OnHudVisibilityChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnGameStateSet_BP(struct AFortGameStateAthena* GameStateAthena); // Function FortniteUI.AthenaBroadcastHUDBase.OnGameStateSet_BP // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnGameStateSet(struct AFortGameState* NewGameState); // Function FortniteUI.AthenaBroadcastHUDBase.OnGameStateSet // (Final|Native|Private) // @ game+0x6a1c4d8
	void OnCursorModeChanging(bool bCursorModeEnabled, struct FName ActionName); // Function FortniteUI.AthenaBroadcastHUDBase.OnCursorModeChanging // (Final|Native|Protected) // @ game+0x20632e0
	void OnCurrentPlaylistChanged(); // Function FortniteUI.AthenaBroadcastHUDBase.OnCurrentPlaylistChanged // (Final|Native|Private) // @ game+0x6a1c4c4
	void HandleToggleReplayViewSettings(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleReplayViewSettings // (Final|Native|Private) // @ game+0x6a1c4a8
	void HandleToggleHighlightsList(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleHighlightsList // (Final|Native|Private) // @ game+0x6a1c48c
	void HandleToggleGoToTime(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleGoToTime // (Final|Native|Private) // @ game+0x6a1c470
	void HandleToggleActionFeedScreen(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleToggleActionFeedScreen // (Final|Native|Private) // @ game+0x6a1c454
	void HandleSpectatorViewTargetChanged(); // Function FortniteUI.AthenaBroadcastHUDBase.HandleSpectatorViewTargetChanged // (Final|Native|Private) // @ game+0x6a1c358
	void HandleNameplatesEnabledChanged(bool bInNameplatesEnabled); // Function FortniteUI.AthenaBroadcastHUDBase.HandleNameplatesEnabledChanged // (Final|Native|Private) // @ game+0x6a1c220
	void HandleHudVisibilityChanged(enum class EHudVisibilityState NewVisibility); // Function FortniteUI.AthenaBroadcastHUDBase.HandleHudVisibilityChanged // (Final|Native|Private) // @ game+0x246e4b8
	void HandleFollowedPlayerRespawnTimeChanged(float RespawnTime); // Function FortniteUI.AthenaBroadcastHUDBase.HandleFollowedPlayerRespawnTimeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
// Size: 0x308 (Inherited: 0x300)
struct UAthenaBroadcastHUDMenuStatusBase : UFortActorIndicatorWidget {
	float ZOffset; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)

	void MapActivated(); // Function FortniteUI.AthenaBroadcastHUDMenuStatusBase.MapActivated // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void InventoryActivated(); // Function FortniteUI.AthenaBroadcastHUDMenuStatusBase.InventoryActivated // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
// Size: 0x2d8 (Inherited: 0x2c8)
struct UAthenaBroadcastHUDMenuStatusLayerBase : UFortHUDElementWidget {
	struct UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidgetClass; // 0x2c8(0x08)
	char pad_2D0[0x8]; // 0x2d0(0x08)

	void RemoveHUDMenuStatus(struct UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget); // Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.RemoveHUDMenuStatus // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void DeactivateHudMenuWidget(); // Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.DeactivateHudMenuWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a1c1ec
	void AddHUDMenuStatus(struct UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget); // Function FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase.AddHUDMenuStatus // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaBroadcastKillFeedBase
// Size: 0x2f0 (Inherited: 0x2c8)
struct UAthenaBroadcastKillFeedBase : UFortHUDElementWidget {
	struct UFortDynamicEntryBox* KillFeedEntryBox; // 0x2c8(0x08)
	float TimeToShowEntry; // 0x2d0(0x04)
	char pad_2D4[0x1c]; // 0x2d4(0x1c)

	void OnToggleShowKillFeed(bool bShowKillFeed); // Function FortniteUI.AthenaBroadcastKillFeedBase.OnToggleShowKillFeed // (Final|Native|Private) // @ game+0x6a1ca2c
	void OnTimelineScrubbed(); // Function FortniteUI.AthenaBroadcastKillFeedBase.OnTimelineScrubbed // (Final|Native|Private) // @ game+0x6a1c6a8
	void AddKillFeedEntry(struct FAthenaBroadcastKillFeedEntryInfo KillFeedEntryInfo); // Function FortniteUI.AthenaBroadcastKillFeedBase.AddKillFeedEntry // (Final|Native|Private|HasOutParms) // @ game+0x6a1c130
};

// Class FortniteUI.AthenaBroadcastKillFeedItemBase
// Size: 0x3b0 (Inherited: 0x2c8)
struct UAthenaBroadcastKillFeedItemBase : UFortHUDElementWidget {
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct TSoftObjectPtr<struct UMaterialInterface> EliminationIcon; // 0x2d0(0x28)
	struct TSoftObjectPtr<struct UMaterialInterface> StormIcon; // 0x2f8(0x28)
	struct TSoftObjectPtr<struct UMaterialInterface> FallDamageIcon; // 0x320(0x28)
	struct TSoftObjectPtr<struct UMaterialInterface> ExplosionIcon; // 0x348(0x28)
	struct TSoftObjectPtr<struct UMaterialInterface> DbnoIcon; // 0x370(0x28)
	struct UCommonTextBlock* Text_InstigatorName; // 0x398(0x08)
	struct UCommonTextBlock* Text_VictimName; // 0x3a0(0x08)
	struct UImage* Image_EntryIcon; // 0x3a8(0x08)
};

// Class FortniteUI.AthenaBroadcastMapPanelBase
// Size: 0x4d0 (Inherited: 0x490)
struct UAthenaBroadcastMapPanelBase : UFortActivatablePanel {
	struct UAthenaSpectatorMapPlayerListBase* PlayerList; // 0x490(0x08)
	struct UAthenaMapLayer* AthenaMapLayer; // 0x498(0x08)
	struct UCommonWidgetSwitcherLegacy* LhsSwitcher; // 0x4a0(0x08)
	struct UCommonButtonLegacy* Button_CycleSideBar; // 0x4a8(0x08)
	struct FDataTableRowHandle CycleSideBarRowHandle; // 0x4b0(0x10)
	struct UFortBroadcasterMapSettings* MapSettingsClass; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)
};

// Class FortniteUI.AthenaBroadcastMatchStatusWidget
// Size: 0x2d0 (Inherited: 0x2c8)
struct UAthenaBroadcastMatchStatusWidget : UFortHUDElementWidget {
	char pad_2C8[0x8]; // 0x2c8(0x08)

	void OnStormPhaseChanged(int32_t StormPhase); // Function FortniteUI.AthenaBroadcastMatchStatusWidget.OnStormPhaseChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaBroadcastPlayerEventScoreWidget
// Size: 0x2d8 (Inherited: 0x2c8)
struct UAthenaBroadcastPlayerEventScoreWidget : UFortHUDElementWidget {
	struct UCommonTextBlock* PlayerEventScoreText; // 0x2c8(0x08)
	struct UCommonWidgetSwitcherLegacy* PlayerEventScoreSwitcher; // 0x2d0(0x08)

	void OnRemoteClientEventScoreChanged(int32_t NewEventScore); // Function FortniteUI.AthenaBroadcastPlayerEventScoreWidget.OnRemoteClientEventScoreChanged // (Final|Native|Private) // @ game+0x6a1c574
};

// Class FortniteUI.AthenaBroadcastPlayerLocationWidget
// Size: 0x2d0 (Inherited: 0x2c8)
struct UAthenaBroadcastPlayerLocationWidget : UFortHUDElementWidget {
	struct UCommonTextBlock* PlayerLocationText; // 0x2c8(0x08)

	void OnRemoteClientPoiTagIDChanged(int16_t RemoteClientPoiTagID); // Function FortniteUI.AthenaBroadcastPlayerLocationWidget.OnRemoteClientPoiTagIDChanged // (Final|Native|Private) // @ game+0x6a1c60c
};

// Class FortniteUI.AthenaBroadcastSessionId
// Size: 0x2d0 (Inherited: 0x2c8)
struct UAthenaBroadcastSessionId : UFortHUDElementWidget {
	struct UTextBlock* Text_SessionId; // 0x2c8(0x08)
};

// Class FortniteUI.AthenaEventMatchSquadWidgetBase
// Size: 0x2d0 (Inherited: 0x2c8)
struct UAthenaEventMatchSquadWidgetBase : UFortHUDElementWidget {
	struct TWeakObjectPtr<struct UAthenaRemoteSquadViewData> SquadData; // 0x2c8(0x08)

	void SetSquadIdVisible(bool bSquadIdVisible); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.SetSquadIdVisible // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnSquadPlaceChanged(struct UAthenaRemoteSquadViewData* InSquadData, int32_t InSquadPlace); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadPlaceChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnSquadKillscoreChanged(struct UAthenaRemoteSquadViewData* InSquadData, int32_t InSquadKills); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadKillscoreChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnSquadIdChanged(struct UAthenaRemoteSquadViewData* InSquadData, char InSquadId); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadIdChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnSquadColorChanged(struct UAthenaRemoteSquadViewData* InSquadData, struct FLinearColor InSquadColor); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnSquadColorChanged // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerAdded(struct UAthenaRemoteSquadViewData* InSquadData, struct UAthenaRemotePlayerViewData* InPlayerData); // Function FortniteUI.AthenaEventMatchSquadWidgetBase.OnPlayerAdded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaBroadcastSquadStatusWidget
// Size: 0x2f8 (Inherited: 0x2d0)
struct UAthenaBroadcastSquadStatusWidget : UAthenaEventMatchSquadWidgetBase {
	struct FUniqueNetIdRepl FollowedPlayerUID; // 0x2d0(0x28)

	void OnPipModeChanged(bool bPipModeEnabled); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnPipModeChanged // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void OnMinigameTeamIdChanged(struct UFortMinigameTeamIdentification* MinigameTeamId); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnMinigameTeamIdChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnFollowedPlayerChanged(); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.OnFollowedPlayerChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleSquadIdChanged(struct UAthenaRemoteSquadViewData* InSquadData, char SquadId); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.HandleSquadIdChanged // (Final|Native|Private) // @ game+0x6a1c36c
	void HandleFollowedPlayerChanged(struct AFortPlayerControllerSpectating* SpectatorController, struct AFortPlayerState* NewFollowedPlayer); // Function FortniteUI.AthenaBroadcastSquadStatusWidget.HandleFollowedPlayerChanged // (Final|Native|Protected) // @ game+0x1fa59cc
};

// Class FortniteUI.AthenaCareerScreen
// Size: 0x4d0 (Inherited: 0x458)
struct UAthenaCareerScreen : UCommonActivatablePanelLegacy {
	SoftClassProperty LeaderboardsScreenClass; // 0x458(0x28)
	SoftClassProperty ReplayBrowserScreenClass; // 0x480(0x28)
	struct UCommonTextBlock* Text_AccountLevel; // 0x4a8(0x08)
	struct UCommonButtonLegacy* Button_Leaderboards; // 0x4b0(0x08)
	struct UCommonButtonLegacy* Button_Replays; // 0x4b8(0x08)
	struct UAthenaFeatTimelineListView* ListView_FeatTimeline; // 0x4c0(0x08)
	struct UCommonTextBlock* Text_ChapterContext; // 0x4c8(0x08)

	void ShowFeats(bool bHasCompletedFeats); // Function FortniteUI.AthenaCareerScreen.ShowFeats // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeCountdownDisplay
// Size: 0x380 (Inherited: 0x260)
struct UAthenaChallengeCountdownDisplay : UUserWidget {
	char pad_260[0x10]; // 0x260(0x10)
	struct FDateTime UnlockTime; // 0x270(0x08)
	enum class ECountdownDisplay DisplayType; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)
	struct FTimerDisplayData DisplayData[0x4]; // 0x280(0xe0)
	char pad_360[0x18]; // 0x360(0x18)
	struct UCommonTextBlock* Text_TimeRemaining; // 0x378(0x08)

	void OnChallengeSet(struct FTimerDisplayData DisplayStyle); // Function FortniteUI.AthenaChallengeCountdownDisplay.OnChallengeSet // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeDateTimeTextBlock
// Size: 0x310 (Inherited: 0x310)
struct UAthenaChallengeDateTimeTextBlock : UCommonDateTimeTextBlock {
};

// Class FortniteUI.AthenaChallengeDetailBase
// Size: 0x298 (Inherited: 0x288)
struct UAthenaChallengeDetailBase : UCommonUserWidget {
	struct UFortItemBaseWidget* ItemInfo_PreviewedItem; // 0x288(0x08)
	struct USizeBox* SB_MainContent; // 0x290(0x08)
};

// Class FortniteUI.AthenaChallengeDisplayData
// Size: 0x1c8 (Inherited: 0x30)
struct UAthenaChallengeDisplayData : UDataAsset {
	int32_t SoonDisplayMinuteThreshold; // 0x30(0x04)
	struct FLinearColor PartyAssistFontColor; // 0x34(0x10)
	struct FLinearColor DifficultChallengeFontColor; // 0x44(0x10)
	char pad_54[0x4]; // 0x54(0x04)
	struct UTexture2D* PartyAssistIcon; // 0x58(0x08)
	struct UTexture2D* ExternalPartyAssistIcon; // 0x60(0x08)
	struct FFortChallengeSetStyle DefaultChallengeStyle; // 0x68(0xa0)
	struct FFortChallengeSetStyle DailyChallengeStyle; // 0x108(0xa0)
	struct TArray<struct FGameplayTagContainer> PunchCardSortOrder; // 0x1a8(0x10)
	struct TArray<struct FFortChallengePunchCardStyles> ChallengePunchCardStyles; // 0x1b8(0x10)
};

// Class FortniteUI.AthenaChallengeDisplayLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAthenaChallengeDisplayLibrary : UBlueprintFunctionLibrary {

	struct FLinearColor GetChallengeStyleLightAccentColor(struct FFortChallengeSetStyle DisplayStyle); // Function FortniteUI.AthenaChallengeDisplayLibrary.GetChallengeStyleLightAccentColor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x6a1d948
	void ApplyChallengeSetStyleColorsToMaterial(struct FFortChallengeSetStyle DisplayStyle, struct UMaterialInstanceDynamic* StyleMaterial); // Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToMaterial // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x6a1d82c
	void ApplyChallengeSetStyleColorsToImageMaterial(struct FFortChallengeSetStyle DisplayStyle, struct UImage* ImageWidget); // Function FortniteUI.AthenaChallengeDisplayLibrary.ApplyChallengeSetStyleColorsToImageMaterial // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x6a1d700
};

// Class FortniteUI.AthenaChallengeEntry
// Size: 0x268 (Inherited: 0x260)
struct UAthenaChallengeEntry : UUserWidget {
	struct UCommonRichTextBlock* Text_CurrentTask; // 0x260(0x08)
};

// Class FortniteUI.ImageGridObject
// Size: 0x40 (Inherited: 0x28)
struct UImageGridObject : UObject {
	int32_t GridLocation; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UFortChallengeBundleItemDefinition* BundleData; // 0x30(0x08)
	struct UFortQuestItem* QuestItem; // 0x38(0x08)
};

// Class FortniteUI.AthenaChallengeImageGridEntry
// Size: 0xc68 (Inherited: 0xc20)
struct UAthenaChallengeImageGridEntry : UCommonButtonLegacy {
	char pad_C20[0x18]; // 0xc20(0x18)
	struct UCommonLazyImage* Image_Brush; // 0xc38(0x08)
	bool bSelected; // 0xc40(0x01)
	char pad_C41[0x3]; // 0xc41(0x03)
	int32_t GridLocation; // 0xc44(0x04)
	int32_t Column; // 0xc48(0x04)
	int32_t Row; // 0xc4c(0x04)
	char pad_C50[0x18]; // 0xc50(0x18)

	void TransitionFromOwnedToCompletedState(); // Function FortniteUI.AthenaChallengeImageGridEntry.TransitionFromOwnedToCompletedState // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void TransitionFromLockedToOwnedState(); // Function FortniteUI.AthenaChallengeImageGridEntry.TransitionFromLockedToOwnedState // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetupLockedToOwnState(); // Function FortniteUI.AthenaChallengeImageGridEntry.SetupLockedToOwnState // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnChallengeSet(bool bIsComplete, bool bIsLocked); // Function FortniteUI.AthenaChallengeImageGridEntry.OnChallengeSet // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeInfoPanelEntry
// Size: 0x2b8 (Inherited: 0x288)
struct UAthenaChallengeInfoPanelEntry : UCommonUserWidget {
	char pad_288[0x8]; // 0x288(0x08)
	struct UImage* Image_AssistIcon; // 0x290(0x08)
	struct UWidget* Panel_GroupChallenge; // 0x298(0x08)
	struct UCommonRichTextBlock* RichText_AssistTarget; // 0x2a0(0x08)
	struct UCommonRichTextBlock* RichText_ChallengeDesc; // 0x2a8(0x08)
	struct UAthenaChallengeProgressBar* ChallengeProgress_ObjectivesCompleted; // 0x2b0(0x08)

	void OnLocalPlayerMissingAssistedChallenge(); // Function FortniteUI.AthenaChallengeInfoPanelEntry.OnLocalPlayerMissingAssistedChallenge // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnChallengeInfoSet(); // Function FortniteUI.AthenaChallengeInfoPanelEntry.OnChallengeInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleQuestsUpdated(); // Function FortniteUI.AthenaChallengeInfoPanelEntry.HandleQuestsUpdated // (Final|Native|Private) // @ game+0x6a1de14
};

// Class FortniteUI.AthenaChallengeInfoPanel
// Size: 0x2f8 (Inherited: 0x288)
struct UAthenaChallengeInfoPanel : UCommonUserWidget {
	char pad_288[0x10]; // 0x288(0x10)
	enum class EChallengeInfoPage CurrentPage; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	struct FDataTableRowHandle CyclePagesInputAction; // 0x2a0(0x10)
	int32_t MaxSuggestedEntries; // 0x2b0(0x04)
	char pad_2B4[0x4]; // 0x2b4(0x04)
	struct TArray<struct TWeakObjectPtr<struct UFortPartyMember>> PartyMembersWithAssistedChallenges; // 0x2b8(0x10)
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct UCommonTextBlock* Text_DisplayedChallengeTypes; // 0x2d0(0x08)
	struct UDynamicEntryBox* EntryBox_Challenges; // 0x2d8(0x08)
	char pad_2E0[0x18]; // 0x2e0(0x18)

	void HandleQuestsUpdatedInGame(); // Function FortniteUI.AthenaChallengeInfoPanel.HandleQuestsUpdatedInGame // (Final|Native|Private) // @ game+0x6a1de28
	void HandleNewContextualObjectives(struct TArray<struct UFortQuestItem*> Objectives); // Function FortniteUI.AthenaChallengeInfoPanel.HandleNewContextualObjectives // (Final|Native|Private|HasOutParms) // @ game+0x6a1dc20
	void HandleCycleQuestsInputAction(bool bPassThrough); // Function FortniteUI.AthenaChallengeInfoPanel.HandleCycleQuestsInputAction // (Final|Native|Private|HasOutParms) // @ game+0x6a1db80
};

// Class FortniteUI.AthenaMissionInfoPanel
// Size: 0x310 (Inherited: 0x288)
struct UAthenaMissionInfoPanel : UCommonUserWidget {
	struct UAthenaChallengeInfoPanelEntry* FrontendChallengeInfoEntry; // 0x288(0x08)
	struct UAthenaMiniChallengeEntry* MiniChallengeInfoEntry; // 0x290(0x08)
	int32_t MaxSuggestedEntries; // 0x298(0x04)
	bool bForceToDailyFirst; // 0x29c(0x01)
	char pad_29D[0x3]; // 0x29d(0x03)
	struct TArray<struct TWeakObjectPtr<struct UFortPartyMember>> PartyMembersWithAssistedChallenges; // 0x2a0(0x10)
	char pad_2B0[0x8]; // 0x2b0(0x08)
	struct FName PrestigeShimmerParamName; // 0x2b8(0x08)
	struct FName ContextColorParamName; // 0x2c0(0x08)
	struct FName MissionRewardParamName; // 0x2c8(0x08)
	struct UCommonTextBlock* Text_DisplayedChallengeTypes; // 0x2d0(0x08)
	struct UCommonTextBlock* Text_ChallengeTitle; // 0x2d8(0x08)
	struct UCommonTextBlock* Text_ChallengeName; // 0x2e0(0x08)
	struct UDynamicEntryBox* EntryBox_Challenges; // 0x2e8(0x08)
	struct UCommonButtonLegacy* Button_ViewNextMission; // 0x2f0(0x08)
	struct UAthenaChallengeRewardDisplayEntry* MissionReward; // 0x2f8(0x08)
	struct UWidgetSwitcher* Switcher_MissionIcon; // 0x300(0x08)
	struct UImage* TimerImage; // 0x308(0x08)

	void SetMissionStyle(struct FFortChallengeSetStyle Style); // Function FortniteUI.AthenaMissionInfoPanel.SetMissionStyle // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleCycleMissionClicked(); // Function FortniteUI.AthenaMissionInfoPanel.HandleCycleMissionClicked // (Final|Native|Public) // @ game+0x6a1db6c
};

// Class FortniteUI.AthenaInGameChallengeInfoPanel
// Size: 0x2c8 (Inherited: 0x288)
struct UAthenaInGameChallengeInfoPanel : UCommonUserWidget {
	int32_t TotalMaxEntries; // 0x288(0x04)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct UAthenaChallengeInfoPanel* ChallengeInfo_PartyAssist; // 0x290(0x08)
	struct UAthenaChallengeInfoPanel* ChallengeInfo_Daily; // 0x298(0x08)
	struct UAthenaChallengeInfoPanel* ChallengeInfo_Suggested; // 0x2a0(0x08)
	struct UAthenaChallengeInfoPanel* ChallengeInfo_Contextual; // 0x2a8(0x08)
	struct UAthenaChallengeInfoPanel* ChallengeInfo_Selected; // 0x2b0(0x08)
	struct UPanelWidget* Panel_NonSelectedChallenges; // 0x2b8(0x08)
	char pad_2C0[0x8]; // 0x2c0(0x08)
};

// Class FortniteUI.AthenaChallengeRewardDisplayEntry
// Size: 0x270 (Inherited: 0x260)
struct UAthenaChallengeRewardDisplayEntry : UUserWidget {
	struct UFortLazyImage* LazyImage_RewardIcon; // 0x260(0x08)
	struct UCommonTextBlock* Text_RewardQuantity; // 0x268(0x08)
};

// Class FortniteUI.AthenaChallengeRewardDisplay
// Size: 0x270 (Inherited: 0x260)
struct UAthenaChallengeRewardDisplay : UUserWidget {
	struct UDynamicEntryBox* EntryBox_Rewards; // 0x260(0x08)
	struct UImage* Image_CompletionIcon; // 0x268(0x08)
};

// Class FortniteUI.AthenaChallengeListEntryBase
// Size: 0x290 (Inherited: 0x288)
struct UAthenaChallengeListEntryBase : UCommonUserWidget {
	char pad_288[0x8]; // 0x288(0x08)

	void StartHighlight(); // Function FortniteUI.AthenaChallengeListEntryBase.StartHighlight // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void EndHighlight(); // Function FortniteUI.AthenaChallengeListEntryBase.EndHighlight // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet
// Size: 0x2b8 (Inherited: 0x290)
struct UAthenaChallengeTreeEntry_ChallengeSet : UAthenaChallengeListEntryBase {
	char pad_290[0x10]; // 0x290(0x10)
	struct UCommonTextBlock* Text_ChallengeSetName; // 0x2a0(0x08)
	struct UCommonTextBlock* Text_ChallengeSetContext; // 0x2a8(0x08)
	struct UCommonTextBlock* Text_PercentComplete; // 0x2b0(0x08)

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle DisplayStyle); // Function FortniteUI.AthenaChallengeTreeEntry_ChallengeSet.OnChallengeSetEstablished // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeListEntry_Challenge
// Size: 0x2b8 (Inherited: 0x290)
struct UAthenaChallengeListEntry_Challenge : UAthenaChallengeListEntryBase {
	char pad_290[0x10]; // 0x290(0x10)
	bool bHideProgressBar; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	struct UCommonRichTextBlock* RichText_ChallengeDesc; // 0x2a8(0x08)
	struct UAthenaChallengeProgressBar* ChallengeProgress_ObjectivesCompleted; // 0x2b0(0x08)

	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled); // Function FortniteUI.AthenaChallengeListEntry_Challenge.OnPartyAssistEnabledChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bIsGroupChallenge, bool bCompact, bool HideRewards); // Function FortniteUI.AthenaChallengeListEntry_Challenge.OnChallengeInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	int32_t GetChallengeWeight(); // Function FortniteUI.AthenaChallengeListEntry_Challenge.GetChallengeWeight // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1da7c
	void BP_HandleIsTrackedChallengeChanged(bool bIsTrackedChallenge); // Function FortniteUI.AthenaChallengeListEntry_Challenge.BP_HandleIsTrackedChallengeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge
// Size: 0x320 (Inherited: 0x2b8)
struct UAthenaChallengeListEntry_DetailedChallenge : UAthenaChallengeListEntry_Challenge {
	char pad_2B8[0x10]; // 0x2b8(0x10)
	bool bHasAnyOptionsAvailable; // 0x2c8(0x01)
	bool bIsDisplayingChallengeActions; // 0x2c9(0x01)
	char pad_2CA[0x6]; // 0x2ca(0x06)
	struct FDataTableRowHandle BackAction; // 0x2d0(0x10)
	struct FDataTableRowHandle CloseChallengeOptionsAction; // 0x2e0(0x10)
	struct UWidgetAnimation* BoundAnim_ShowChallengeOptions; // 0x2f0(0x08)
	struct UButton* SimpleButton_TopClickArea; // 0x2f8(0x08)
	struct UAthenaChallengeRewardDisplay* Reward_QuestReward; // 0x300(0x08)
	struct UCommonButtonLegacy* Button_PartyAssist; // 0x308(0x08)
	struct UCommonButtonLegacy* Button_ReplaceChallenge; // 0x310(0x08)
	struct UCommonRichTextBlock* RichText_ActionInfo; // 0x318(0x08)

	void HandleUpperAreaClicked(); // Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleUpperAreaClicked // (Final|Native|Private) // @ game+0x6a1de3c
	void HandleCloseChallengeOptionsInputAction(bool bPassThrough); // Function FortniteUI.AthenaChallengeListEntry_DetailedChallenge.HandleCloseChallengeOptionsInputAction // (Final|Native|Private|HasOutParms) // @ game+0x6a1dadc
};

// Class FortniteUI.AthenaChallengeListEntry_Header
// Size: 0x298 (Inherited: 0x290)
struct UAthenaChallengeListEntry_Header : UAthenaChallengeListEntryBase {
	struct UCommonTextBlock* Text_SectionTitle; // 0x290(0x08)

	void OnSectionTypeSet(enum class EChallengeListSection SectionType); // Function FortniteUI.AthenaChallengeListEntry_Header.OnSectionTypeSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeListEntry_CompletionReward
// Size: 0x2a8 (Inherited: 0x290)
struct UAthenaChallengeListEntry_CompletionReward : UAthenaChallengeListEntryBase {
	struct UAthenaChallengeRewardDisplay* Reward_CompletionReward; // 0x290(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x298(0x08)
	struct UAthenaChallengeProgressBar* ChallengeProgress_ObjectivesCompleted; // 0x2a0(0x08)

	void OnRewardInfoSet(bool bIsCompleted, struct FFortChallengeSetStyle DisplayStyle); // Function FortniteUI.AthenaChallengeListEntry_CompletionReward.OnRewardInfoSet // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeListEntry_StoreOffer
// Size: 0x2d8 (Inherited: 0x290)
struct UAthenaChallengeListEntry_StoreOffer : UAthenaChallengeListEntryBase {
	SoftClassProperty OfferDetailsWidgetClass; // 0x290(0x28)
	struct UFortStoreFrontOfferInfo* OfferInfo; // 0x2b8(0x08)
	struct UButton* SimpleButton_ClickArea; // 0x2c0(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x2c8(0x08)
	struct UFortLazyImage* LazyImage_SpecialOffer; // 0x2d0(0x08)

	void OnOfferSet(); // Function FortniteUI.AthenaChallengeListEntry_StoreOffer.OnOfferSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleClicked(); // Function FortniteUI.AthenaChallengeListEntry_StoreOffer.HandleClicked // (Final|Native|Protected) // @ game+0x6a1dac8
};

// Class FortniteUI.AthenaChallengeListEntry_NpcQuest
// Size: 0x318 (Inherited: 0x290)
struct UAthenaChallengeListEntry_NpcQuest : UAthenaChallengeListEntryBase {
	struct URichTextBlock* RichText_ChallengeDesc; // 0x290(0x08)
	struct URichTextBlock* RichText_ObjectivesCompletedSelected; // 0x298(0x08)
	struct URichTextBlock* RichText_ObjectivesCompletedUnselected; // 0x2a0(0x08)
	struct UFortLazyImage* LazyImage_SourceIcon; // 0x2a8(0x08)
	struct URichTextBlock* RichText_SourceName; // 0x2b0(0x08)
	struct URichTextBlock* RichText_FlavorText; // 0x2b8(0x08)
	struct UAthenaChallengeDateTimeTextBlock* DateTimeText_TimeRemaining; // 0x2c0(0x08)
	struct UAthenaChallengeRewards* UserWidget_Rewards; // 0x2c8(0x08)
	struct UCommonTextBlock* Text_QuestID; // 0x2d0(0x08)
	struct TSoftObjectPtr<struct UObject> DefaultPortraitDisplayAsset; // 0x2d8(0x28)
	char pad_300[0x18]; // 0x300(0x18)

	void OnSetState(bool bIsCompleted, bool bIsLocked, bool bIsPartyAssisted, bool bIsGroupChallenge); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.OnSetState // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	bool IsSelected(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.IsSelected // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1de50
	void HandleQuestUpdate(struct UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.HandleQuestUpdate // (Final|Native|Private) // @ game+0x6a1dcd0
	void BP_OnTimerSet(enum class EAthenaChallengeTimerState TimerState); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnTimerSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnRaritySet(enum class EFortRarity Rarity); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnRaritySet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnChallengeSeenChanged(bool bChallengeSeen); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnChallengeSeenChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnChallengeInfoSet(); // Function FortniteUI.AthenaChallengeListEntry_NpcQuest.BP_OnChallengeInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeListViewBase
// Size: 0x308 (Inherited: 0x220)
struct UAthenaChallengeListViewBase : UListViewBase {
	char pad_220[0xe0]; // 0x220(0xe0)
	float EntrySpacing; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)
};

// Class FortniteUI.AthenaChallengeNpcQuestListView
// Size: 0x330 (Inherited: 0x308)
struct UAthenaChallengeNpcQuestListView : UAthenaChallengeListViewBase {
	char pad_308[0x28]; // 0x308(0x28)
};

// Class FortniteUI.AthenaChallengeNpcQuestTabList
// Size: 0x2f8 (Inherited: 0x288)
struct UAthenaChallengeNpcQuestTabList : UCommonUserWidget {
	struct UFortTabListWidgetBase* TabList_ChallengeCategories; // 0x288(0x08)
	struct UCommonTextBlock* Text_TabName; // 0x290(0x08)
	struct UAthenaMapChallengeCategoryTabButton* TabButtonClass; // 0x298(0x08)
	struct TArray<struct FRewardCategoryTabData> RewardTabsData; // 0x2a0(0x10)
	struct UObject* DefaultTabDisplayAsset; // 0x2b0(0x08)
	char pad_2B8[0x40]; // 0x2b8(0x40)

	void HandleTransientQuestStarted(struct UFortQuestItem* QuestItem); // Function FortniteUI.AthenaChallengeNpcQuestTabList.HandleTransientQuestStarted // (Final|Native|Private) // @ game+0x6a1eb58
	void HandleTransientQuestRemoved(struct UFortQuestItem* QuestItem); // Function FortniteUI.AthenaChallengeNpcQuestTabList.HandleTransientQuestRemoved // (Final|Native|Private) // @ game+0x6a1eb58
	void HandleTabSelected(struct FName TabNameID); // Function FortniteUI.AthenaChallengeNpcQuestTabList.HandleTabSelected // (Final|Native|Private) // @ game+0x6a1eac0
	void HandleTabButtonCreated(struct FName TabId, struct UCommonButtonLegacy* TabButton); // Function FortniteUI.AthenaChallengeNpcQuestTabList.HandleTabButtonCreated // (Final|Native|Private) // @ game+0x6a1e9d8
	void HandleNewContextualObjectives(struct TArray<struct UFortQuestItem*> ContextualQuests); // Function FortniteUI.AthenaChallengeNpcQuestTabList.HandleNewContextualObjectives // (Final|Native|Private|HasOutParms) // @ game+0x6a1e924
	void HandleDisplayDynamicQuestUpdate(struct UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate); // Function FortniteUI.AthenaChallengeNpcQuestTabList.HandleDisplayDynamicQuestUpdate // (Final|Native|Private) // @ game+0x6a1e698
};

// Class FortniteUI.AthenaChallengeProgressBar
// Size: 0x278 (Inherited: 0x260)
struct UAthenaChallengeProgressBar : UUserWidget {
	bool bHideProgressBar; // 0x260(0x01)
	char pad_261[0x7]; // 0x261(0x07)
	struct UProgressBar* ProgressBar_StepsCompleted; // 0x268(0x08)
	struct UCommonRichTextBlock* RichText_Progress; // 0x270(0x08)

	void SetPercentValueForMaterialNumber(int32_t PercentValue); // Function FortniteUI.AthenaChallengeProgressBar.SetPercentValueForMaterialNumber // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengePunchCard
// Size: 0x2f0 (Inherited: 0x288)
struct UAthenaChallengePunchCard : UCommonUserWidget {
	int32_t MaxPunchesAllowed; // 0x288(0x04)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct UDynamicEntryBox* Box_PunchSlots; // 0x290(0x08)
	struct UCommonTextBlock* Text_Title; // 0x298(0x08)
	struct UCommonTextBlock* Text_Description; // 0x2a0(0x08)
	char pad_2A8[0x30]; // 0x2a8(0x30)
	bool bInitializedWidgetPool; // 0x2d8(0x01)
	bool bBundleIsKnown; // 0x2d9(0x01)
	bool bBangShown; // 0x2da(0x01)
	char pad_2DB[0x1]; // 0x2db(0x01)
	struct TWeakObjectPtr<struct UFortChallengeBundleItemDefinition> WeakBundleDef; // 0x2dc(0x08)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct FDateTime MostRecentPunch; // 0x2e8(0x08)

	void UpdateChallengePunchCard(struct UFortChallengeBundleItem* Bundle, struct UFortQuestItem* CopmpletedQuest); // Function FortniteUI.AthenaChallengePunchCard.UpdateChallengePunchCard // (Final|Native|Public) // @ game+0x6a1ece4
	void UnfocusPunchCard(); // Function FortniteUI.AthenaChallengePunchCard.UnfocusPunchCard // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void TryToClearBangState(); // Function FortniteUI.AthenaChallengePunchCard.TryToClearBangState // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1ecd0
	void ShowWidget(); // Function FortniteUI.AthenaChallengePunchCard.ShowWidget // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void SetUpEncodedName(struct FString Name, int32_t Count); // Function FortniteUI.AthenaChallengePunchCard.SetUpEncodedName // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetUnkownState(bool bKnown); // Function FortniteUI.AthenaChallengePunchCard.SetUnkownState // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetStyle(struct FFortChallengePunchCardStyles PunchStyle); // Function FortniteUI.AthenaChallengePunchCard.SetStyle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void SetProgressCount(int32_t AchivedCount, int32_t GoalCount); // Function FortniteUI.AthenaChallengePunchCard.SetProgressCount // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetBangState(bool bShowBang); // Function FortniteUI.AthenaChallengePunchCard.SetBangState // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void HideProgressCount(bool bBundleCompleted); // Function FortniteUI.AthenaChallengePunchCard.HideProgressCount // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void FocusPunchCard(); // Function FortniteUI.AthenaChallengePunchCard.FocusPunchCard // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void FinishedPunchingCard(bool bPlayOutro); // Function FortniteUI.AthenaChallengePunchCard.FinishedPunchingCard // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengePunchCardEntry
// Size: 0x2c8 (Inherited: 0x288)
struct UAthenaChallengePunchCardEntry : UCommonUserWidget {
	struct FName IconParamName; // 0x288(0x08)
	int32_t SlotIndex; // 0x290(0x04)
	bool bIsBeingPlaced; // 0x294(0x01)
	char pad_295[0x1b]; // 0x295(0x1b)
	struct UCommonTextBlock* Text_RewardQuantity; // 0x2b0(0x08)
	struct UCommonRichTextBlock* Text_UnlockDate; // 0x2b8(0x08)
	struct UFortLazyImage* LazyImage_Stamp; // 0x2c0(0x08)

	void SetToDefaultSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetToDefaultSlot // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetStyle(struct FFortChallengePunchCardStyles PunchStyle); // Function FortniteUI.AthenaChallengePunchCardEntry.SetStyle // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void SetIsNonsequentialSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsNonsequentialSlot // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetIsLastSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsLastSlot // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetIsFirstSlot(); // Function FortniteUI.AthenaChallengePunchCardEntry.SetIsFirstSlot // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnPlacedEntry(); // Function FortniteUI.AthenaChallengePunchCardEntry.OnPlacedEntry // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnFinishedPlacingEntry(); // Function FortniteUI.AthenaChallengePunchCardEntry.OnFinishedPlacingEntry // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1ec98
};

// Class FortniteUI.AthenaChallengeRecapEntry
// Size: 0x2e8 (Inherited: 0x288)
struct UAthenaChallengeRecapEntry : UCommonUserWidget {
	char pad_288[0x48]; // 0x288(0x48)
	struct UCommonTextBlock* Text_QuestObjective; // 0x2d0(0x08)
	struct UCommonTextBlock* Text_CompletionCount; // 0x2d8(0x08)
	struct UWidgetSwitcher* Switcher_Progression; // 0x2e0(0x08)

	void UpdateProgressBar(float StartingPercent, float EndingPercent); // Function FortniteUI.AthenaChallengeRecapEntry.UpdateProgressBar // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void StartOutroAnim(); // Function FortniteUI.AthenaChallengeRecapEntry.StartOutroAnim // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void StartIntroAnim(); // Function FortniteUI.AthenaChallengeRecapEntry.StartIntroAnim // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OutroFinished(); // Function FortniteUI.AthenaChallengeRecapEntry.OutroFinished // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1ecb4
	void IntroFinished(); // Function FortniteUI.AthenaChallengeRecapEntry.IntroFinished // (Final|Native|Public|BlueprintCallable) // @ game+0x6a1ebec
};

// Class FortniteUI.AthenaChallengeRewards
// Size: 0x2a0 (Inherited: 0x260)
struct UAthenaChallengeRewards : UUserWidget {
	struct UFortLazyImage* LazyImage_RewardIcon; // 0x260(0x08)
	struct UCommonTextBlock* Text_RewardCount; // 0x268(0x08)
	struct UImage* Image_RewardBacking; // 0x270(0x08)
	struct UFortDynamicEntryBox* DynamicBox_MultiMarkers; // 0x278(0x08)
	char pad_280[0x20]; // 0x280(0x20)
};

// Class FortniteUI.AthenaChallengeRewardsMultiMarker
// Size: 0x260 (Inherited: 0x260)
struct UAthenaChallengeRewardsMultiMarker : UUserWidget {

	void BP_OnSetMarkerActive(bool bIsActive); // Function FortniteUI.AthenaChallengeRewardsMultiMarker.BP_OnSetMarkerActive // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeRewardTrackEntry
// Size: 0x2f0 (Inherited: 0x288)
struct UAthenaChallengeRewardTrackEntry : UCommonUserWidget {
	struct FName MissionRewardParamName; // 0x288(0x08)
	struct TSoftObjectPtr<struct UFortItemDefinition> RewardToRepresent; // 0x290(0x28)
	int32_t BundleRewardIndex; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct UImage* Image_ConnectorLeft; // 0x2c0(0x08)
	struct UImage* Image_ConnectorRight; // 0x2c8(0x08)
	struct UAthenaChallengeRewardDisplayEntry* MissionReward; // 0x2d0(0x08)
	char pad_2D8[0x18]; // 0x2d8(0x18)

	void StyleChange(bool bViewingPrestige); // Function FortniteUI.AthenaChallengeRewardTrackEntry.StyleChange // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetToDefaultState(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetToDefaultState // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetLastNodeInTrack(bool bIsLast); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetLastNodeInTrack // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetAsCurrentPreviewItem(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.SetAsCurrentPreviewItem // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void NextRewardToEarn(bool bNext); // Function FortniteUI.AthenaChallengeRewardTrackEntry.NextRewardToEarn // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void CompletedNextNode(bool bAnimate); // Function FortniteUI.AthenaChallengeRewardTrackEntry.CompletedNextNode // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void CompletedCurrentNode(bool bAnimate, bool LastReward); // Function FortniteUI.AthenaChallengeRewardTrackEntry.CompletedCurrentNode // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void ClearPreviewSelection(); // Function FortniteUI.AthenaChallengeRewardTrackEntry.ClearPreviewSelection // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeSetListView
// Size: 0x360 (Inherited: 0x308)
struct UAthenaChallengeSetListView : UAthenaChallengeListViewBase {
	struct FAthenaChallengeListVisualOptions ListVisualOptions; // 0x308(0x0c)
	bool bHideHeaders; // 0x314(0x01)
	bool bHideCompletionRewards; // 0x315(0x01)
	bool bHideQuestRewards; // 0x316(0x01)
	bool bUseCompactActionInfo; // 0x317(0x01)
	bool bAllowFocus; // 0x318(0x01)
	char pad_319[0x2f]; // 0x319(0x2f)
	struct UAthenaChallengeListEntry_Header* SectionHeaderEntryClass; // 0x348(0x08)
	struct UAthenaChallengeListEntry_CompletionReward* CompletionRewardEntryClass; // 0x350(0x08)
	struct UAthenaChallengeListEntry_StoreOffer* SpecialOfferEntryClass; // 0x358(0x08)
};

// Class FortniteUI.AthenaChallengeScreenTileBase
// Size: 0xc38 (Inherited: 0xc20)
struct UAthenaChallengeScreenTileBase : UCommonButtonLegacy {
	struct UCommonTextBlock* Text_ChallengeName; // 0xc20(0x08)
	struct UFortLazyImage* LazyImage_RewardPreview; // 0xc28(0x08)
	char pad_C30[0x8]; // 0xc30(0x08)

	void ResetToLocked(); // Function FortniteUI.AthenaChallengeScreenTileBase.ResetToLocked // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnContainsPartyAssistedChallengeChanged(bool bHasPartyAssistedChallenge); // Function FortniteUI.AthenaChallengeScreenTileBase.OnContainsPartyAssistedChallengeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnChallengeSetEstablished(struct FFortChallengeSetStyle DisplayStyle, bool bIsComplete, bool bIsLocked); // Function FortniteUI.AthenaChallengeScreenTileBase.OnChallengeSetEstablished // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaMinimalChallengeInfoEntry
// Size: 0x290 (Inherited: 0x288)
struct UAthenaMinimalChallengeInfoEntry : UCommonUserWidget {
	struct UAthenaChallengeProgressBar* ChallengeProgress_ObjectivesComplete; // 0x288(0x08)

	void OnChallengeInfoSet(bool bIsInProgress); // Function FortniteUI.AthenaMinimalChallengeInfoEntry.OnChallengeInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeScreenTile_Daily
// Size: 0xc48 (Inherited: 0xc38)
struct UAthenaChallengeScreenTile_Daily : UAthenaChallengeScreenTileBase {
	struct UImage* Image_PartyAssist; // 0xc38(0x08)
	struct UDynamicEntryBox* EntryBox_MinimalInfoDailies; // 0xc40(0x08)
};

// Class FortniteUI.AthenaChallengeScreenTile_PunchCard
// Size: 0xc40 (Inherited: 0xc38)
struct UAthenaChallengeScreenTile_PunchCard : UAthenaChallengeScreenTileBase {
	struct UAthenaPunchCard* PunchCard; // 0xc38(0x08)
};

// Class FortniteUI.AthenaChallengeSetTile
// Size: 0xc68 (Inherited: 0xc38)
struct UAthenaChallengeSetTile : UAthenaChallengeScreenTileBase {
	char pad_C38[0x10]; // 0xc38(0x10)
	struct UAthenaChallengeProgressBar* ChallengeProgress_QuestsCompleted; // 0xc48(0x08)
	struct UCommonTextBlock* Text_ChallengeContext; // 0xc50(0x08)
	struct UFortLazyImage* LazyImage_CustomBackground; // 0xc58(0x08)
	struct UCommonRichTextBlock* RichText_UnavailableReason; // 0xc60(0x08)
};

// Class FortniteUI.AthenaChallengeSetTile_Event
// Size: 0xc70 (Inherited: 0xc68)
struct UAthenaChallengeSetTile_Event : UAthenaChallengeSetTile {
	struct UAthenaChallengeCountdownDisplay* Countdown_TimeRemaining; // 0xc68(0x08)
};

// Class FortniteUI.AthenaChallengeSetTile_Weekly
// Size: 0xc68 (Inherited: 0xc68)
struct UAthenaChallengeSetTile_Weekly : UAthenaChallengeSetTile {
};

// Class FortniteUI.AthenaChallengeSetTile_Mission
// Size: 0xcc0 (Inherited: 0xc68)
struct UAthenaChallengeSetTile_Mission : UAthenaChallengeSetTile {
	int32_t BundleLevel; // 0xc68(0x04)
	int32_t BundleLevelCompletionPercent; // 0xc6c(0x04)
	struct FName PrestigeShimmerParamName; // 0xc70(0x08)
	struct FName ContextColorParamName; // 0xc78(0x08)
	char pad_C80[0x8]; // 0xc80(0x08)
	struct UImage* Image_MissionCompleted; // 0xc88(0x08)
	struct UImage* Image_ChaseReward; // 0xc90(0x08)
	struct UCommonRichTextBlock* Text_AvailableInTime; // 0xc98(0x08)
	struct UAthenaChallengeCountdownDisplay* Countdown_TimeRemaining; // 0xca0(0x08)
	struct UWidgetSwitcher* Switcher_LockReason; // 0xca8(0x08)
	struct UWidgetSwitcher* Switcher_MissionIcon; // 0xcb0(0x08)
	struct UWidgetSwitcher* Switcher_Reward; // 0xcb8(0x08)

	bool IsUrgentMission(); // Function FortniteUI.AthenaChallengeSetTile_Mission.IsUrgentMission // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1ec74
	bool IsLockedByTime(); // Function FortniteUI.AthenaChallengeSetTile_Mission.IsLockedByTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1ec2c
	bool IsGenericMission(); // Function FortniteUI.AthenaChallengeSetTile_Mission.IsGenericMission // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1ec08
	struct TSoftObjectPtr<struct UTexture2D> GetSoftTextureForChaseReward(); // Function FortniteUI.AthenaChallengeSetTile_Mission.GetSoftTextureForChaseReward // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1e5a8
	bool CanLevelUpBundle(); // Function FortniteUI.AthenaChallengeSetTile_Mission.CanLevelUpBundle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1e584
};

// Class FortniteUI.AthenaChallengeSetTile_Style
// Size: 0xc68 (Inherited: 0xc68)
struct UAthenaChallengeSetTile_Style : UAthenaChallengeSetTile {
};

// Class FortniteUI.AthenaChallengesWidget
// Size: 0x370 (Inherited: 0x2c8)
struct UAthenaChallengesWidget : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)
	struct UCommonTextBlock* Text_Challenges; // 0x308(0x08)
	struct UDynamicEntryBox* DynamicEntryBox_ChallengeEntries; // 0x310(0x08)
	char pad_318[0x50]; // 0x318(0x50)
	struct FFortPrioritizedWidgetData PrioritizedWidgetData; // 0x368(0x02)
	char pad_36A[0x6]; // 0x36a(0x06)

	void HandleDisplayDynamicQuestUpdate(struct UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate); // Function FortniteUI.AthenaChallengesWidget.HandleDisplayDynamicQuestUpdate // (Native|Protected) // @ game+0x6a1e7dc
	void BP_WidgetIsFinished(); // Function FortniteUI.AthenaChallengesWidget.BP_WidgetIsFinished // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnWidgetActivated(); // Function FortniteUI.AthenaChallengesWidget.BP_OnWidgetActivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaChallengeTreeView
// Size: 0x388 (Inherited: 0x308)
struct UAthenaChallengeTreeView : UAthenaChallengeListViewBase {
	char pad_308[0x70]; // 0x308(0x70)
	struct UAthenaChallengeTreeEntry_ChallengeSet* SetHeaderEntryClass; // 0x378(0x08)
	bool bReturnFocusToSelection; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)

	void HandleQuestsUpdated(); // Function FortniteUI.AthenaChallengeTreeView.HandleQuestsUpdated // (Final|Native|Private) // @ game+0x6a1e9c4
};

// Class FortniteUI.AthenaCollectionItemToast
// Size: 0x338 (Inherited: 0x2c8)
struct UAthenaCollectionItemToast : UFortHUDElementWidget {
	char pad_2C8[0x28]; // 0x2c8(0x28)
	float OpenCollectionScreenInputHoldTime; // 0x2f0(0x04)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	struct UCommonTextBlock* Text_ItemNumber; // 0x2f8(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0x300(0x08)
	struct UCommonLazyImage* LazyImage_ItemImage; // 0x308(0x08)
	struct UButton* Button_MobileClickCatcher; // 0x310(0x08)
	char pad_318[0x20]; // 0x318(0x20)

	void ResetToast(); // Function FortniteUI.AthenaCollectionItemToast.ResetToast // (Native|Protected) // @ game+0x3db7828
	void HandleMobileClick(); // Function FortniteUI.AthenaCollectionItemToast.HandleMobileClick // (Final|Native|Private) // @ game+0x6a1fe7c
	bool BPCallableIsDesignTime(); // Function FortniteUI.AthenaCollectionItemToast.BPCallableIsDesignTime // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1db0504
	void BP_OnToastUpdated(enum class EFortCollectedState CollectedState, int32_t NumCollected); // Function FortniteUI.AthenaCollectionItemToast.BP_OnToastUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnToastReset(); // Function FortniteUI.AthenaCollectionItemToast.BP_OnToastReset // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnDisplayToast(); // Function FortniteUI.AthenaCollectionItemToast.BP_OnDisplayToast // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionItemToastCharacter
// Size: 0x358 (Inherited: 0x338)
struct UAthenaCollectionItemToastCharacter : UAthenaCollectionItemToast {
	struct FText NumLocationsFormat; // 0x338(0x18)
	struct UCommonRichTextBlock* RichText_NumLocations; // 0x350(0x08)

	void BP_OnLocationsSet(int32_t NumFound, int32_t NumLocations); // Function FortniteUI.AthenaCollectionItemToastCharacter.BP_OnLocationsSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionItemToastFishing
// Size: 0x380 (Inherited: 0x338)
struct UAthenaCollectionItemToastFishing : UAthenaCollectionItemToast {
	struct FText LengthFormat; // 0x338(0x18)
	struct FText LeaderLengthFormat; // 0x350(0x18)
	struct UCommonRichTextBlock* RichText_Length; // 0x368(0x08)
	struct UCommonTextBlock* Text_LeaderName; // 0x370(0x08)
	struct UCommonRichTextBlock* RichText_LeaderLength; // 0x378(0x08)

	void BP_OnUnlockedNewClue(); // Function FortniteUI.AthenaCollectionItemToastFishing.BP_OnUnlockedNewClue // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnStarRatingSet(int32_t StarRating); // Function FortniteUI.AthenaCollectionItemToastFishing.BP_OnStarRatingSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnRankSet(int32_t Rank, int32_t NumEntries); // Function FortniteUI.AthenaCollectionItemToastFishing.BP_OnRankSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength); // Function FortniteUI.AthenaCollectionItemToastFishing.BP_OnNormalizedLengthSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionItemToastSwitcher
// Size: 0x370 (Inherited: 0x2c8)
struct UAthenaCollectionItemToastSwitcher : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)
	struct FMulticastInlineDelegate OnResetToast; // 0x308(0x10)
	char pad_318[0x20]; // 0x318(0x20)
	float TimeToShowToast; // 0x338(0x04)
	float ActivationDelay; // 0x33c(0x04)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x340(0x02)
	char pad_342[0x6]; // 0x342(0x06)
	struct UCommonVisibilitySwitcher* WidgetSwitcher_Toasts; // 0x348(0x08)
	struct UAthenaCollectionItemToast* ActiveCollectionItemToastWidget; // 0x350(0x08)
	char pad_358[0x10]; // 0x358(0x10)
	bool bHasPrioritizedWidgetFocus; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
};

// Class FortniteUI.AthenaCollectionLeaderboard
// Size: 0x358 (Inherited: 0x320)
struct UAthenaCollectionLeaderboard : UCommonActivatableWidget {
	float LeaderboardScrollSpeed; // 0x320(0x04)
	float LeaderboardScrollInitialDelay; // 0x324(0x04)
	struct UScrollBox* ScrollBox_Leaderboard; // 0x328(0x08)
	struct UDynamicEntryBox* EntryBox_Leaderboard; // 0x330(0x08)
	char pad_338[0x20]; // 0x338(0x20)
};

// Class FortniteUI.AthenaCollectionOverlayEntry
// Size: 0x2a8 (Inherited: 0x288)
struct UAthenaCollectionOverlayEntry : UCommonUserWidget {
	struct FText EmptyDisplayNameText; // 0x288(0x18)
	struct UCommonTextBlock* Text_DisplayName; // 0x2a0(0x08)

	void BP_OnDisplayNameSet(struct FString DisplayName); // Function FortniteUI.AthenaCollectionOverlayEntry.BP_OnDisplayNameSet // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionLeaderboardEntry
// Size: 0x2e8 (Inherited: 0x2a8)
struct UAthenaCollectionLeaderboardEntry : UAthenaCollectionOverlayEntry {
	struct FText ValueTextFormat; // 0x2a8(0x18)
	int32_t ValueMinimumFractionalDigits; // 0x2c0(0x04)
	int32_t ValueMaximumFractionalDigits; // 0x2c4(0x04)
	bool bValueIsFloat; // 0x2c8(0x01)
	char pad_2C9[0x7]; // 0x2c9(0x07)
	struct UCommonTextBlock* Text_Placement; // 0x2d0(0x08)
	struct UCommonRichTextBlock* RichText_Value; // 0x2d8(0x08)
	struct UFortSocialAvatarIcon* AvatarIcon; // 0x2e0(0x08)

	void BP_OnValueSet(float Value); // Function FortniteUI.AthenaCollectionLeaderboardEntry.BP_OnValueSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnPlacementSet(int32_t Placement); // Function FortniteUI.AthenaCollectionLeaderboardEntry.BP_OnPlacementSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnLeaderboardEntryReset(); // Function FortniteUI.AthenaCollectionLeaderboardEntry.BP_OnLeaderboardEntryReset // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnLeaderboardEntryInitialized(bool bIsLocalPlayer); // Function FortniteUI.AthenaCollectionLeaderboardEntry.BP_OnLeaderboardEntryInitialized // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionLeaderboardEntryFishing
// Size: 0x300 (Inherited: 0x2e8)
struct UAthenaCollectionLeaderboardEntryFishing : UAthenaCollectionLeaderboardEntry {
	struct FName ParamName_Has2Stars; // 0x2e8(0x08)
	struct FName ParamName_Has3Stars; // 0x2f0(0x08)
	struct UImage* Image_Stars; // 0x2f8(0x08)

	void BP_OnStarRatingSet(int32_t StarRating); // Function FortniteUI.AthenaCollectionLeaderboardEntryFishing.BP_OnStarRatingSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionListColumnEntry
// Size: 0x2c0 (Inherited: 0x288)
struct UAthenaCollectionListColumnEntry : UCommonUserWidget {
	char pad_288[0x8]; // 0x288(0x08)
	struct UDynamicEntryBox* EntryBox_ListEntries; // 0x290(0x08)
	char pad_298[0x28]; // 0x298(0x28)
};

// Class FortniteUI.AthenaCollectionListEntry
// Size: 0xc58 (Inherited: 0xc20)
struct UAthenaCollectionListEntry : UCommonButtonLegacy {
	char pad_C20[0x10]; // 0xc20(0x10)
	struct UImage* Image_Icon; // 0xc30(0x08)
	struct UCommonTextBlock* Text_Number; // 0xc38(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0xc40(0x08)
	char pad_C48[0x10]; // 0xc48(0x10)

	void BP_OnEntryReset(); // Function FortniteUI.AthenaCollectionListEntry.BP_OnEntryReset // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnEntryImageSet(); // Function FortniteUI.AthenaCollectionListEntry.BP_OnEntryImageSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnEntryIconLoaded(struct UObject* EntryIcon); // Function FortniteUI.AthenaCollectionListEntry.BP_OnEntryIconLoaded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnCollectionStateSet(enum class EFortCollectedState CollectedState); // Function FortniteUI.AthenaCollectionListEntry.BP_OnCollectionStateSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnCollectedByFriendSet(bool bCollectedByFriend); // Function FortniteUI.AthenaCollectionListEntry.BP_OnCollectedByFriendSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionListEntryCharacter
// Size: 0xc78 (Inherited: 0xc58)
struct UAthenaCollectionListEntryCharacter : UAthenaCollectionListEntry {
	struct UImage* Image_Background; // 0xc58(0x08)
	struct FName ParamName_ItemIcon; // 0xc60(0x08)
	struct FName ParamName_IsDiscovered; // 0xc68(0x08)
	struct FName ParamName_IsComplete; // 0xc70(0x08)

	void BP_OnLocationsFoundSet(int32_t NumFound, int32_t NumAvailable, bool bAllFound); // Function FortniteUI.AthenaCollectionListEntryCharacter.BP_OnLocationsFoundSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionListEntryFishing
// Size: 0xc80 (Inherited: 0xc58)
struct UAthenaCollectionListEntryFishing : UAthenaCollectionListEntry {
	struct FName ParamName_ItemIcon; // 0xc58(0x08)
	struct FName ParamName_IsDiscovered; // 0xc60(0x08)
	struct FName ParamName_ItemSize; // 0xc68(0x08)
	struct FName ParamName_Has2Stars; // 0xc70(0x08)
	struct FName ParamName_Has3Stars; // 0xc78(0x08)

	void BP_OnStarRatingSet(int32_t StarRating); // Function FortniteUI.AthenaCollectionListEntryFishing.BP_OnStarRatingSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength); // Function FortniteUI.AthenaCollectionListEntryFishing.BP_OnNormalizedLengthSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionListView
// Size: 0x360 (Inherited: 0x220)
struct UAthenaCollectionListView : UListViewBase {
	char pad_220[0xc0]; // 0x220(0xc0)
	float EntrySpacing; // 0x2e0(0x04)
	int32_t NumRows; // 0x2e4(0x04)
	char pad_2E8[0x78]; // 0x2e8(0x78)
};

// Class FortniteUI.AthenaCollectionLocationEntry
// Size: 0x2a8 (Inherited: 0x2a8)
struct UAthenaCollectionLocationEntry : UAthenaCollectionOverlayEntry {

	void BP_OnLocationsFoundSet(enum class ELocationEntryState EntryState); // Function FortniteUI.AthenaCollectionLocationEntry.BP_OnLocationsFoundSet // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionPlayerProgress
// Size: 0x2a8 (Inherited: 0x288)
struct UAthenaCollectionPlayerProgress : UCommonUserWidget {
	struct UCommonTextBlock* Text_PlayerName; // 0x288(0x08)
	struct UCommonTextBlock* Text_Progress; // 0x290(0x08)
	struct UFortSocialAvatarIcon* AvatarIcon; // 0x298(0x08)
	char pad_2A0[0x8]; // 0x2a0(0x08)

	bool IsLocalPlayer(); // Function FortniteUI.AthenaCollectionPlayerProgress.IsLocalPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1fe90
	int32_t GetNumCollected(); // Function FortniteUI.AthenaCollectionPlayerProgress.GetNumCollected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a1fe64
	void BP_OnShowPlayerInfoSet(bool bShowPlayerInfo); // Function FortniteUI.AthenaCollectionPlayerProgress.BP_OnShowPlayerInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnPlayerProgressInitialized(bool bIsLocalPlayer, int32_t NumCollected, int32_t NumToCollect); // Function FortniteUI.AthenaCollectionPlayerProgress.BP_OnPlayerProgressInitialized // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionPlayerProgressContainer
// Size: 0x2c8 (Inherited: 0x288)
struct UAthenaCollectionPlayerProgressContainer : UCommonUserWidget {
	struct UAthenaCollectionPlayerProgress* PlayerProgressClass; // 0x288(0x08)
	float CycleDelay; // 0x290(0x04)
	int32_t ShowLocalPlayerAfterNumEntries; // 0x294(0x04)
	struct TArray<struct UAthenaCollectionPlayerProgress*> CachedPlayerProgressEntries; // 0x298(0x10)
	char pad_2A8[0x20]; // 0x2a8(0x20)

	void BP_OnPlayerProgressEntriesCreated(struct TArray<struct UAthenaCollectionPlayerProgress*> PlayerProgressEntries, int32_t NumToCollect); // Function FortniteUI.AthenaCollectionPlayerProgressContainer.BP_OnPlayerProgressEntriesCreated // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void BP_OnPlayerProgressContainerReset(); // Function FortniteUI.AthenaCollectionPlayerProgressContainer.BP_OnPlayerProgressContainerReset // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionScreenBase
// Size: 0x4e0 (Inherited: 0x320)
struct UAthenaCollectionScreenBase : UCommonActivatableWidget {
	char pad_320[0x10]; // 0x320(0x10)
	struct FText CollectionName; // 0x330(0x18)
	struct FString CollectionType; // 0x348(0x10)
	struct FString CollectionCategory; // 0x358(0x10)
	struct FText UnknownText; // 0x368(0x18)
	struct FText UnknownDescription; // 0x380(0x18)
	struct TSoftObjectPtr<struct UObject> KnownEntryImage; // 0x398(0x28)
	struct TSoftObjectPtr<struct UObject> UnknownEntryImage; // 0x3c0(0x28)
	struct TSoftObjectPtr<struct UObject> KnownOverlayImage; // 0x3e8(0x28)
	struct TSoftObjectPtr<struct UObject> UnknownOverlayImage; // 0x410(0x28)
	struct FText PersonalBestTextFormat; // 0x438(0x18)
	char PersonalBestMinimumFractionalDigits; // 0x450(0x01)
	char PersonalBestMaximumFractionalDigits; // 0x451(0x01)
	char pad_452[0x6]; // 0x452(0x06)
	SoftClassProperty SoftInfoOverlayClass; // 0x458(0x28)
	struct UScrollBox* ScrollBox_List; // 0x480(0x08)
	struct UAthenaCollectionListView* CollectionListView; // 0x488(0x08)
	struct UContentWidget* Content_InfoOverlayContainer; // 0x490(0x08)
	struct UCommonButtonLegacy* Button_ToggleInfoOverlay; // 0x498(0x08)
	struct UCommonButtonLegacy* Button_Back; // 0x4a0(0x08)
	struct UAthenaCollectionPlayerProgressContainer* PlayerProgressContainer; // 0x4a8(0x08)
	bool bWantsToShowInfoOverlay; // 0x4b0(0x01)
	bool bForceOverlayToggleMobile; // 0x4b1(0x01)
	char pad_4B2[0x6]; // 0x4b2(0x06)
	struct UAthenaCollectionScreenInfoOverlay* InfoOverlay; // 0x4b8(0x08)
	struct UFortCollectionsDataTable* CollectionsDataTable; // 0x4c0(0x08)
	struct UFortCollectionData* CollectionData; // 0x4c8(0x08)
	char pad_4D0[0x10]; // 0x4d0(0x10)

	void CenterSelectedEntry(); // Function FortniteUI.AthenaCollectionScreenBase.CenterSelectedEntry // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a1fe50
	void BP_OnStartedLoading(); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnStartedLoading // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnInfoOverlayDeactivated(); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnInfoOverlayDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnInfoOverlayActivated(); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnInfoOverlayActivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHandleSelectedEntryChanged(struct UAthenaCollectionListEntry* SelectedEntry); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnHandleSelectedEntryChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnFinishedLoading(); // Function FortniteUI.AthenaCollectionScreenBase.BP_OnFinishedLoading // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionScreenCharacter
// Size: 0x4e0 (Inherited: 0x4e0)
struct UAthenaCollectionScreenCharacter : UAthenaCollectionScreenBase {
};

// Class FortniteUI.AthenaCollectionScreenContainer
// Size: 0x3f0 (Inherited: 0x320)
struct UAthenaCollectionScreenContainer : UCommonActivatableWidget {
	char pad_320[0x8]; // 0x320(0x08)
	struct TArray<struct FAthenaCollectionScreenContainerTabInfo> TabInfos; // 0x328(0x10)
	struct FDataTableRowHandle NextTabInputAction; // 0x338(0x10)
	struct FDataTableRowHandle PreviousTabInputAction; // 0x348(0x10)
	struct UCommonVisibilitySwitcher* VisibilitySwitcher_Content; // 0x358(0x08)
	struct UDynamicEntryBox* EntryBox_TabButtons; // 0x360(0x08)
	struct UCommonTextBlock* Text_TabTitle; // 0x368(0x08)
	struct UCommonButtonLegacy* MobileCloseButton; // 0x370(0x08)
	struct TArray<struct FAthenaCollectionScreenContainerTabInfo> ActiveTabInfos; // 0x378(0x10)
	char pad_388[0x68]; // 0x388(0x68)

	void BP_OnShowTabsSet(bool bShowTabs); // Function FortniteUI.AthenaCollectionScreenContainer.BP_OnShowTabsSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionScreenContainerTabButton
// Size: 0xc40 (Inherited: 0xc20)
struct UAthenaCollectionScreenContainerTabButton : UCommonButtonLegacy {
	struct FString CollectionType; // 0xc20(0x10)
	struct UCommonLazyImage* LazyImage_Icon; // 0xc30(0x08)
	struct FVector2D ImageSize_Mobile; // 0xc38(0x08)

	void BP_ShowBang(bool bShow); // Function FortniteUI.AthenaCollectionScreenContainerTabButton.BP_ShowBang // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionScreenFishing
// Size: 0x4f8 (Inherited: 0x4e0)
struct UAthenaCollectionScreenFishing : UAthenaCollectionScreenBase {
	struct FText RequiresProFishingRodText; // 0x4e0(0x18)
};

// Class FortniteUI.AthenaCollectionScreenInfoOverlay
// Size: 0x3f0 (Inherited: 0x320)
struct UAthenaCollectionScreenInfoOverlay : UCommonActivatableWidget {
	char pad_320[0x8]; // 0x320(0x08)
	struct FName ParamName_ItemIcon; // 0x328(0x08)
	struct FName ParamName_IsDiscovered; // 0x330(0x08)
	struct UCommonRichTextBlock* RichText_AdditionalInfo; // 0x338(0x08)
	struct UImage* Image_ItemImage; // 0x340(0x08)
	struct FText NumCollectedTextFormat; // 0x348(0x18)
	struct FText EmptyDisplayNameText; // 0x360(0x18)
	struct FDataTableRowHandle ToggleLeaderboardRowHandle; // 0x378(0x10)
	struct UCommonTextBlock* Text_ItemType; // 0x388(0x08)
	struct UCommonTextBlock* Text_ItemName; // 0x390(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x398(0x08)
	struct UCommonRichTextBlock* RichText_AdditionalDescription; // 0x3a0(0x08)
	struct UPanelWidget* Panel_FriendScores; // 0x3a8(0x08)
	struct UCommonRichTextBlock* RichText_NumCollected; // 0x3b0(0x08)
	struct UCommonTextBlock* Text_ItemNumber; // 0x3b8(0x08)
	struct UCommonButtonLegacy* Button_Close; // 0x3c0(0x08)
	struct UFortDynamicEntryBox* EntryBox_InfoOverlay; // 0x3c8(0x08)
	struct UAthenaCollectionLeaderboard* FriendLeaderboard; // 0x3d0(0x08)
	char pad_3D8[0x18]; // 0x3d8(0x18)

	void BP_OnShowLeaderboard(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnShowLeaderboard // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnItemIconLoaded(struct UObject* ItemIcon); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnItemIconLoaded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnInfoOverlayReset(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnInfoOverlayReset // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHideLeaderboard(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnHideLeaderboard // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnHasAdditionalInfoSet(bool bHasAdditionalInfo); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnHasAdditionalInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnFriendScoresUpdated(int32_t NumFriendScores); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnFriendScoresUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnFriendLeaderboardDeactivated(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnFriendLeaderboardDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnFriendLeaderboardActivated(); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnFriendLeaderboardActivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnContextTagsUpdated(int32_t NumContextTags); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnContextTagsUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnCollectedStateSet(enum class EFortCollectedState CollectedState); // Function FortniteUI.AthenaCollectionScreenInfoOverlay.BP_OnCollectedStateSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionScreenInfoOverlayCharacter
// Size: 0x420 (Inherited: 0x3f0)
struct UAthenaCollectionScreenInfoOverlayCharacter : UAthenaCollectionScreenInfoOverlay {
	struct FName ParamName_Progress; // 0x3f0(0x08)
	struct UImage* LocationProgress; // 0x3f8(0x08)
	struct FText NumAvailableTextFormat; // 0x400(0x18)
	struct UCommonRichTextBlock* RichText_NumAvailable; // 0x418(0x08)

	void BP_OnLocationsFoundSet(int32_t NumFound, int32_t NumAvailable, bool bAllFound); // Function FortniteUI.AthenaCollectionScreenInfoOverlayCharacter.BP_OnLocationsFoundSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCollectionScreenInfoOverlayFishing
// Size: 0x438 (Inherited: 0x3f0)
struct UAthenaCollectionScreenInfoOverlayFishing : UAthenaCollectionScreenInfoOverlay {
	bool bNeedsProFishingRod; // 0x3f0(0x01)
	char pad_3F1[0x7]; // 0x3f1(0x07)
	struct FText NoneText; // 0x3f8(0x18)
	struct UCommonRichTextBlock* RichText_PersonalBest; // 0x410(0x08)
	struct FText ScaleRangeTextFormat; // 0x418(0x18)
	struct UCommonRichTextBlock* RichText_ScaleRange; // 0x430(0x08)

	void BP_OnStarRatingSet(int32_t NumStars); // Function FortniteUI.AthenaCollectionScreenInfoOverlayFishing.BP_OnStarRatingSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength); // Function FortniteUI.AthenaCollectionScreenInfoOverlayFishing.BP_OnNormalizedLengthSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCommonPrioritizedWidget
// Size: 0x310 (Inherited: 0x2c8)
struct UAthenaCommonPrioritizedWidget : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)
	bool bAutoManagePriorityByVisibility; // 0x308(0x01)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x309(0x02)
	char pad_30B[0x5]; // 0x30b(0x05)

	void OnStompFailed(); // Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompFailed // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnStompedByOtherWidget(); // Function FortniteUI.AthenaCommonPrioritizedWidget.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void K2_OnBecomeInactive(); // Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeInactive // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void K2_OnBecomeActive(); // Function FortniteUI.AthenaCommonPrioritizedWidget.K2_OnBecomeActive // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCompassBase
// Size: 0x630 (Inherited: 0x2c8)
struct UAthenaCompassBase : UFortHUDElementWidget {
	struct UMaterialInstanceDynamic* CompassMaterial; // 0x2c8(0x08)
	struct UImage* Image_Compass; // 0x2d0(0x08)
	struct FSlateBrush MarkerBrush; // 0x2d8(0x88)
	struct FSlateBrush HeadingIndicatorBrush; // 0x360(0x88)
	struct FSlateBrush StormIndicatorBrush; // 0x3e8(0x88)
	float MarkerVerticalOffset; // 0x470(0x04)
	char pad_474[0x4]; // 0x474(0x04)
	struct FSlateFontInfo HeadingFont; // 0x478(0x58)
	struct FSlateBrush TeammateGunshotIndicatorBrush; // 0x4d0(0x88)
	struct FSlateBrush EnemyGunshotIndicatorBrush; // 0x558(0x88)
	float TimeToShowGunshotIndicators; // 0x5e0(0x04)
	char pad_5E4[0x4]; // 0x5e4(0x04)
	struct UCurveFloat* GunshotIndicatorScaleOverTime; // 0x5e8(0x08)
	struct UCurveFloat* GunshotIndicatorScaleByStrength; // 0x5f0(0x08)
	struct UCurveFloat* GunshotIndicatorAlphaOverTime; // 0x5f8(0x08)
	struct UCurveFloat* GunshotIndicatorAlphaByHeading; // 0x600(0x08)
	char pad_608[0x28]; // 0x608(0x28)
};

// Class FortniteUI.AthenaConfirmationWindow
// Size: 0x370 (Inherited: 0x320)
struct UAthenaConfirmationWindow : UCommonActivatableWidget {
	struct UCommonTextBlock* Text_Title; // 0x320(0x08)
	struct UCommonRichTextBlock* RichText_Description; // 0x328(0x08)
	struct UFortLazyImage* Image_MainIcon; // 0x330(0x08)
	struct UDynamicEntryBox* EntryBox_Buttons; // 0x338(0x08)
	struct UBacchusCloseButton* Button_Close; // 0x340(0x08)
	struct UCommonBorder* Border_TapToCloseZone; // 0x348(0x08)
	struct FDataTableRowHandle CancelAction; // 0x350(0x10)
	char pad_360[0x10]; // 0x360(0x10)

	void OnSetButtonText(struct UCommonButtonLegacy* Button, struct FText Text); // Function FortniteUI.AthenaConfirmationWindow.OnSetButtonText // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	struct FEventReply HandleTapToCloseZoneMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent MouseEvent); // Function FortniteUI.AthenaConfirmationWindow.HandleTapToCloseZoneMouseButtonDown // (Final|Native|Private|HasOutParms) // @ game+0x6a20c9c
};

// Class FortniteUI.AthenaMarkedActorIndicator
// Size: 0x518 (Inherited: 0x300)
struct UAthenaMarkedActorIndicator : UFortActorIndicatorWidget {
	char pad_300[0x20]; // 0x300(0x20)
	struct FFortWorldMarkerData MarkerData; // 0x320(0x130)
	struct FMarkedActorDisplayInfo MarkerDisplay; // 0x450(0x98)
	struct UFortMarkerDetailsTable* DetailsTable; // 0x4e8(0x08)
	float FreshLargeItemShowTime; // 0x4f0(0x04)
	float IndicatorDotSizeThreshold; // 0x4f4(0x04)
	struct UWidgetSwitcher* Switcher_IndicatorSize; // 0x4f8(0x08)
	struct UPanelWidget* Panel_SmallIndicator; // 0x500(0x08)
	struct UPanelWidget* Panel_LargeIndicator; // 0x508(0x08)
	struct UCommonTextBlock* Text_Distance; // 0x510(0x08)
};

// Class FortniteUI.AthenaContextTutorialIndicator
// Size: 0x548 (Inherited: 0x518)
struct UAthenaContextTutorialIndicator : UAthenaMarkedActorIndicator {
	float OffscreenMaxTreshold; // 0x518(0x04)
	char pad_51C[0x4]; // 0x51c(0x04)
	struct UOverlay* Overlay_Icon_2; // 0x520(0x08)
	char pad_528[0x4]; // 0x528(0x04)
	float ScreenEdgePaddingSizePercent; // 0x52c(0x04)
	char pad_530[0x18]; // 0x530(0x18)

	void SwitchIndicatorSize(); // Function FortniteUI.AthenaContextTutorialIndicator.SwitchIndicatorSize // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a21854
	void SetScreenPercent(float Percent); // Function FortniteUI.AthenaContextTutorialIndicator.SetScreenPercent // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void SetIndicatorText(struct FText Text); // Function FortniteUI.AthenaContextTutorialIndicator.SetIndicatorText // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void PlayOutAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayOutAnimation // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void PlayInAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayInAnimation // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void PlayBounceAnimation(); // Function FortniteUI.AthenaContextTutorialIndicator.PlayBounceAnimation // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	float GetMinTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMinTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a206a4
	float GetMaxTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMaxTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2068c
	float GetMaxOffscreenTreshold(); // Function FortniteUI.AthenaContextTutorialIndicator.GetMaxOffscreenTreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x536d5b0
	float GetCurrentDotProduct(); // Function FortniteUI.AthenaContextTutorialIndicator.GetCurrentDotProduct // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a20650
};

// Class FortniteUI.AthenaContextualChallengesWidget
// Size: 0x370 (Inherited: 0x370)
struct UAthenaContextualChallengesWidget : UAthenaChallengesWidget {

	bool ShouldOutroAutomatically(); // Function FortniteUI.AthenaContextualChallengesWidget.ShouldOutroAutomatically // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a21468
	void OnResetOutroDelay(); // Function FortniteUI.AthenaContextualChallengesWidget.OnResetOutroDelay // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnNewContextualHeader(struct FText NewText); // Function FortniteUI.AthenaContextualChallengesWidget.OnNewContextualHeader // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void HandleToggleFullscreenMap(bool bFullscreenMapVisible); // Function FortniteUI.AthenaContextualChallengesWidget.HandleToggleFullscreenMap // (Final|Native|Protected) // @ game+0x6a20e48
	void HandleNewContextualObjectives(struct TArray<struct UFortQuestItem*> InContextualQuests); // Function FortniteUI.AthenaContextualChallengesWidget.HandleNewContextualObjectives // (Final|Native|Protected|HasOutParms) // @ game+0x6a20a98
	float GetOutroDelay(); // Function FortniteUI.AthenaContextualChallengesWidget.GetOutroDelay // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a206bc
};

// Class FortniteUI.AthenaCosmeticUnlockingInfo
// Size: 0x2e8 (Inherited: 0x288)
struct UAthenaCosmeticUnlockingInfo : UCommonUserWidget {
	struct UCommonRichTextBlock* RichText_StaticUnlockingText; // 0x288(0x08)
	struct UCommonRichTextBlock* RichText_UnlockingText; // 0x290(0x08)
	struct UProgressBar* ProgressBar_StepsCompleted; // 0x298(0x08)
	struct UCommonRichTextBlock* RichText_ProgressCompletion; // 0x2a0(0x08)
	struct FString EmphasisStyle; // 0x2a8(0x10)
	struct FString ProgressCompletionNumericStyle; // 0x2b8(0x10)
	struct UAthenaCosmeticItemDefinition* CosmeticItemDef; // 0x2c8(0x08)
	char pad_2D0[0x18]; // 0x2d0(0x18)

	void ShowUnlockingInfoForCosmeticVariant(struct UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag InVariantChannel, struct FGameplayTag InVariant); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmeticVariant // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a21704
	void ShowUnlockingInfoForCosmetic(struct UAthenaCosmeticItemDefinition* InCosmeticItemDef); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfoForCosmetic // (Final|Native|Public|BlueprintCallable) // @ game+0x6a21668
	void ShowUnlockingInfo(struct UAthenaCosmeticItemDefinition* UnlockItem, struct UFortItemDefinition* UnlockSource); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x6a21574
	void ShowSeasonUnlockingInfo(int32_t SeasonNumber, int32_t TierNumber); // Function FortniteUI.AthenaCosmeticUnlockingInfo.ShowSeasonUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2148c
	void RequestUpdateAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestUpdateAnim // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void RequestOutroAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestOutroAnim // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void RequestIntroAnim(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.RequestIntroAnim // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OutroAnimFinished(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.OutroAnimFinished // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a21100
	void OnUnlockingInfoSet(bool bShowProgression); // Function FortniteUI.AthenaCosmeticUnlockingInfo.OnUnlockingInfoSet // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void HideUnlockingInfo(); // Function FortniteUI.AthenaCosmeticUnlockingInfo.HideUnlockingInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x6a20fb0
};

// Class FortniteUI.AthenaCountdownWidgetBase
// Size: 0x310 (Inherited: 0x2c8)
struct UAthenaCountdownWidgetBase : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x308(0x02)
	char pad_30A[0x6]; // 0x30a(0x06)

	void OnDisplayWarningMessage(struct FText FirstLineText, struct FText SecondLineText); // Function FortniteUI.AthenaCountdownWidgetBase.OnDisplayWarningMessage // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnCountdownUpdate(int32_t TimeRemaining, struct FText CountdownUpdateText); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownUpdate // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnCountdownStopped(); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStopped // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnCountdownStarted(int32_t TimeRemaining, struct FText CountdownIntroText); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownStarted // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnCountdownFinished(); // Function FortniteUI.AthenaCountdownWidgetBase.OnCountdownFinished // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleGamePhaseStepChanged(struct TScriptInterface<None> SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaCountdownWidgetBase.HandleGamePhaseStepChanged // (Final|Native|Protected|HasOutParms) // @ game+0x1ec855c
	void HandleCountdownUpdate(int32_t TimeRemaining); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownUpdate // (Final|Native|Protected) // @ game+0x6a20870
	void HandleCountdownStopped(); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStopped // (Final|Native|Protected) // @ game+0x6a2085c
	void HandleCountdownStarted(int32_t TimeRemaining); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownStarted // (Final|Native|Protected) // @ game+0x6a207c4
	void HandleCountdownFinished(); // Function FortniteUI.AthenaCountdownWidgetBase.HandleCountdownFinished // (Final|Native|Protected) // @ game+0x6a207b0
};

// Class FortniteUI.AthenaCreativeItemEntryObjectWrapper
// Size: 0x1b8 (Inherited: 0x28)
struct UAthenaCreativeItemEntryObjectWrapper : UObject {
	struct FFortItemEntry ItemEntry; // 0x28(0x190)
};

// Class FortniteUI.AthenaCreativeItemTileButton
// Size: 0xdc8 (Inherited: 0xc20)
struct UAthenaCreativeItemTileButton : UCommonButtonLegacy {
	char pad_C20[0x8]; // 0xc20(0x08)
	struct UAthenaCreativeItemTileView* ParentView; // 0xc28(0x08)
	struct UFortItemDefinition* ItemDefinition; // 0xc30(0x08)
	struct FFortItemEntry ItemEntry; // 0xc38(0x190)

	void OnLoadedItem(); // Function FortniteUI.AthenaCreativeItemTileButton.OnLoadedItem // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnEntryClick(struct UAthenaCreativeItemTileButton* Entry); // Function FortniteUI.AthenaCreativeItemTileButton.OnEntryClick // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	struct UAthenaCreativeItemEntryObjectWrapper* MakeFortItemEntryObjectWrapper(struct UObject* Target, struct FFortItemEntry InItemEntry); // Function FortniteUI.AthenaCreativeItemTileButton.MakeFortItemEntryObjectWrapper // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x6a20fc4
	int32_t GetItemTypeCount(); // Function FortniteUI.AthenaCreativeItemTileButton.GetItemTypeCount // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x6a20668
	bool CompareToItemEntry(struct FFortItemEntry InItemEntry); // Function FortniteUI.AthenaCreativeItemTileButton.CompareToItemEntry // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x6a2055c
};

// Class FortniteUI.AthenaCreativeItemTileView
// Size: 0x3a8 (Inherited: 0x390)
struct UAthenaCreativeItemTileView : UCommonTileView {
	struct UFortOptionsTab* ParentTab; // 0x390(0x08)
	struct UFortItem* CurrentlyFocusedItem; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)
};

// Class FortniteUI.AthenaCurieStatusWidget
// Size: 0x308 (Inherited: 0x2c8)
struct UAthenaCurieStatusWidget : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)

	void SetPlayerState(struct AFortPlayerStateAthena* PlayerState); // Function FortniteUI.AthenaCurieStatusWidget.SetPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x6a213cc
	void OnPlayerStatePawnChanged(); // Function FortniteUI.AthenaCurieStatusWidget.OnPlayerStatePawnChanged // (Final|Native|Protected) // @ game+0x6a210ec
	void OnCurieStateRemoved(struct FGameplayTag RemovedState); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateRemoved // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnCurieStateAdded(struct FGameplayTag AddedState); // Function FortniteUI.AthenaCurieStatusWidget.OnCurieStateAdded // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	bool HasState(struct FGameplayTag CurieState); // Function FortniteUI.AthenaCurieStatusWidget.HasState // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a20ee4
};

// Class FortniteUI.FortItemPickerBase
// Size: 0x3c8 (Inherited: 0x288)
struct UFortItemPickerBase : UCommonUserWidget {
	struct FMulticastInlineDelegate OnSelectionChangedEvent; // 0x288(0x10)
	char pad_298[0x18]; // 0x298(0x18)
	struct FMulticastInlineDelegate OnSelectionCommittedEvent; // 0x2b0(0x10)
	char pad_2C0[0x48]; // 0x2c0(0x48)
	struct FMulticastInlineDelegate OnItemHoveredEvent; // 0x308(0x10)
	char pad_318[0x18]; // 0x318(0x18)
	struct FMulticastInlineDelegate OnItemUnhovered; // 0x330(0x10)
	char pad_340[0x18]; // 0x340(0x18)
	struct UFortItemTileView* PickerTileView; // 0x358(0x08)
	struct UListView* ItemListViewWidget; // 0x360(0x08)
	char pad_368[0x10]; // 0x368(0x10)
	bool bConfirmSelectionIfAlreadySelectedAfterOneClick; // 0x378(0x01)
	char pad_379[0x7]; // 0x379(0x07)
	struct UObject* NewlySelectedItem; // 0x380(0x08)
	struct TScriptInterface<None> ItemViewContext; // 0x388(0x10)
	char pad_398[0x30]; // 0x398(0x30)

	bool TryCommitSelectedItem(); // Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x6a82280
	void SetSelectedItem(struct UFortItem* ItemToSelect); // Function FortniteUI.FortItemPickerBase.SetSelectedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x6a821d0
	bool SetSelectedIndex(int32_t Index); // Function FortniteUI.FortItemPickerBase.SetSelectedIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x6a82128
	void OnItemSelectionScriptDelegate__DelegateSignature(struct UFortItem* SelectedItem); // DelegateFunction FortniteUI.FortItemPickerBase.OnItemSelectionScriptDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	bool IsNullItemExplicitlySelected(); // Function FortniteUI.FortItemPickerBase.IsNullItemExplicitlySelected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a81f34
	struct UFortItem* GetSelectedItem(); // Function FortniteUI.FortItemPickerBase.GetSelectedItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a81b14
	struct TScriptInterface<None> GetListViewInterface(); // Function FortniteUI.FortItemPickerBase.GetListViewInterface // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a81ac4
	int32_t GetIndexForItem(struct UFortItem* Item); // Function FortniteUI.FortItemPickerBase.GetIndexForItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a819c4
	void ClearSelection(); // Function FortniteUI.FortItemPickerBase.ClearSelection // (Final|Native|Public|BlueprintCallable) // @ game+0x6a81968
	void CenterSelectedItemTileWidget(); // Function FortniteUI.FortItemPickerBase.CenterSelectedItemTileWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x6a818fc
	bool CanItemBeComitted(struct UFortItem* ItemToCommit); // Function FortniteUI.FortItemPickerBase.CanItemBeComitted // (Final|Native|Public|BlueprintCallable) // @ game+0x6a81840
};

// Class FortniteUI.AthenaCustomizationPicker
// Size: 0x478 (Inherited: 0x3c8)
struct UAthenaCustomizationPicker : UFortItemPickerBase {
	struct FMulticastInlineDelegate OnCosmeticSelectionSaving; // 0x3c8(0x10)
	struct FMulticastInlineDelegate OnCosmeticSelectionSaved; // 0x3d8(0x10)
	struct FMulticastInlineDelegate OnShowSaveButton; // 0x3e8(0x10)
	struct FMulticastInlineDelegate OnHideSaveButton; // 0x3f8(0x10)
	struct UCommonButtonLegacy* FilterTabButtonType; // 0x408(0x08)
	struct UCommonButtonStyle* FilterTabButtonStyle; // 0x410(0x08)
	struct TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray; // 0x418(0x10)
	struct UFortTabListWidgetBase* FilterTabList; // 0x428(0x08)
	struct FName CurrentFilterName; // 0x430(0x08)
	char pad_438[0x10]; // 0x438(0x10)
	enum class EAthenaCustomizationCategory CustomizeCategory; // 0x448(0x01)
	char pad_449[0x3]; // 0x449(0x03)
	int32_t SubslotIndex; // 0x44c(0x04)
	bool bAllowUnownedItems; // 0x450(0x01)
	bool bAllowCommits; // 0x451(0x01)
	bool bOneItemPerSlot; // 0x452(0x01)
	char pad_453[0x15]; // 0x453(0x15)
	struct UFortItem* ItemListeningTo; // 0x468(0x08)
	struct UAthenaCosmeticAccountItem* LocalCampaignHeroItem; // 0x470(0x08)

	void SetFilter(struct FName FilterName); // Function FortniteUI.AthenaCustomizationPicker.SetFilter // (Final|Native|Public|BlueprintCallable) // @ game+0x6a21334
	void SearchText(struct FText Text); // Function FortniteUI.AthenaCustomizationPicker.SearchText // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a21270
	void RefreshView(bool CategoryChanging, bool FilterChanged, bool bSearchTextChanged); // Function FortniteUI.AthenaCustomizationPicker.RefreshView // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2111c
	void OnUpdateSaveButtonVisuals__DelegateSignature(); // DelegateFunction FortniteUI.AthenaCustomizationPicker.OnUpdateSaveButtonVisuals__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnSearchEnabled(bool bEnabled); // Function FortniteUI.AthenaCustomizationPicker.OnSearchEnabled // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnNoItemsAvailableInFilter(struct FText EmptyDisplayText); // Function FortniteUI.AthenaCustomizationPicker.OnNoItemsAvailableInFilter // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnItemsAvailableInFilter(); // Function FortniteUI.AthenaCustomizationPicker.OnItemsAvailableInFilter // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnCosmeticChangeSaveEvent__DelegateSignature(); // DelegateFunction FortniteUI.AthenaCustomizationPicker.OnCosmeticChangeSaveEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged); // Function FortniteUI.AthenaCustomizationPicker.HandleSelectedItemHasChanged // (Final|Native|Protected) // @ game+0x6a20b48
	void HandleFilterTabSelected(struct FName TabNameID); // Function FortniteUI.AthenaCustomizationPicker.HandleFilterTabSelected // (Final|Native|Private) // @ game+0x6a20a00
	void HandleFilterTabButtonCreated(struct FName TabNameID, struct UCommonButtonLegacy* TabButton); // Function FortniteUI.AthenaCustomizationPicker.HandleFilterTabButtonCreated // (Final|Native|Private) // @ game+0x6a20908
	void HandleDifferentFilterSetBP(); // Function FortniteUI.AthenaCustomizationPicker.HandleDifferentFilterSetBP // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	struct FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting); // Function FortniteUI.AthenaCustomizationPicker.GetQualifiedFilterDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a206d8
	void EndCustomizationCategory(); // Function FortniteUI.AthenaCustomizationPicker.EndCustomizationCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2063c
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory Category, int32_t SubslotToEdit, bool bInAllowUnownedItems, bool bInOneItemPerSlot); // Function FortniteUI.AthenaCustomizationPicker.BeginCustomizationCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x6a203c4
};

// Class FortniteUI.FortCosmeticItemTileButton
// Size: 0xc40 (Inherited: 0xc20)
struct UFortCosmeticItemTileButton : UCommonButtonLegacy {
	char pad_C20[0x8]; // 0xc20(0x08)
	struct UFortCosmeticItemCard* ItemWidget; // 0xc28(0x08)
	struct TWeakObjectPtr<struct UFortItem> Item; // 0xc30(0x08)
	float ItemCardWidth; // 0xc38(0x04)
	float MobileScalingFactor; // 0xc3c(0x04)
};

// Class FortniteUI.AthenaCustomizationPickerTileButton
// Size: 0xc60 (Inherited: 0xc40)
struct UAthenaCustomizationPickerTileButton : UFortCosmeticItemTileButton {
	char pad_C40[0x8]; // 0xc40(0x08)
	struct UFortBangWrapper_NUI* Bang; // 0xc48(0x08)
	struct UImage* Image_Favorite; // 0xc50(0x08)
	struct UImage* Image_ClassIcon; // 0xc58(0x08)

	void OnUpdateExclusiveWarning(bool bShouldWarn); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnUpdateExclusiveWarning // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnEquippedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnChangeOwnedState(bool bOwned); // Function FortniteUI.AthenaCustomizationPickerTileButton.OnChangeOwnedState // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaCustomizationScreen
// Size: 0xa80 (Inherited: 0x5b0)
struct UAthenaCustomizationScreen : UFortItemPreviewScreen {
	bool bCustomizationSelectionBeingProcessed; // 0x5b0(0x01)
	char pad_5B1[0x7]; // 0x5b1(0x07)
	struct FAthenaCustomizationParams CustomizationParams; // 0x5b8(0x48)
	enum class EAthenaCustomizationCategory InitialCustomizationCategory; // 0x600(0x01)
	char pad_601[0x7]; // 0x601(0x07)
	struct FText CategoryDisplayNames[0x16]; // 0x608(0x210)
	struct FText ItemTypeDisplayNames[0x16]; // 0x818(0x210)
	char pad_A28[0x18]; // 0xa28(0x18)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreenClass; // 0xa40(0x08)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreen; // 0xa48(0x08)
	char pad_A50[0x8]; // 0xa50(0x08)
	struct FDataTableRowHandle OpenNameLoadoutInputAction; // 0xa58(0x10)
	struct UWidgetAnimation* BoundAnim_Intro; // 0xa68(0x08)
	struct UWidgetAnimation* BoundAnim_Outro; // 0xa70(0x08)
	struct UFortCosmeticLoadoutSelector* LoadoutSelector; // 0xa78(0x08)

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32_t SlotIndex, bool bCanShowEmpty); // Function FortniteUI.AthenaCustomizationScreen.ShowLockerSlot // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a22f44
	void ShiftItemsVariantOption(struct UAthenaCosmeticAccountItem* Item, int32_t VariantChannelIndex); // Function FortniteUI.AthenaCustomizationScreen.ShiftItemsVariantOption // (Final|Native|Protected|BlueprintCallable) // @ game+0x3db7d40
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed); // Function FortniteUI.AthenaCustomizationScreen.SetCustomizationSelectionBeingProcessed // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a22d44
	void OnLoadoutChanged(); // Function FortniteUI.AthenaCustomizationScreen.OnLoadoutChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	struct FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreen.GetItemTypeDisplayNames // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a21ff8
	struct UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32_t SubslotIndex); // Function FortniteUI.AthenaCustomizationScreen.GetFavoriteItemForCategory // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a21e08
	struct FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreen.GetCategoryDisplayName // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a21c30
};

// Class FortniteUI.AthenaCustomizationScreenBase
// Size: 0xcb0 (Inherited: 0x5b0)
struct UAthenaCustomizationScreenBase : UFortItemPreviewScreen {
	bool bCustomizationSelectionBeingProcessed; // 0x5b0(0x01)
	char pad_5B1[0x7]; // 0x5b1(0x07)
	struct FAthenaCustomizationParams CustomizationParams; // 0x5b8(0x48)
	enum class EAthenaCustomizationCategory FirstCustomizationCategory; // 0x600(0x01)
	char pad_601[0x15f]; // 0x601(0x15f)
	struct FText CategoryDisplayNames[0x16]; // 0x760(0x210)
	struct FText ItemTypeDisplayNames[0x16]; // 0x970(0x210)
	char pad_B80[0x30]; // 0xb80(0x30)
	struct UAthenaItemSelectorScreenBase* ItemSelectorScreenClass; // 0xbb0(0x08)
	struct UFortActivatablePanel* LoadoutSelectorScreenClass; // 0xbb8(0x08)
	struct UFortBannerSelectModal* BannerSelectModalClass; // 0xbc0(0x08)
	struct UFortNameLoadoutPopup* NameLoadoutPopupClass; // 0xbc8(0x08)
	struct UFortProgressModal* ProgressModalClass; // 0xbd0(0x08)
	struct UFortProgressModal* ProgressModalInstance; // 0xbd8(0x08)
	char pad_BE0[0x8]; // 0xbe0(0x08)
	struct UAthenaCustomizationSlotSelectorButton* LastHoveredSlot; // 0xbe8(0x08)
	char pad_BF0[0x8]; // 0xbf0(0x08)
	struct FDataTableRowHandle OpenNameLoadoutInputAction; // 0xbf8(0x10)
	struct TArray<enum class EAthenaCustomizationCategory> BuiltInEmoteCategoryPriorities; // 0xc08(0x10)
	bool bDisplayBuiltInEmotesInEmoteRow; // 0xc18(0x01)
	char pad_C19[0x7]; // 0xc19(0x07)
	struct UWidgetAnimation* BoundAnim_Intro; // 0xc20(0x08)
	struct UWidgetAnimation* BoundAnim_Outro; // 0xc28(0x08)
	struct UWidget* Container_Loadouts_GodTileArea; // 0xc30(0x08)
	struct UCommonButtonLegacy* Button_Loadouts; // 0xc38(0x08)
	struct UCommonButtonLegacy* Button_SavePreset; // 0xc40(0x08)
	struct UCommonButtonLegacy* Button_RandomPresets; // 0xc48(0x08)
	struct UFortCosmeticLoadoutSelector* Loadout_Selector; // 0xc50(0x08)
	struct UFortCosmeticLoadoutCard* LoadoutCard_AppliedAnimation; // 0xc58(0x08)
	struct UPanelWidget* Panel_GearSlotRow; // 0xc60(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Pickaxe; // 0xc68(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Glider; // 0xc70(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_Contrail; // 0xc78(0x08)
	struct UAthenaCustomizationSlotSelectorButton* Slot_LoadingScreen; // 0xc80(0x08)
	struct UPanelWidget* Panel_EmoteSlotRow; // 0xc88(0x08)
	struct UPanelWidget* Panel_WrapSlotRow; // 0xc90(0x08)
	struct UPanelWidget* Panel_AccountSlotRow; // 0xc98(0x08)
	struct UFortBannerSlotButton* Banner_Button; // 0xca0(0x08)
	struct UAthenaLockerItemInfo* ItemInfo_Display; // 0xca8(0x08)

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32_t SlotIndex, bool bCanShowEmpty); // Function FortniteUI.AthenaCustomizationScreenBase.ShowLockerSlot // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a23084
	bool ShouldDisplayNextRandomPresetName(); // Function FortniteUI.AthenaCustomizationScreenBase.ShouldDisplayNextRandomPresetName // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a22f28
	void ShiftItemsVariantOption(struct UAthenaCosmeticAccountItem* Item, int32_t VariantChannelIndex); // Function FortniteUI.AthenaCustomizationScreenBase.ShiftItemsVariantOption // (Final|Native|Public|BlueprintCallable) // @ game+0x3db7d40
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed); // Function FortniteUI.AthenaCustomizationScreenBase.SetCustomizationSelectionBeingProcessed // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a22d44
	void OnRefreshForNewLoadout(struct FString LoadoutName, bool bIsShuffleTile); // Function FortniteUI.AthenaCustomizationScreenBase.OnRefreshForNewLoadout // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerToggledRandomPresets(bool bNowEnabled); // Function FortniteUI.AthenaCustomizationScreenBase.OnPlayerToggledRandomPresets // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnIntroAppliedPreset(); // Function FortniteUI.AthenaCustomizationScreenBase.OnIntroAppliedPreset // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnBeginSavingLoadouts(); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginSavingLoadouts // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnBeginPickingLoadouts(); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginPickingLoadouts // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnBeginPickingCustomizationSlot(struct UAthenaCustomizationSlotSelectorButton* SlotButton); // Function FortniteUI.AthenaCustomizationScreenBase.OnBeginPickingCustomizationSlot // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleInventoryUpdated(struct TSet<struct FString> ItemChangeFlags, int64_t ProfileRevision); // Function FortniteUI.AthenaCustomizationScreenBase.HandleInventoryUpdated // (Final|Native|Private|HasOutParms) // @ game+0x6a22444
	struct FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreenBase.GetItemTypeDisplayNames // (Final|Native|Public|BlueprintCallable) // @ game+0x6a220e4
	struct UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32_t SubslotIndex); // Function FortniteUI.AthenaCustomizationScreenBase.GetFavoriteItemForCategory // (Final|Native|Public|BlueprintCallable) // @ game+0x6a21f00
	struct FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory); // Function FortniteUI.AthenaCustomizationScreenBase.GetCategoryDisplayName // (Final|Native|Public|BlueprintCallable) // @ game+0x6a21d1c
};

// Class FortniteUI.AthenaCustomizationSlotSelectorButton
// Size: 0xce8 (Inherited: 0xc20)
struct UAthenaCustomizationSlotSelectorButton : UCommonButtonLegacy {
	struct FText CategoryDisplayName; // 0xc20(0x18)
	struct FText CategoryDescription; // 0xc38(0x18)
	enum class EAthenaCustomizationCategory CustomizationType; // 0xc50(0x01)
	char pad_C51[0x3]; // 0xc51(0x03)
	int32_t SubslotIndex; // 0xc54(0x04)
	enum class EFortBangType BangType; // 0xc58(0x01)
	bool bAllowUnownedItems; // 0xc59(0x01)
	bool bOneItemPerSlot; // 0xc5a(0x01)
	char pad_C5B[0x5]; // 0xc5b(0x05)
	struct UMaterialInstance* OverrideSlotImage; // 0xc60(0x08)
	struct UFortCosmeticItemCard* ItemWidget; // 0xc68(0x08)
	struct FGameplayTag RequiredSlotGameplayTag; // 0xc70(0x08)
	struct TSoftObjectPtr<struct UTexture2D> DefaultEmptyTexture; // 0xc78(0x28)
	float CardWidth; // 0xca0(0x04)
	char pad_CA4[0x24]; // 0xca4(0x24)
	struct UFortItem* LocalCampaignHeroPartItem; // 0xcc8(0x08)
	struct UImage* Image_Favorite; // 0xcd0(0x08)
	struct UImage* Image_ClassIcon; // 0xcd8(0x08)
	struct UFortBangWrapper_NUI* Bang_Wrapper; // 0xce0(0x08)

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32_t InSubslotIndex, struct FGameplayTag RequiredSlotTag); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCustomizationType // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a22de0
	void SetCardDefaultImageAndWidth(struct TSoftObjectPtr<struct UTexture2D> InDefaultImage, float InWidth); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.SetCardDefaultImageAndWidth // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a22c10
	void OnUpdateExclusiveWarning(bool bShouldWarn); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnUpdateExclusiveWarning // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCustomizationSlotActiveStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnCardImageAndWidthChanged(struct TSoftObjectPtr<struct UTexture2D> Image, float Width); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.OnCardImageAndWidthChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	bool IsSlotFilled(); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.IsSlotFilled // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x183e56c
	void HandleDifferentHeroLoadoutActivated(struct UFortMcpProfileCampaign* Profile); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.HandleDifferentHeroLoadoutActivated // (Final|Native|Private) // @ game+0x6a22288
	void GetCustomizationSlotActiveState(bool bOutAttachableCosmeticAvailable, bool bOutActive); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCustomizationSlotActiveState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e4d308
	struct UFortItem* GetCampaignHeroPartItem(); // Function FortniteUI.AthenaCustomizationSlotSelectorButton.GetCampaignHeroPartItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a21c18
};

// Class FortniteUI.AthenaDiscoverabilityBase
// Size: 0x320 (Inherited: 0x2c8)
struct UAthenaDiscoverabilityBase : UFortHUDElementWidget {
	char pad_2C8[0x48]; // 0x2c8(0x48)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x310(0x02)
	char pad_312[0x6]; // 0x312(0x06)
	struct UFortControllerComponent_MapDiscoverability* AssociatedComponent; // 0x318(0x08)

	void OnStompFailed(); // Function FortniteUI.AthenaDiscoverabilityBase.OnStompFailed // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnStompedByOtherWidget(); // Function FortniteUI.AthenaDiscoverabilityBase.OnStompedByOtherWidget // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void K2_OnBecomeInactive(); // Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeInactive // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void K2_OnBecomeActive(); // Function FortniteUI.AthenaDiscoverabilityBase.K2_OnBecomeActive // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void CommonArrivalEvent(struct FGameplayTag NewTag); // Function FortniteUI.AthenaDiscoverabilityBase.CommonArrivalEvent // (Native|Protected|HasOutParms) // @ game+0x6a21b74
};

// Class FortniteUI.AthenaDiscoveredAreaOverlay
// Size: 0x320 (Inherited: 0x320)
struct UAthenaDiscoveredAreaOverlay : UAthenaDiscoverabilityBase {

	void OnNewDiscovery(struct FText LocalizedLocationName, bool bIsNamedLocation); // Function FortniteUI.AthenaDiscoveredAreaOverlay.OnNewDiscovery // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaDuelOverlay
// Size: 0x368 (Inherited: 0x2c8)
struct UAthenaDuelOverlay : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)
	struct UCommonRichTextBlock* RichText_Title; // 0x308(0x08)
	struct UCommonRichTextBlock* RichText_SubTitle; // 0x310(0x08)
	struct UImage* Image_ChallengedNPCPortrait; // 0x318(0x08)
	struct UImage* Image_ElimPortrait; // 0x320(0x08)
	struct UImage* Image_Reward; // 0x328(0x08)
	struct TSoftObjectPtr<struct USoundBase> DuelStartedSound; // 0x330(0x28)
	char pad_358[0x8]; // 0x358(0x08)
	struct FFortPrioritizedWidgetData PrioritizedWidgetData; // 0x360(0x02)
	char pad_362[0x6]; // 0x362(0x06)

	void OnShowOverlay(); // Function FortniteUI.AthenaDuelOverlay.OnShowOverlay // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnSetupForActivation(enum class EDuelState DuelState, struct FFortColorPalette RarityColorPalette); // Function FortniteUI.AthenaDuelOverlay.OnSetupForActivation // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnOutroOverlay(); // Function FortniteUI.AthenaDuelOverlay.OnOutroOverlay // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleDuelUpdate(enum class EDuelState DuelState, struct FDuelOverlayData DuelOverlayData); // Function FortniteUI.AthenaDuelOverlay.HandleDuelUpdate // (Final|Native|Private|HasOutParms) // @ game+0x6a22324
};

// Class FortniteUI.AthenaMtxOfferButtonBase
// Size: 0xc70 (Inherited: 0xc20)
struct UAthenaMtxOfferButtonBase : UCommonButtonLegacy {
	char pad_C20[0x8]; // 0xc20(0x08)
	struct UFortStoreFrontOfferInfo* OfferData; // 0xc28(0x08)
	struct UCommonTextBlock* Text_MtxAmount; // 0xc30(0x08)
	struct UCommonTextBlock* Text_RealMoneyPrice; // 0xc38(0x08)
	struct UCommonVisibilitySwitcher* OptionalSwitcher_CurrencyIcons; // 0xc40(0x08)
	struct UImage* OptionalIMG_StarterKit; // 0xc48(0x08)
	struct UCommonLoadGuard* LoadGuardCurrencySpinner; // 0xc50(0x08)
	char pad_C58[0x18]; // 0xc58(0x18)

	void HandleMtxPurchaseComplete(bool bSuccess, struct TArray<struct FPurchasedItemInfo> PurchasedItems); // Function FortniteUI.AthenaMtxOfferButtonBase.HandleMtxPurchaseComplete // (Final|Native|Private|HasOutParms) // @ game+0x6a2f4d4
};

// Class FortniteUI.AthenaDynamicMtxOfferButton
// Size: 0xc78 (Inherited: 0xc70)
struct UAthenaDynamicMtxOfferButton : UAthenaMtxOfferButtonBase {
	struct UCommonTextBlock* Text_DynamicMtxAmount; // 0xc70(0x08)
};

// Class FortniteUI.AthenaReloadMtxScreenBase
// Size: 0x5f8 (Inherited: 0x5b0)
struct UAthenaReloadMtxScreenBase : UFortItemPreviewScreen {
	char pad_5B0[0x8]; // 0x5b0(0x08)
	struct UFortStoreFrontOfferInfo* OfferInfo; // 0x5b8(0x08)
	struct UCommonTextBlock* Text_AmountNeeded; // 0x5c0(0x08)
	char pad_5C8[0x10]; // 0x5c8(0x10)
	struct FDataTableRowHandle BackAction; // 0x5d8(0x10)
	struct UCommonButtonLegacy* Button_MobileClose; // 0x5e8(0x08)
	struct UAthenaSmallOfferPreviewBase* SmallOfferPreview_Widget; // 0x5f0(0x08)

	void HandleBackButton(bool bPassThrough); // Function FortniteUI.AthenaReloadMtxScreenBase.HandleBackButton // (Final|Native|Private|HasOutParms) // @ game+0x6a33500
};

// Class FortniteUI.AthenaDynamicReloadMtxScreen
// Size: 0x668 (Inherited: 0x5f8)
struct UAthenaDynamicReloadMtxScreen : UAthenaReloadMtxScreenBase {
	struct UCommonTextBlock* Text_TotalNeeded; // 0x5f8(0x08)
	struct UCommonTextBlock* Text_CurrentBalance; // 0x600(0x08)
	struct UCommonVisibilitySwitcher* Switcher_DynamicOptions; // 0x608(0x08)
	struct UAthenaStarterKitOfferButton* Button_StarterKitOption; // 0x610(0x08)
	struct UOverlay* Overlay_MtxRequired; // 0x618(0x08)
	struct UOverlay* Overlay_StarterKit; // 0x620(0x08)
	struct UAthenaDynamicMtxOfferButton* Button_MtxRequiredOption; // 0x628(0x08)
	struct UAthenaStaticMtxOfferButton* Button_MtxOtherOption; // 0x630(0x08)
	struct UCommonButtonLegacy* Button_MoreOptions; // 0x638(0x08)
	struct TArray<struct FName> StorefrontNames; // 0x640(0x10)
	struct UAthenaReloadMtxScreen* StaticReloadMtxScreen; // 0x650(0x08)
	struct UCommonButtonLegacy* MtxRequiredButtonToFocus; // 0x658(0x08)
	char pad_660[0x8]; // 0x660(0x08)

	struct UWidget* GetMtxRequiredButtonToFocus(enum class EUINavigation InNavigation); // Function FortniteUI.AthenaDynamicReloadMtxScreen.GetMtxRequiredButtonToFocus // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a221d0
};

// Class FortniteUI.AthenaEliminationIndicator
// Size: 0x520 (Inherited: 0x518)
struct UAthenaEliminationIndicator : UAthenaMarkedActorIndicator {
	char pad_518[0x8]; // 0x518(0x08)
};

// Class FortniteUI.AthenaEliminationOverlayBase
// Size: 0x260 (Inherited: 0x260)
struct UAthenaEliminationOverlayBase : UUserWidget {
};

// Class FortniteUI.AthenaEndGamePlacementWidget
// Size: 0x288 (Inherited: 0x288)
struct UAthenaEndGamePlacementWidget : UCommonUserWidget {

	void SetPlacement(int32_t NewPlacement); // Function FortniteUI.AthenaEndGamePlacementWidget.SetPlacement // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void Activate(); // Function FortniteUI.AthenaEndGamePlacementWidget.Activate // (Final|Native|Public|BlueprintCallable) // @ game+0x6a21b60
};

// Class FortniteUI.AthenaEquippedItemBase
// Size: 0x388 (Inherited: 0x310)
struct UAthenaEquippedItemBase : UBacchusHUDElement {
	enum class EEquippedWeaponDisplay CurrentMode; // 0x310(0x01)
	char pad_311[0xb]; // 0x311(0x0b)
	int32_t AmountConsideredInfinite; // 0x31c(0x04)
	struct UCommonVisibilitySwitcher* Switcher_Content; // 0x320(0x08)
	struct UPanelWidget* Panel_ResourceContent; // 0x328(0x08)
	struct UPanelWidget* Panel_AmmoContent; // 0x330(0x08)
	struct UPanelWidget* Panel_UtilityContent; // 0x338(0x08)
	struct UImage* Image_AmmoIcon; // 0x340(0x08)
	struct UImage* Image_ResourceIcon; // 0x348(0x08)
	struct UImage* Image_UtilityIcon; // 0x350(0x08)
	struct UCommonTextBlock* Text_MagazineAmmoCount; // 0x358(0x08)
	struct UCommonTextBlock* Text_SurplusAmmoCount; // 0x360(0x08)
	struct UCommonTextBlock* Text_ResourceCount; // 0x368(0x08)
	struct UCommonTextBlock* Text_UtilityAmmoCount; // 0x370(0x08)
	struct UCommonTextBlock* Text_OutOfAmmo; // 0x378(0x08)
	enum class ESlateVisibility WeaponEquipVisibility; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)

	void HandleWorldItemsChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleWorldItemsChanged // (Final|Native|Protected) // @ game+0x6a22bfc
	void HandleWeaponTargetingChanged(bool bIsTargeting); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponTargetingChanged // (Final|Native|Protected) // @ game+0x6a22b60
	void HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponReloadStarted // (Final|Native|Protected) // @ game+0x6a22a70
	void HandleWeaponReloadCancelled(); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponReloadCancelled // (Final|Native|Protected) // @ game+0x6a22a5c
	void HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponOverheatValueChanged // (Final|Native|Protected) // @ game+0x6a228c4
	void HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaEquippedItemBase.HandleWeaponEquipped // (Final|Native|Protected) // @ game+0x6a227dc
	void HandleViewTargetChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleViewTargetChanged // (Final|Native|Protected) // @ game+0x6a22274
	void HandleSecondaryFireReleased(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.HandleSecondaryFireReleased // (Final|Native|Protected) // @ game+0x6a22740
	void HandleSecondaryFirePressed(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.HandleSecondaryFirePressed // (Final|Native|Protected) // @ game+0x6a226a4
	void HandleLocalAmmoChanged(int32_t LocalCount, int32_t LocalRemaining); // Function FortniteUI.AthenaEquippedItemBase.HandleLocalAmmoChanged // (Final|Native|Protected) // @ game+0x6a225bc
	void HandleBuildingMaterialChanged(); // Function FortniteUI.AthenaEquippedItemBase.HandleBuildingMaterialChanged // (Final|Native|Protected) // @ game+0x6a22274
	void BP_HandleWeaponTargetingChanged(bool bIsTargeting); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleWeaponReloadStarted(float ReloadTime, enum class EFortWeaponReloadType ReloadType); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponReloadStarted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleWeaponReloadCancelled(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponReloadCancelled // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleWeaponOverheatValueChanged(float CurrentValue, float MaxValue, enum class EFortWeaponOverheatState State, bool bIsInCooldown); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponOverheatValueChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleWeaponModeChanged(enum class EEquippedWeaponDisplay Mode); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponModeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PrevWeapon); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleWeaponEquipped // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleSecondaryFireReleased(); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleSecondaryFireReleased // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleSecondaryFirePressed(); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleSecondaryFirePressed // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleResourceTypeChanged(struct UFortResourceItemDefinition* Item, int32_t ResourceCount); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleResourceTypeChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleResourceCountChanged(int32_t ResourceCount); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleResourceCountChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleHideReserveAmmoChanged(bool bHideReserveAmmo); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHideReserveAmmoChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleHasBulletsPerClipChanged(bool bHasBulletsPerClip); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHasBulletsPerClipChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleHasAmmoChanged(bool bHasAmmo); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleHasAmmoChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleAmmoCountChanged(int32_t MagazineAmmoCount, int32_t SurplusAmmoCount, int32_t TotalRemaining); // Function FortniteUI.AthenaEquippedItemBase.BP_HandleAmmoCountChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaEquippedItemInfoWidget
// Size: 0x3f8 (Inherited: 0x388)
struct UAthenaEquippedItemInfoWidget : UAthenaEquippedItemBase {
	char pad_388[0x70]; // 0x388(0x70)

	void OnExtensionWidgetAdded(struct UUserWidget* ExtensionWidget); // Function FortniteUI.AthenaEquippedItemInfoWidget.OnExtensionWidgetAdded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaEventGamesBase
// Size: 0x490 (Inherited: 0x490)
struct UAthenaEventGamesBase : UFortActivatablePanel {
};

// Class FortniteUI.AthenaEventScreenBase
// Size: 0x490 (Inherited: 0x490)
struct UAthenaEventScreenBase : UFortActivatablePanel {
};

// Class FortniteUI.AthenaEventMatchActiveGridScreenBase
// Size: 0x4b8 (Inherited: 0x490)
struct UAthenaEventMatchActiveGridScreenBase : UAthenaEventScreenBase {
	struct UAthenaEventMatchTeamWidgetBase* TeamWidgetClass; // 0x490(0x08)
	struct TArray<struct UAthenaEventMatchTeamWidgetBase*> ActiveTeams; // 0x498(0x10)
	int32_t MaxNumColumns; // 0x4a8(0x04)
	int32_t MaxTeamCount; // 0x4ac(0x04)
	int32_t MaxTeamSize; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)

	void OnTeamEliminated_BP(); // Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamEliminated_BP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void OnTeamEliminated(int32_t InSquadId); // Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamEliminated // (Final|Native|Private) // @ game+0x6a236b4
	void OnTeamChanged_BP(); // Function FortniteUI.AthenaEventMatchActiveGridScreenBase.OnTeamChanged_BP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaEventMatchEliminatedGridScreenBase
// Size: 0x4b8 (Inherited: 0x490)
struct UAthenaEventMatchEliminatedGridScreenBase : UAthenaEventScreenBase {
	struct UAthenaEventMatchTeamWidgetBase* TeamWidgetClass; // 0x490(0x08)
	struct TArray<struct UAthenaEventMatchTeamWidgetBase*> EliminatedTeams; // 0x498(0x10)
	int32_t MaxNumColumns; // 0x4a8(0x04)
	int32_t MaxTeamCount; // 0x4ac(0x04)
	int32_t MaxTeamSize; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)

	void OnTeamEliminated_BP(); // Function FortniteUI.AthenaEventMatchEliminatedGridScreenBase.OnTeamEliminated_BP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerEliminatedStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsEliminated); // Function FortniteUI.AthenaEventMatchEliminatedGridScreenBase.OnPlayerEliminatedStateChanged // (Final|Native|Private) // @ game+0x3d5beec
};

// Class FortniteUI.AthenaEventMatchPlayerWidgetBase
// Size: 0xc30 (Inherited: 0xc20)
struct UAthenaEventMatchPlayerWidgetBase : UCommonButtonLegacy {
	char pad_C20[0x8]; // 0xc20(0x08)
	struct TWeakObjectPtr<struct UAthenaRemotePlayerViewData> PlayerData; // 0xc28(0x08)

	void SetPlayerData(struct UAthenaRemotePlayerViewData* InPlayerData); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.SetPlayerData // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2374c
	void OnTeamColorChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct FLinearColor InTeamColor); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnTeamColorChanged // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0xda7c34
	void OnSquadIdChanged(struct UAthenaRemotePlayerViewData* InPlayerData, char InSquadId); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnSquadIdChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnShieldHealed(struct UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnShieldHealed // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnShieldDamaged(struct UAthenaRemotePlayerViewData* InPlayerData, float InShield, float InShieldMax); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnShieldDamaged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct AFortPlayerStateAthena* InPlayerState); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerPawnChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct AFortPlayerPawn* InPlayerPawn); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerPawnChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerNameChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct FString InPlayerName); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerNameChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerDataChanged(struct UAthenaRemotePlayerViewData* InPlayerData); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlayerDataChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPlaceChanged(struct UAthenaRemotePlayerViewData* InPlayerData, int32_t InPlace); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnPlaceChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnMaterialCountChanged(struct UAthenaRemotePlayerViewData* InPlayerData, int32_t InCount); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnMaterialCountChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnLocationChanged(struct UAthenaRemotePlayerViewData* InPlayerData, struct FString InLocation); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnLocationChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnKillScoreChanged(struct UAthenaRemotePlayerViewData* InPlayerData, int32_t InKillScore); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnKillScoreChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnIsReplayRelevancyPlayerChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsReplayRelevancyPlayer); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsReplayRelevancyPlayerChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnIsInRelevancyChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsInRelevancy); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsInRelevancyChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnIsFollowedPlayerChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsFollowedPlayer); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnIsFollowedPlayerChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnHealthHealed(struct UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnHealthHealed // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnHealthDamaged(struct UAthenaRemotePlayerViewData* InPlayerData, float InHealth, float InHealthMax); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnHealthDamaged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnDisconnectedChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bIsDisconnected); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDisconnectedChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnDeadStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bIsDead); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDeadStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnDBNOStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bIsDBNO); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnDBNOStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnBeingRevivedStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bIsBeingRevived); // Function FortniteUI.AthenaEventMatchPlayerWidgetBase.OnBeingRevivedStateChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase
// Size: 0xc30 (Inherited: 0xc30)
struct UAthenaEventMatchScoreboardPlayerWidgetBase : UAthenaEventMatchPlayerWidgetBase {

	void SetSquadIdVisible(bool InVisible); // Function FortniteUI.AthenaEventMatchScoreboardPlayerWidgetBase.SetSquadIdVisible // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaEventMatchScoreboardScreenBase
// Size: 0x4e8 (Inherited: 0x490)
struct UAthenaEventMatchScoreboardScreenBase : UAthenaEventScreenBase {
	struct FUIActionTag SortByElimsAction; // 0x490(0x08)
	char pad_498[0x4]; // 0x498(0x04)
	struct FUIActionTag SortByPlaceAction; // 0x49c(0x08)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	struct FDataTableRowHandle SortByEliminationsActionRowHandle; // 0x4a8(0x10)
	struct FDataTableRowHandle SortByPlaceActionRowHandle; // 0x4b8(0x10)
	struct TArray<struct UAthenaRemoteSquadViewData*> SquadDataArray; // 0x4c8(0x10)
	char pad_4D8[0x8]; // 0x4d8(0x08)
	struct UCommonListView* ScoreboardListView; // 0x4e0(0x08)

	void SetSquadIdsVisible_BP(bool bSquadIdsVisible); // Function FortniteUI.AthenaEventMatchScoreboardScreenBase.SetSquadIdsVisible_BP // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleSquadKillScoreChanged(struct UAthenaRemoteSquadViewData* InSquadData, int32_t InKillScore); // Function FortniteUI.AthenaEventMatchScoreboardScreenBase.HandleSquadKillScoreChanged // (Final|Native|Private) // @ game+0x1e4ad40
	void HandleSquadEliminated(struct UAthenaRemoteSquadViewData* InSquadData); // Function FortniteUI.AthenaEventMatchScoreboardScreenBase.HandleSquadEliminated // (Final|Native|Private) // @ game+0x2016d10
};

// Class FortniteUI.AthenaEventMatchScoreboardSquadWidget
// Size: 0x2d8 (Inherited: 0x2d0)
struct UAthenaEventMatchScoreboardSquadWidget : UAthenaEventMatchSquadWidgetBase {
	char pad_2D0[0x8]; // 0x2d0(0x08)
};

// Class FortniteUI.AthenaEventMatchStatusScreenBase
// Size: 0x4e0 (Inherited: 0x490)
struct UAthenaEventMatchStatusScreenBase : UAthenaEventScreenBase {
	char pad_490[0x50]; // 0x490(0x50)

	void UpdateTimeSinceLastKillText(struct FText TimeSinceLastKillText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateTimeSinceLastKillText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateSupplyDropsLootedText(struct FText SupplyDropsLootedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateSupplyDropsLootedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateShotsFiredText(struct FText ShotsFiredText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateShotsFiredText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdatePlayersRemainingText(struct FText PlayersRemainingText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePlayersRemainingText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdatePiecesDestroyedText(struct FText PiecesDestroyedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePiecesDestroyedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdatePiecesBuiltText(struct FText PiecesBuiltText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdatePiecesBuiltText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateMostKillsText(struct FText MostKillsText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMostKillsText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateMostKillsScore(struct FText MostKillsScore); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMostKillsScore // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateMatchTimeText(struct FText MatchTimeText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateMatchTimeText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateLongestEliminationText(struct FText LongestEliminationText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateLongestEliminationText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateLongestEliminationScore(struct FText LongestEliminationScore); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateLongestEliminationScore // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateGamePhaseTimeTitleText(struct FText GamePhaseTimeTitleText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseTimeTitleText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateGamePhaseTimeText(struct FText GamePhaseTimeText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseTimeText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateGamePhaseText(struct FText GamePhaseText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateGamePhaseText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateFastestKillText(struct FText FastestKillText, struct FText FastestKillTime); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateFastestKillText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateDamageTakenText(struct FText DamageTakenText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageTakenText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateDamageInflictedText(struct FText DamageInflictedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageInflictedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateDamageHealedText(struct FText DamageHealedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateDamageHealedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateCircleRadiusText(struct FText CircleRadiusText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateCircleRadiusText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateChestsLootedText(struct FText ChestsLootedText); // Function FortniteUI.AthenaEventMatchStatusScreenBase.UpdateChestsLootedText // (Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerKillScoreChanged(struct UAthenaRemotePlayerViewData* InPlayerData, int32_t InKillScore); // Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerKillScoreChanged // (Final|Native|Protected) // @ game+0x1e27c40
	void OnPlayerDeadStateChanged_BP(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead); // Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerDeadStateChanged_BP // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerDeadStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead); // Function FortniteUI.AthenaEventMatchStatusScreenBase.OnPlayerDeadStateChanged // (Final|Native|Protected) // @ game+0x1d2b6b8
};

// Class FortniteUI.AthenaEventMatchTeamWidgetBase
// Size: 0x2e8 (Inherited: 0x288)
struct UAthenaEventMatchTeamWidgetBase : UCommonUserWidget {
	struct TArray<struct UAthenaEventMatchPlayerWidgetBase*> PlayerWidgets; // 0x288(0x10)
	char SquadId; // 0x298(0x01)
	char pad_299[0x3]; // 0x299(0x03)
	struct FLinearColor TeamColor; // 0x29c(0x10)
	int32_t MaxTeamSize; // 0x2ac(0x04)
	struct UAthenaEventMatchPlayerWidgetBase* PlayerWidgetClass; // 0x2b0(0x08)
	char pad_2B8[0x18]; // 0x2b8(0x18)
	struct TArray<struct TWeakObjectPtr<struct UAthenaRemotePlayerViewData>> PlayerDatas; // 0x2d0(0x10)
	char pad_2E0[0x8]; // 0x2e0(0x08)

	void OnPlayerWidgetAdded(); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerWidgetAdded // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnPlayerDisconnectedChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDisconnected); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerDisconnectedChanged // (Final|Native|Private) // @ game+0x125bdb8
	void OnPlayerDeadStateChanged(struct UAthenaRemotePlayerViewData* InPlayerData, bool bInIsDead); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.OnPlayerDeadStateChanged // (Final|Native|Private) // @ game+0x125c794
	bool IsTeamDead(); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.IsTeamDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a23690
	int32_t GetTeamKills(); // Function FortniteUI.AthenaEventMatchTeamWidgetBase.GetTeamKills // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2366c
};

// Class FortniteUI.AthenaExclusiveRewardBanner
// Size: 0x2a8 (Inherited: 0x288)
struct UAthenaExclusiveRewardBanner : UCommonUserWidget {
	char pad_288[0x10]; // 0x288(0x10)
	struct UCommonRichTextBlock* RichText_RewardMessage; // 0x298(0x08)
	struct UFortLazyImage* Image_RewardIcon; // 0x2a0(0x08)

	void OnInitBannerIcon(struct UTexture2D* RewardIcon); // Function FortniteUI.AthenaExclusiveRewardBanner.OnInitBannerIcon // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnInitBanner(); // Function FortniteUI.AthenaExclusiveRewardBanner.OnInitBanner // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnClearBanner(); // Function FortniteUI.AthenaExclusiveRewardBanner.OnClearBanner // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaFeatTimelineListEntry
// Size: 0x2e8 (Inherited: 0x288)
struct UAthenaFeatTimelineListEntry : UCommonUserWidget {
	char pad_288[0x8]; // 0x288(0x08)
	struct UPanelWidget* Panel_FeatInfo; // 0x290(0x08)
	struct UPanelWidget* Panel_Date; // 0x298(0x08)
	struct UCommonButtonLegacy* SimpleButton_ClickArea; // 0x2a0(0x08)
	struct UCommonTextBlock* Text_FeatName; // 0x2a8(0x08)
	struct UCommonTextBlock* Text_FeatDescription; // 0x2b0(0x08)
	struct UFortLazyImage* LazyImage_QuestIcon; // 0x2b8(0x08)
	struct UCommonTextBlock* Text_CompletedTime; // 0x2c0(0x08)
	struct UCommonRichTextBlock* RichText_Date; // 0x2c8(0x08)
	char pad_2D0[0x10]; // 0x2d0(0x10)
	bool bIsHovered; // 0x2e0(0x01)
	char pad_2E1[0x7]; // 0x2e1(0x07)

	void UnHoverFeat(); // Function FortniteUI.AthenaFeatTimelineListEntry.UnHoverFeat // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnWaitingForCompletedTimer(); // Function FortniteUI.AthenaFeatTimelineListEntry.OnWaitingForCompletedTimer // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnTimespanInfoSet(int32_t NumDays); // Function FortniteUI.AthenaFeatTimelineListEntry.OnTimespanInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnFeatInfoSet(int32_t NumFeatsOnDay, int32_t IdxOnDay); // Function FortniteUI.AthenaFeatTimelineListEntry.OnFeatInfoSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnFeatCompletedThisSession(); // Function FortniteUI.AthenaFeatTimelineListEntry.OnFeatCompletedThisSession // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HoverFeat(); // Function FortniteUI.AthenaFeatTimelineListEntry.HoverFeat // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	struct FGameplayTag CalculateSourceTag(); // Function FortniteUI.AthenaFeatTimelineListEntry.CalculateSourceTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1f30414
};

// Class FortniteUI.AthenaFeatTimelineListView
// Size: 0x328 (Inherited: 0x220)
struct UAthenaFeatTimelineListView : UListViewBase {
	char pad_220[0xc0]; // 0x220(0xc0)
	float EntrySpacing; // 0x2e0(0x04)
	float EndSpacing; // 0x2e4(0x04)
	float DelayBeforeStartCompleted; // 0x2e8(0x04)
	float DelayBetweenCompletedItems; // 0x2ec(0x04)
	char pad_2F0[0x38]; // 0x2f0(0x38)
};

// Class FortniteUI.AthenaFPSBase
// Size: 0x2a8 (Inherited: 0x288)
struct UAthenaFPSBase : UCommonUserWidget {
	struct UCommonTextBlock* FPS; // 0x288(0x08)
	char pad_290[0x18]; // 0x290(0x18)

	void HandleShowFPSChanged(bool bInShowFPS); // Function FortniteUI.AthenaFPSBase.HandleShowFPSChanged // (Final|Native|Protected) // @ game+0x6a2497c
};

// Class FortniteUI.AthenaFrontEndMapPoiIcon
// Size: 0x2a0 (Inherited: 0x288)
struct UAthenaFrontEndMapPoiIcon : UCommonUserWidget {
	struct UCommonTextBlock* Text_PoiName; // 0x288(0x08)
	char pad_290[0x10]; // 0x290(0x10)

	void HandleTextChanged(bool bIsRedacted); // Function FortniteUI.AthenaFrontEndMapPoiIcon.HandleTextChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaFullScreenMapControlsWidget
// Size: 0x3b0 (Inherited: 0x320)
struct UAthenaFullScreenMapControlsWidget : UCommonActivatableWidget {
	char pad_320[0x20]; // 0x320(0x20)
	struct UCommonButtonLegacy* Button_ToggleQuestIcons; // 0x340(0x08)
	struct UCommonButtonLegacy* Button_ResetToPlayer; // 0x348(0x08)
	struct UCommonButtonLegacy* Button_Exit; // 0x350(0x08)
	struct UCommonTextBlock* Text_PlaceMarker; // 0x358(0x08)
	struct FText PlaceMarkerText; // 0x360(0x18)
	struct FText RemoveMarkerText; // 0x378(0x18)
	struct USizeBox* SizeBox_PlaceMarker; // 0x390(0x08)
	struct UCommonButtonLegacy* Button_SortToggle; // 0x398(0x08)
	struct UCommonButtonLegacy* Button_RemoveSelectedQuest; // 0x3a0(0x08)
	struct USizeBox* SizeBox_RemoveSelectedQuest; // 0x3a8(0x08)

	void BP_OnSortTypeTextChanged(struct FText TypeText); // Function FortniteUI.AthenaFullScreenMapControlsWidget.BP_OnSortTypeTextChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleToggleQuestIconsClicked(); // Function FortniteUI.AthenaFullScreenMapControlsWidget.BP_HandleToggleQuestIconsClicked // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaFullScreenMapPanel
// Size: 0x4d8 (Inherited: 0x458)
struct UAthenaFullScreenMapPanel : UCommonActivatablePanelLegacy {
	char pad_458[0x10]; // 0x458(0x10)
	struct UAthenaMapLayerContainer* MapLayerContainer; // 0x468(0x08)
	struct UContentWidget* Content_GameInfoSlot; // 0x470(0x08)
	struct FDataTableRowHandle ToggleMapMarkerRowHandle; // 0x478(0x10)
	SoftClassProperty SoftGameInfoClass; // 0x488(0x28)
	struct TSoftObjectPtr<struct UFortMarkerDetailsTable> SoftMarkerDetailsTable; // 0x4b0(0x28)

	void OnTransistionedFromAnotherMapPanel(); // Function FortniteUI.AthenaFullScreenMapPanel.OnTransistionedFromAnotherMapPanel // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaFullScreenQuestMapPanel
// Size: 0x4f0 (Inherited: 0x4d8)
struct UAthenaFullScreenQuestMapPanel : UAthenaFullScreenMapPanel {
	struct UAthenaMapGamePanel* QuestPanel; // 0x4d8(0x08)
	struct UAthenaFullScreenMapControlsWidget* ControlsPanel; // 0x4e0(0x08)
	float MapZoomOverride; // 0x4e8(0x04)
	char pad_4EC[0x4]; // 0x4ec(0x04)

	void HandleSortTypeTextChanged(struct FText TypeText); // Function FortniteUI.AthenaFullScreenQuestMapPanel.HandleSortTypeTextChanged // (Final|Native|Private|HasOutParms) // @ game+0x6a24a24
	void HandleRemoveSelectedQuestButtonClicked(); // Function FortniteUI.AthenaFullScreenQuestMapPanel.HandleRemoveSelectedQuestButtonClicked // (Final|Native|Private) // @ game+0x6a248c8
	void HandleControlsSortButtonClicked(); // Function FortniteUI.AthenaFullScreenQuestMapPanel.HandleControlsSortButtonClicked // (Final|Native|Private) // @ game+0x6a23a90
};

// Class FortniteUI.AthenaGadgetFuelWidget
// Size: 0x2b0 (Inherited: 0x288)
struct UAthenaGadgetFuelWidget : UCommonUserWidget {
	struct TWeakObjectPtr<struct UAthenaGadgetItemDefinition> AthenaGadgetItemDefinition; // 0x288(0x08)
	enum class EFortFuelGadgetVisualType FortFuelGadgetVisualType; // 0x290(0x01)
	char pad_291[0x7]; // 0x291(0x07)
	struct UImage* FuelGaugeProgressImage; // 0x298(0x08)
	struct UCommonNumericTextBlock* CurrentChargesText; // 0x2a0(0x08)
	char pad_2A8[0x8]; // 0x2a8(0x08)

	void SetItem(struct UFortWorldItem* Item); // Function FortniteUI.AthenaGadgetFuelWidget.SetItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x1bc4338
};

// Class FortniteUI.AthenaGameFeatureStatus
// Size: 0x348 (Inherited: 0x288)
struct UAthenaGameFeatureStatus : UCommonUserWidget {
	struct FText ProgressStatusToastTitle; // 0x288(0x18)
	enum class EFortGameFeature GameFeature; // 0x2a0(0x01)
	bool bExtendedDisplay; // 0x2a1(0x01)
	char pad_2A2[0x6]; // 0x2a2(0x06)
	struct FText ExtendedDisplayText; // 0x2a8(0x18)
	struct TSoftObjectPtr<struct UObject> DownloadingIconAsset; // 0x2c0(0x28)
	struct TSoftObjectPtr<struct UObject> InitialToastNotificationIcon; // 0x2e8(0x28)
	struct FName DownloadingIconMaterialParam; // 0x310(0x08)
	struct UFortLazyImage* Image_DownloadingIcon; // 0x318(0x08)
	struct UCommonNumericTextBlock* Text_ProgressPercent; // 0x320(0x08)
	struct UCommonTextBlock* Text_ExtendedDisplayText; // 0x328(0x08)
	char pad_330[0x18]; // 0x330(0x18)

	void OnStatusChanged(enum class EAthenaGameFeatureStatus NewStatus); // Function FortniteUI.AthenaGameFeatureStatus.OnStatusChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaGameOverDisplay
// Size: 0x528 (Inherited: 0x490)
struct UAthenaGameOverDisplay : UFortActivatablePanel {
	struct UFortMatchStatsScreen* MatchStatsClass; // 0x490(0x08)
	char pad_498[0x20]; // 0x498(0x20)
	struct FDataTableRowHandle Input_ReturnToLobby; // 0x4b8(0x10)
	struct FDataTableRowHandle Input_NextTeammate; // 0x4c8(0x10)
	struct FDataTableRowHandle Input_PreviousTeammate; // 0x4d8(0x10)
	struct FDataTableRowHandle Input_ReportPlayer; // 0x4e8(0x10)
	struct FDataTableRowHandle Input_ToggleBattleMap; // 0x4f8(0x10)
	struct FDataTableRowHandle Input_ForceStartPostGame; // 0x508(0x10)
	struct UEliminatedOverlay* EliminatedOverlay; // 0x518(0x08)
	struct UCommonButtonLegacy* Button_Highlights; // 0x520(0x08)

	void OnWinningScoreDetermined(int32_t Score); // Function FortniteUI.AthenaGameOverDisplay.OnWinningScoreDetermined // (Final|Native|Protected) // @ game+0x6a25c0c
	void OnWinnerAnnounced(struct FString Winner); // Function FortniteUI.AthenaGameOverDisplay.OnWinnerAnnounced // (Final|Native|Protected) // @ game+0x6a25b58
	void OnViewTargetChanged(); // Function FortniteUI.AthenaGameOverDisplay.OnViewTargetChanged // (Final|Native|Protected) // @ game+0x6a25a5c
	void OnToggleFullscreenMap(bool bFullscreenMapVisible); // Function FortniteUI.AthenaGameOverDisplay.OnToggleFullscreenMap // (Final|Native|Protected) // @ game+0x6a259b4
	void OnSpectatorStreamingChanged(bool bSpectatorStreaming); // Function FortniteUI.AthenaGameOverDisplay.OnSpectatorStreamingChanged // (Final|Native|Protected) // @ game+0x6a259b4
	void OnSpecialActorListChanged(); // Function FortniteUI.AthenaGameOverDisplay.OnSpecialActorListChanged // (Final|Native|Protected) // @ game+0x6a25a48
	void OnRessurectingNowDelegate(bool bRessurectingNow); // Function FortniteUI.AthenaGameOverDisplay.OnRessurectingNowDelegate // (Final|Native|Protected) // @ game+0x6a259b4
	void OnPlayerOrTeamWon(); // Function FortniteUI.AthenaGameOverDisplay.OnPlayerOrTeamWon // (Final|Native|Public|BlueprintCallable) // @ game+0x6a259a0
	void OnPlayerLost(enum class EEndOfMatchReason LostReason); // Function FortniteUI.AthenaGameOverDisplay.OnPlayerLost // (Final|Native|Public|BlueprintCallable) // @ game+0x6a25908
	void OnPlaceChanged(); // Function FortniteUI.AthenaGameOverDisplay.OnPlaceChanged // (Final|Native|Protected) // @ game+0x6a258ec
	void OnPawnDied(struct FFortPlayerDeathReport DeathReport); // Function FortniteUI.AthenaGameOverDisplay.OnPawnDied // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a25828
	void OnKillFeedUpdated(); // Function FortniteUI.AthenaGameOverDisplay.OnKillFeedUpdated // (Final|Native|Protected) // @ game+0x6a25674
	void InGameMatchmakingComplete(bool bSuccess); // Function FortniteUI.AthenaGameOverDisplay.InGameMatchmakingComplete // (Final|Native|Protected) // @ game+0x6a25538
	void HighlightCountChanged(int32_t HighlightCount); // Function FortniteUI.AthenaGameOverDisplay.HighlightCountChanged // (Final|Native|Protected) // @ game+0x6a254a0
	void HandleToggledBattleMapLive(struct ABattleMapPawnLive* NewSpectatorPawn); // Function FortniteUI.AthenaGameOverDisplay.HandleToggledBattleMapLive // (Final|Native|Protected) // @ game+0x6a24bf4
};

// Class FortniteUI.AthenaGenericHUDTimerWidgetBase
// Size: 0x2e8 (Inherited: 0x2c8)
struct UAthenaGenericHUDTimerWidgetBase : UFortHUDElementWidget {
	char pad_2C8[0x10]; // 0x2c8(0x10)
	struct UTextBlock* TimeText; // 0x2d8(0x08)
	char pad_2E0[0x8]; // 0x2e0(0x08)

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase); // Function FortniteUI.AthenaGenericHUDTimerWidgetBase.HandleGamePhaseChanged // (Final|Native|Protected) // @ game+0x6a23de4
};

// Class FortniteUI.AthenaHUDSituationalFeedback
// Size: 0x2d8 (Inherited: 0x2c8)
struct UAthenaHUDSituationalFeedback : UFortHUDElementWidget {
	struct UFortDynamicEntryBox* EntryBox_Feedback; // 0x2c8(0x08)
	bool bPrecreateFeedbackEntries; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
};

// Class FortniteUI.AthenaGenericKeyBindsFeedback
// Size: 0x330 (Inherited: 0x2d8)
struct UAthenaGenericKeyBindsFeedback : UAthenaHUDSituationalFeedback {
	struct TMap<struct FName, struct FText> GenericActions; // 0x2d8(0x50)
	char pad_328[0x8]; // 0x328(0x08)

	void ReattachEmoteComponent(); // Function FortniteUI.AthenaGenericKeyBindsFeedback.ReattachEmoteComponent // (Final|Native|Private) // @ game+0x6a25f58
	void HandleWeaponHUDKeyActionUpdated(struct AFortWeapon* Weapon); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleWeaponHUDKeyActionUpdated // (Final|Native|Private) // @ game+0x6a2540c
	void HandleWeaponEquipped(struct AFortWeapon* NewWeapon, struct AFortWeapon* PreviousWeapon); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleWeaponEquipped // (Final|Native|Private) // @ game+0x6a2532c
	void HandleTetherChanged(bool bIsTethered); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleTetherChanged // (Final|Native|Private) // @ game+0x6a24b54
	void HandleSavedTabChanged(bool IsTabSaved); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleSavedTabChanged // (Final|Native|Private) // @ game+0x6a248dc
	void HandleKeybindsChanged(); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleKeybindsChanged // (Final|Native|Private) // @ game+0x6a23bf8
	void HandleGhostModeChanged(struct AFortPlayerControllerGameplay* GameplayPC, bool bEnteredGhostMode); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleGhostModeChanged // (Final|Native|Private) // @ game+0x6a24048
	void HandleGenericActionRemoved(struct FName ActionName); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleGenericActionRemoved // (Final|Native|Private) // @ game+0x6a23fb0
	void HandleGenericActionAdded(struct FName ActionName, struct FText DescriptionText); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleGenericActionAdded // (Final|Native|Private) // @ game+0x6a23e9c
	void HandleEnterExitVehicle(); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleEnterExitVehicle // (Final|Native|Private) // @ game+0x6a23bf8
	void HandleDBNOCarryPlayerChanged(bool bIsCarrying); // Function FortniteUI.AthenaGenericKeyBindsFeedback.HandleDBNOCarryPlayerChanged // (Final|Native|Private) // @ game+0x6a23b58
};

// Class FortniteUI.AthenaGiftReceivedPrompt
// Size: 0x3a0 (Inherited: 0x320)
struct UAthenaGiftReceivedPrompt : UCommonActivatableWidget {
	char pad_320[0x18]; // 0x320(0x18)
	struct UFortItemPresentationScreen* ItemPresentationScreenClass; // 0x338(0x08)
	struct TSoftObjectPtr<struct UMaterialInterface> GiftMaterial; // 0x340(0x28)
	struct UFortGiftBoxItem* GiftBoxItem; // 0x368(0x08)
	struct UFortItemReceivedHeaderBase* Widget_HeaderInfo; // 0x370(0x08)
	struct UCommonButtonLegacy* Button_Open; // 0x378(0x08)
	struct UCommonLazyImage* Image_GiftBox; // 0x380(0x08)
	char pad_388[0x18]; // 0x388(0x18)

	void OnGiftInfoPopulated(); // Function FortniteUI.AthenaGiftReceivedPrompt.OnGiftInfoPopulated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnCloseButtonClicked(); // Function FortniteUI.AthenaGiftReceivedPrompt.OnCloseButtonClicked // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleMessageTextFiltered(bool bSuccess, struct FString SanitizedMessage); // Function FortniteUI.AthenaGiftReceivedPrompt.HandleMessageTextFiltered // (Final|Native|Protected) // @ game+0x6a241e8
	void DismissPrompt(); // Function FortniteUI.AthenaGiftReceivedPrompt.DismissPrompt // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a23a64
};

// Class FortniteUI.AthenaGlobalCurrencyWidget
// Size: 0x290 (Inherited: 0x288)
struct UAthenaGlobalCurrencyWidget : UCommonUserWidget {
	struct UCommonNumericTextBlock* CurrencyTotalText; // 0x288(0x08)

	void HandleOnItemCountChanged(struct UFortItemDefinition* Definition, int32_t Delta); // Function FortniteUI.AthenaGlobalCurrencyWidget.HandleOnItemCountChanged // (Final|Native|Protected) // @ game+0x6a2439c
};

// Class FortniteUI.FortMessageReceivedScreen
// Size: 0x4b0 (Inherited: 0x490)
struct UFortMessageReceivedScreen : UFortActivatablePanel {
	struct FMulticastInlineDelegate OnMessageClosed; // 0x490(0x10)
	struct UFortGiftBoxItem* GiftBoxItem; // 0x4a0(0x08)
	struct UCommonLazyImage* GiftBoxImage; // 0x4a8(0x08)

	void OnGiftBoxSet(); // Function FortniteUI.FortMessageReceivedScreen.OnGiftBoxSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnFinalGiftingComplete__DelegateSignature(); // DelegateFunction FortniteUI.FortMessageReceivedScreen.OnFinalGiftingComplete__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	struct FText GetHeaderAssetString(struct FString Param); // Function FortniteUI.FortMessageReceivedScreen.GetHeaderAssetString // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a825a4
	struct FText GetBodyAssetString(struct FString Param); // Function FortniteUI.FortMessageReceivedScreen.GetBodyAssetString // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a824d0
};

// Class FortniteUI.AthenaGrantChallengeModal
// Size: 0x4d8 (Inherited: 0x4b0)
struct UAthenaGrantChallengeModal : UFortMessageReceivedScreen {
	struct TArray<struct UFortChallengeBundleItemDefinition*> BundleDefs; // 0x4b0(0x10)
	struct UCommonTextBlock* Text_ChallengeName; // 0x4c0(0x08)
	struct UCommonTextBlock* Text_ChallengeContext; // 0x4c8(0x08)
	struct UCommonTextBlock* Text_BodyCopy; // 0x4d0(0x08)

	void ShowNextChallengePopup(); // Function FortniteUI.AthenaGrantChallengeModal.ShowNextChallengePopup // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a26004
	void OnChallengeBundleSet(struct FFortChallengeSetStyle DisplayStyle); // Function FortniteUI.AthenaGrantChallengeModal.OnChallengeBundleSet // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaGroupChallengeTag
// Size: 0x268 (Inherited: 0x260)
struct UAthenaGroupChallengeTag : UUserWidget {
	struct UWidgetAnimation* Anim_Flash; // 0x260(0x08)

	void HandleOnToggleFullScreenMap(bool bIsMapVisible); // Function FortniteUI.AthenaGroupChallengeTag.HandleOnToggleFullScreenMap // (Final|Native|Private) // @ game+0x6a24650
};

// Class FortniteUI.AthenaHUDContext
// Size: 0x2e8 (Inherited: 0x30)
struct UAthenaHUDContext : UBlueprintContextBase {
	char pad_30[0x8]; // 0x30(0x08)
	struct FMulticastInlineDelegate OnLocalPlayerWon; // 0x38(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerDeathOnWin; // 0x48(0x10)
	struct FMulticastInlineDelegate OnLocalTeamWon; // 0x58(0x10)
	struct FMulticastInlineDelegate OnLocalTeamLost; // 0x68(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerLost; // 0x78(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerKilledPlayer; // 0x88(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerDBNOStateChanged; // 0x98(0x10)
	struct FMulticastInlineDelegate OnUIGameplayCue; // 0xa8(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerBeginSkydiving; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnAthenaAutoFireChanged; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnClientSettingsShowViewersChanged; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnAthenaGamePhaseChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnPlayerFiredWeapon; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnShowUrgentQuestMessage; // 0x108(0x10)
	struct FMulticastInlineDelegate OnDuelChange; // 0x118(0x10)
	struct FMulticastInlineDelegate OnLowPerformanceMode; // 0x128(0x10)
	struct FMulticastInlineDelegate OnPTTStateChange; // 0x138(0x10)
	struct FMulticastInlineDelegate OnCanPTTChange; // 0x148(0x10)
	struct FMulticastInlineDelegate ShowMobilePickerDelegate; // 0x158(0x10)
	struct FMulticastInlineDelegate OnPlayerNameChangeDelegate; // 0x168(0x10)
	struct FMulticastInlineDelegate OnResurrectingNowDelegate; // 0x178(0x10)
	struct FMulticastInlineDelegate OnAllWinnersAnnouncedDelegate; // 0x188(0x10)
	struct FMulticastInlineDelegate OnSignalQualityChangeDelegate; // 0x198(0x10)
	struct FMulticastInlineDelegate OnForwardStartedFalling; // 0x1a8(0x10)
	struct FMulticastInlineDelegate OnSpecialActorListChanged; // 0x1b8(0x10)
	char pad_1C8[0x18]; // 0x1c8(0x18)
	struct FMulticastInlineDelegate OnFireStopped; // 0x1e0(0x10)
	struct FMulticastInlineDelegate OnPostGameWidgetPlacementChange; // 0x1f0(0x10)
	struct FMulticastInlineDelegate OnForceStartPostGameFlow; // 0x200(0x10)
	struct FMulticastInlineDelegate OnQuickTimeEventWidgetStarted; // 0x210(0x10)
	struct FMulticastInlineDelegate OnQuickTimeEventWidgetStopped; // 0x220(0x10)
	struct FMulticastInlineDelegate OnQuickTimeEventFeedbackWidget; // 0x230(0x10)
	struct FMulticastInlineDelegate OnForceAllQuickbarsMinimizedChanged; // 0x240(0x10)
	struct FMulticastInlineDelegate OnPlaylistExtensionWidgetCreatedNotSupported; // 0x250(0x10)
	struct FMulticastInlineDelegate OnClearPlaylistExtensionWidgetNotSupported; // 0x260(0x10)
	struct TWeakObjectPtr<struct UWidget> MoveButtonWidgetPtr; // 0x270(0x08)
	struct FAthenaWinnerInfo WinnerInfo; // 0x278(0x20)
	bool bMoveButtonMode; // 0x298(0x01)
	bool bPendingAttachToHUD; // 0x299(0x01)
	bool bLocalPlayerWonMatch; // 0x29a(0x01)
	char pad_29B[0x5]; // 0x29b(0x05)
	struct AFortPlayerPawnAthena* BoundPlayerPawn; // 0x2a0(0x08)
	struct UAthenaPlayerViewModel* PlayerViewModel; // 0x2a8(0x08)
	char pad_2B0[0x38]; // 0x2b0(0x38)

	float VictoryStingerTimeUntilFadeOut(); // Function FortniteUI.AthenaHUDContext.VictoryStingerTimeUntilFadeOut // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a28fa0
	bool UseTapToShoot(); // Function FortniteUI.AthenaHUDContext.UseTapToShoot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a28f74
	void UseOrRleoadFromHUDStop(); // Function FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStop // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28f48
	void UseOrRleoadFromHUDStart(); // Function FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStart // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28f1c
	void UpdateSelectedWidgetMoveOffsetVector(struct FVector2D VectorOffset, float fMoveScale); // Function FortniteUI.AthenaHUDContext.UpdateSelectedWidgetMoveOffsetVector // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x6a28e20
	void TryBestUseForActor(struct AActor* ActorToUse); // Function FortniteUI.AthenaHUDContext.TryBestUseForActor // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28d4c
	void TakeMovementInputFromHUD(struct FVector2D MoveVector); // Function FortniteUI.AthenaHUDContext.TakeMovementInputFromHUD // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x6a28cb8
	void TakeLookStickInputFromHUD(struct FVector2D LookStickPosition); // Function FortniteUI.AthenaHUDContext.TakeLookStickInputFromHUD // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x6a28c24
	void TakeLookInputFromHUD(struct FRotator LookRotator); // Function FortniteUI.AthenaHUDContext.TakeLookInputFromHUD // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x6a28b7c
	void TakeItemSelectionInputFromHUD(int32_t TouchIndex, int32_t SlotIdx, bool bIsUsing, enum class EFortQuickBars InQuickBar, bool bReloadOrUseIfAlreadySelected, bool bStopUseImmediately); // Function FortniteUI.AthenaHUDContext.TakeItemSelectionInputFromHUD // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a28928
	void SwitchToPrimaryQuickbar(); // Function FortniteUI.AthenaHUDContext.SwitchToPrimaryQuickbar // (Final|Native|Public|BlueprintCallable) // @ game+0x6a288fc
	void SwapQuickBarFocusFromHUD(enum class EFortQuickBars InQuickBar, int32_t SlotOverride); // Function FortniteUI.AthenaHUDContext.SwapQuickBarFocusFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x6a287fc
	void StopTargettingFromHUD(); // Function FortniteUI.AthenaHUDContext.StopTargettingFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x6a287c4
	void StopItemSelectionInputFromHUD(int32_t TouchIndex, int32_t SlotIdx, enum class EFortQuickBars InQuickBar); // Function FortniteUI.AthenaHUDContext.StopItemSelectionInputFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28684
	void ShowUrgentQuestMessage(struct FUrgentQuestData UrgentQuestData); // Function FortniteUI.AthenaHUDContext.ShowUrgentQuestMessage // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a28574
	void ShowMobilePicker__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.ShowMobilePicker__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void ShowMobilePicker(); // Function FortniteUI.AthenaHUDContext.ShowMobilePicker // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28558
	void ShowMarkerGameModeMessage(int32_t PlayerID, int32_t InstanceID); // Function FortniteUI.AthenaHUDContext.ShowMarkerGameModeMessage // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x6a28450
	void ShowGameModeMessage(); // Function FortniteUI.AthenaHUDContext.ShowGameModeMessage // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x6a28420
	void ShowDuelUpdate(enum class EDuelState DuelState, struct FDuelOverlayData DuelOverlayData); // Function FortniteUI.AthenaHUDContext.ShowDuelUpdate // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a282e4
	bool ShouldVictoryUIPushEmoteInput(); // Function FortniteUI.AthenaHUDContext.ShouldVictoryUIPushEmoteInput // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a282ac
	bool ShouldPlayCustomEndScreenAtLoss(); // Function FortniteUI.AthenaHUDContext.ShouldPlayCustomEndScreenAtLoss // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a28274
	bool ShouldDisplayScoreUI(); // Function FortniteUI.AthenaHUDContext.ShouldDisplayScoreUI // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28250
	bool ShouldDisplayPlacement(); // Function FortniteUI.AthenaHUDContext.ShouldDisplayPlacement // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2822c
	bool ShouldAlwaysDisplaySquadInfo(); // Function FortniteUI.AthenaHUDContext.ShouldAlwaysDisplaySquadInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28208
	void SetTargetingToggleable(bool bNewValue); // Function FortniteUI.AthenaHUDContext.SetTargetingToggleable // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28158
	void SetSelectWidgetToMoveMode(bool bSet); // Function FortniteUI.AthenaHUDContext.SetSelectWidgetToMoveMode // (Final|Native|Public|BlueprintCallable) // @ game+0x6a28008
	void SetSelectedInventoryItem(struct UFortItem* Item); // Function FortniteUI.AthenaHUDContext.SetSelectedInventoryItem // (Final|Native|Public|BlueprintCallable) // @ game+0x6a280bc
	void SetResourceMaterial(enum class EFortResourceType NewMaterial); // Function FortniteUI.AthenaHUDContext.SetResourceMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27f68
	void SetPTTState(enum class EPTTState NewPushToTalkState); // Function FortniteUI.AthenaHUDContext.SetPTTState // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27e38
	void SetPostGameWidgetPlacement(struct FName WidgetPlacement); // Function FortniteUI.AthenaHUDContext.SetPostGameWidgetPlacement // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27ed0
	void SetLockOnStickCoords(struct FVector2D LockOnCoords); // Function FortniteUI.AthenaHUDContext.SetLockOnStickCoords // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x6a27dac
	void SetLocalPlayerWonMatch(bool bLocalPlayerWon); // Function FortniteUI.AthenaHUDContext.SetLocalPlayerWonMatch // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27d14
	void SelectWidgetToMove(struct UWidget* Widget); // Function FortniteUI.AthenaHUDContext.SelectWidgetToMove // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27bf4
	void ReloadFromHUD(); // Function FortniteUI.AthenaHUDContext.ReloadFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27bc8
	void PushGameOverEmoteInput(); // Function FortniteUI.AthenaHUDContext.PushGameOverEmoteInput // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27ba0
	void PTTStateChange__DelegateSignature(enum class EPTTState NewPushToTalkState); // DelegateFunction FortniteUI.AthenaHUDContext.PTTStateChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	bool OwnerOrWeaponHasTag(struct FGameplayTag InTag); // Function FortniteUI.AthenaHUDContext.OwnerOrWeaponHasTag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27af8
	void OnSpecialActorListChanged__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnSpecialActorListChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnSignalQualityChange__DelegateSignature(float NewQuality); // DelegateFunction FortniteUI.AthenaHUDContext.OnSignalQualityChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnShowUrgentQuestMessage__DelegateSignature(struct FUrgentQuestData UrgentQuestData, float EventTimeRemaining); // DelegateFunction FortniteUI.AthenaHUDContext.OnShowUrgentQuestMessage__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0xda7c34
	void OnResurrectingNow__DelegateSignature(bool bResurrectingNow); // DelegateFunction FortniteUI.AthenaHUDContext.OnResurrectingNow__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnReadyForWinnerInfoDisplay(); // Function FortniteUI.AthenaHUDContext.OnReadyForWinnerInfoDisplay // (Final|Native|Private) // @ game+0x6a27a80
	void OnQuickTimeEventWidgetStopped__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnQuickTimeEventWidgetStopped__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnQuickTimeEventWidgetStarted__DelegateSignature(float Duration, float SweetSpot, float PerfectTolerance, float GreatTolerance, float GoodTolerance); // DelegateFunction FortniteUI.AthenaHUDContext.OnQuickTimeEventWidgetStarted__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnQuickTimeEventFeedbackWidget__DelegateSignature(enum class EFortQuickTimeEventResult Result); // DelegateFunction FortniteUI.AthenaHUDContext.OnQuickTimeEventFeedbackWidget__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnPostGameWidgetPlacement__DelegateSignature(struct FName WidgetPlacement); // DelegateFunction FortniteUI.AthenaHUDContext.OnPostGameWidgetPlacement__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnPlaylistExtensionWidgetCreatedNotSupported__DelegateSignature(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* Widget); // DelegateFunction FortniteUI.AthenaHUDContext.OnPlaylistExtensionWidgetCreatedNotSupported__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnPlayerNameChange__DelegateSignature(struct FString NewName); // DelegateFunction FortniteUI.AthenaHUDContext.OnPlayerNameChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnPlayerFiredWeapon__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnPlayerFiredWeapon__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLowPerformanceMode__DelegateSignature(bool bInLowPerformanceMode); // DelegateFunction FortniteUI.AthenaHUDContext.OnLowPerformanceMode__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLocalTeamWon__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalTeamWon__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLocalTeamLost__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalTeamLost__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLocalPlayerWon__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerWon__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLocalPlayerLost__DelegateSignature(enum class EEndOfMatchReason LostReason); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerLost__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLocalPlayerKilledPlayer__DelegateSignature(struct AFortPlayerStateAthena* Player); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerKilledPlayer__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLocalPlayerDeathOnWin__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerDeathOnWin__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLocalPlayerDBNOStateChanged__DelegateSignature(bool bIsDBNO); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerDBNOStateChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnLocalPlayerBeginSkydiving__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnLocalPlayerBeginSkydiving__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnForwardStartedFalling__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnForwardStartedFalling__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnForceStartPostGameFlow__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnForceStartPostGameFlow__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnForceAllQuickbarsMinimizedChanged__DelegateSignature(bool bEnabled); // DelegateFunction FortniteUI.AthenaHUDContext.OnForceAllQuickbarsMinimizedChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnFireStopped__DelegateSignature(int32_t StopFireIndex); // DelegateFunction FortniteUI.AthenaHUDContext.OnFireStopped__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnDuelStarted__DelegateSignature(enum class EDuelState DuelState, struct FDuelOverlayData DuelOverlayData); // DelegateFunction FortniteUI.AthenaHUDContext.OnDuelStarted__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0xda7c34
	void OnClientSettingUpdatedShowViewers(); // Function FortniteUI.AthenaHUDContext.OnClientSettingUpdatedShowViewers // (Final|Native|Public) // @ game+0x6a27a64
	void OnClearPlaylistExtensionWidgetNotSupported__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnClearPlaylistExtensionWidgetNotSupported__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnCanPTTChange__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnCanPTTChange__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnAthenaSettingsApplied__DelegateSignature(); // DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaSettingsApplied__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnAthenaHUDAllWinnersAnnounced__DelegateSignature(struct FAthenaWinnerInfo WinnerInfo); // DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaHUDAllWinnersAnnounced__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0xda7c34
	void OnAthenaGamePhaseChanged__DelegateSignature(struct TScriptInterface<None> SafeZoneInterface, enum class EAthenaGamePhaseStep NewPhase); // DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaGamePhaseChanged__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0xda7c34
	void OnAthenaAutoFireChanged__DelegateSignature(bool bEntering); // DelegateFunction FortniteUI.AthenaHUDContext.OnAthenaAutoFireChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnAllWinnersAnnounced(); // Function FortniteUI.AthenaHUDContext.OnAllWinnersAnnounced // (Final|Native|Private) // @ game+0x14f8da4
	void JumpFromHudStart(int32_t TouchIndex); // Function FortniteUI.AthenaHUDContext.JumpFromHudStart // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27984
	void JumpFromHudEnd(); // Function FortniteUI.AthenaHUDContext.JumpFromHudEnd // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27970
	bool IsVictoryUICinematic(); // Function FortniteUI.AthenaHUDContext.IsVictoryUICinematic // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27938
	bool IsUsingScope(); // Function FortniteUI.AthenaHUDContext.IsUsingScope // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a278a0
	bool IsTargeting(); // Function FortniteUI.AthenaHUDContext.IsTargeting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27824
	bool IsShowViewerCountEnabled(); // Function FortniteUI.AthenaHUDContext.IsShowViewerCountEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27800
	bool IsRunningOnBattery(); // Function FortniteUI.AthenaHUDContext.IsRunningOnBattery // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a277dc
	bool IsOperatingTurret(); // Function FortniteUI.AthenaHUDContext.IsOperatingTurret // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2779c
	bool IsMovingSelectedWidget(); // Function FortniteUI.AthenaHUDContext.IsMovingSelectedWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27714
	bool IsInSelectWidgetToMoveMode(); // Function FortniteUI.AthenaHUDContext.IsInSelectWidgetToMoveMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a276fc
	bool IsInBuildMode(); // Function FortniteUI.AthenaHUDContext.IsInBuildMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a276bc
	bool IsFiringFromTouch(int32_t TouchIndex); // Function FortniteUI.AthenaHUDContext.IsFiringFromTouch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27618
	bool IsCurrentWeaponFiring(); // Function FortniteUI.AthenaHUDContext.IsCurrentWeaponFiring // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a275c4
	bool IsCurrentWeaponChargeable(); // Function FortniteUI.AthenaHUDContext.IsCurrentWeaponChargeable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a275a0
	bool IsCrouching(); // Function FortniteUI.AthenaHUDContext.IsCrouching // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27564
	bool IsAutoRunEnabled(); // Function FortniteUI.AthenaHUDContext.IsAutoRunEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27540
	bool IsActionBound(struct FName ActionName); // Function FortniteUI.AthenaHUDContext.IsActionBound // (Final|Native|Public|BlueprintCallable) // @ game+0x6a27498
	void HideGameModeMessage(); // Function FortniteUI.AthenaHUDContext.HideGameModeMessage // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x6a27468
	bool HasWifi(); // Function FortniteUI.AthenaHUDContext.HasWifi // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1fade60
	bool HasLockOnTarget(); // Function FortniteUI.AthenaHUDContext.HasLockOnTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27414
	bool HasFiringTouch(); // Function FortniteUI.AthenaHUDContext.HasFiringTouch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a273f8
	bool HasAutofireTarget(); // Function FortniteUI.AthenaHUDContext.HasAutofireTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a273d4
	void HandleUIGameplayCue(struct FName CueName, enum class EGameplayCueEvent EventType, struct FGameplayCueParameters Parameters); // Function FortniteUI.AthenaHUDContext.HandleUIGameplayCue // (Final|Native|Private|HasOutParms) // @ game+0x16b387c
	void HandleSpectatorViewTargetChanged(); // Function FortniteUI.AthenaHUDContext.HandleSpectatorViewTargetChanged // (Final|Native|Private) // @ game+0x6a273c0
	void HandleLocalPlayerDBNOStateChanged(struct AFortPawn* FortPawn, bool bIsDBNO); // Function FortniteUI.AthenaHUDContext.HandleLocalPlayerDBNOStateChanged // (Final|Native|Private) // @ game+0x26b4c20
	void HandleLocalPlayerBeginSkydiving(); // Function FortniteUI.AthenaHUDContext.HandleLocalPlayerBeginSkydiving // (Final|Native|Private) // @ game+0x6a273a4
	void HandleGamePhaseChange(struct TScriptInterface<None> SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaHUDContext.HandleGamePhaseChange // (Final|Native|Private|HasOutParms) // @ game+0x20a287c
	void GetWinnerText(struct FText ReturnText, struct FText WinnerName); // Function FortniteUI.AthenaHUDContext.GetWinnerText // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a2723c
	struct FText GetVictoryText(); // Function FortniteUI.AthenaHUDContext.GetVictoryText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a271cc
	struct USoundCue* GetVictoryStinger(); // Function FortniteUI.AthenaHUDContext.GetVictoryStinger // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27194
	enum class ETouchInteractMode GetTouchInteractMode(); // Function FortniteUI.AthenaHUDContext.GetTouchInteractMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27148
	int32_t GetSquadSize(); // Function FortniteUI.AthenaHUDContext.GetSquadSize // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a27100
	int32_t GetSquadConnectedCount(); // Function FortniteUI.AthenaHUDContext.GetSquadConnectedCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a270c0
	enum class EPTTState GetPTTState(); // Function FortniteUI.AthenaHUDContext.GetPTTState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27de964
	struct FString GetPlayerName(); // Function FortniteUI.AthenaHUDContext.GetPlayerName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2702c
	struct FLinearColor GetPlayerColor(); // Function FortniteUI.AthenaHUDContext.GetPlayerColor // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26fe0
	void GetLocalTime(int32_t Hours, int32_t Minutes); // Function FortniteUI.AthenaHUDContext.GetLocalTime // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26eb4
	bool GetLocalPlayerWonMatch(); // Function FortniteUI.AthenaHUDContext.GetLocalPlayerWonMatch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26e9c
	int32_t GetJumpPressedTouchIndex(); // Function FortniteUI.AthenaHUDContext.GetJumpPressedTouchIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26e84
	int32_t GetInteractPressedTouchIndex(); // Function FortniteUI.AthenaHUDContext.GetInteractPressedTouchIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26e6c
	bool GetInLowPerformanceMode(); // Function FortniteUI.AthenaHUDContext.GetInLowPerformanceMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x159cf2c
	struct UFortAthenaHUDInfoDataAsset* GetHUDInfoDataAsset(); // Function FortniteUI.AthenaHUDContext.GetHUDInfoDataAsset // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26e48
	struct FText GetGliderDisplayName(); // Function FortniteUI.AthenaHUDContext.GetGliderDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26dd8
	enum class EAthenaGamePhase GetGamePhase(); // Function FortniteUI.AthenaHUDContext.GetGamePhase // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26d9c
	float GetGameOverDelayTime(); // Function FortniteUI.AthenaHUDContext.GetGameOverDelayTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26d74
	SoftClassProperty GetCustomDBNOWidgetClass(); // Function FortniteUI.AthenaHUDContext.GetCustomDBNOWidgetClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26c74
	struct TSoftObjectPtr<struct UMaterialInterface> GetCustomDBNOReviveMaterial(); // Function FortniteUI.AthenaHUDContext.GetCustomDBNOReviveMaterial // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26b74
	bool GetCanPTT(); // Function FortniteUI.AthenaHUDContext.GetCanPTT // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27aa3b0
	struct TArray<struct FName> GetBoundActions(); // Function FortniteUI.AthenaHUDContext.GetBoundActions // (Final|Native|Public|BlueprintCallable) // @ game+0x6a26ae0
	float GetBatteryLevel(); // Function FortniteUI.AthenaHUDContext.GetBatteryLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8d268
	void ForwardOnSpecialActorListChanged(struct FSpecialActorRepData SpecialActorData); // Function FortniteUI.AthenaHUDContext.ForwardOnSpecialActorListChanged // (Final|Native|Private|HasOutParms) // @ game+0x6a26a30
	void ForceVictoryRoyaleUI(); // Function FortniteUI.AthenaHUDContext.ForceVictoryRoyaleUI // (Final|Native|Public) // @ game+0x6a26a10
	void ForceStartPostGameFlow(); // Function FortniteUI.AthenaHUDContext.ForceStartPostGameFlow // (Final|Native|Public|BlueprintCallable) // @ game+0x6a269fc
	void ForceFireFromHUDStop(); // Function FortniteUI.AthenaHUDContext.ForceFireFromHUDStop // (Final|Native|Public|BlueprintCallable) // @ game+0x6a269b8
	void FireFromHUDStop(int32_t TouchIndex, struct UWidget* DebugWidget); // Function FortniteUI.AthenaHUDContext.FireFromHUDStop // (Final|Native|Public|BlueprintCallable) // @ game+0x6a268d0
	void FireFromHUDStart(int32_t TouchIndex, struct UWidget* DebugWidget); // Function FortniteUI.AthenaHUDContext.FireFromHUDStart // (Final|Native|Public|BlueprintCallable) // @ game+0x6a267e8
	void ExecuteActionNameFromHUDWithEventType(struct FName ActionName, enum class EInputEvent KeyEvent); // Function FortniteUI.AthenaHUDContext.ExecuteActionNameFromHUDWithEventType // (Final|Native|Public|BlueprintCallable) // @ game+0x6a266fc
	void ExecuteActionNameFromHUD(struct FName ActionName); // Function FortniteUI.AthenaHUDContext.ExecuteActionNameFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2665c
	void EndUseFromHUD(); // Function FortniteUI.AthenaHUDContext.EndUseFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x6a26630
	void EnableAutoRunFromHUD(bool bEnable); // Function FortniteUI.AthenaHUDContext.EnableAutoRunFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x6a26594
	bool DoesPlaylistUIExtensionSlotContainWidget(enum class EUIExtensionSlot PlaylistSlot); // Function FortniteUI.AthenaHUDContext.DoesPlaylistUIExtensionSlotContainWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2649c
	float DisplayPlayerWonTime(); // Function FortniteUI.AthenaHUDContext.DisplayPlayerWonTime // (Final|Native|Public|BlueprintCallable) // @ game+0x6a26474
	void CycleQuickbar(); // Function FortniteUI.AthenaHUDContext.CycleQuickbar // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x6a2644c
	bool CanShootInVehicle(); // Function FortniteUI.AthenaHUDContext.CanShootInVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2640c
	bool CanCurrentWeaponAutoFireFromReticle(); // Function FortniteUI.AthenaHUDContext.CanCurrentWeaponAutoFireFromReticle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a263b4
	bool CanAutoRun(); // Function FortniteUI.AthenaHUDContext.CanAutoRun // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a26388
	void BeginUseFromHUD(); // Function FortniteUI.AthenaHUDContext.BeginUseFromHUD // (Final|Native|Public|BlueprintCallable) // @ game+0x6a26360
};

// Class FortniteUI.AthenaHUDFeedbackLine
// Size: 0x2d8 (Inherited: 0x2c8)
struct UAthenaHUDFeedbackLine : UFortHUDElementWidget {
	struct UFortKeybindWidget* Keybind_Feedback; // 0x2c8(0x08)
	struct UCommonRichTextBlock* RichText_Feedback; // 0x2d0(0x08)
};

// Class FortniteUI.AthenaHUDGamePhaseChangingBase
// Size: 0x318 (Inherited: 0x2c8)
struct UAthenaHUDGamePhaseChangingBase : UFortHUDElementWidget {
	char pad_2C8[0x40]; // 0x2c8(0x40)
	struct FFortPrioritizedWidgetData PrioritizationData; // 0x308(0x02)
	char pad_30A[0xe]; // 0x30a(0x0e)

	void HandleGamePhaseStepChanged(struct TScriptInterface<None> SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep); // Function FortniteUI.AthenaHUDGamePhaseChangingBase.HandleGamePhaseStepChanged // (Final|Native|Private|HasOutParms) // @ game+0x191998c
	void BP_UpdateMessaging(enum class EAthenaGamePhaseStep Step, struct FText Message, struct FText TimeText); // Function FortniteUI.AthenaHUDGamePhaseChangingBase.BP_UpdateMessaging // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void BP_HandleGamePhaseStepChanged(enum class EAthenaGamePhaseStep Step); // Function FortniteUI.AthenaHUDGamePhaseChangingBase.BP_HandleGamePhaseStepChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaHUDInputWidget
// Size: 0x288 (Inherited: 0x288)
struct UAthenaHUDInputWidget : UCommonUserWidget {
};

// Class FortniteUI.AthenaHUDMenu
// Size: 0x360 (Inherited: 0x288)
struct UAthenaHUDMenu : UCommonUserWidget {
	struct UOverlay* Overlay_AllContent; // 0x288(0x08)
	struct UFortDualBladeMenu* DualBladeMenu; // 0x290(0x08)
	struct UAthenaInventoryScreenContainer* InventoryScreenContainer; // 0x298(0x08)
	struct UCommonUserWidget* BottomBar; // 0x2a0(0x08)
	struct UCommonActivatableWidgetStack* WidgetStack_PrimaryContent; // 0x2a8(0x08)
	struct UWidget* Container_ServerShutdownTimer; // 0x2b0(0x08)
	struct UScaleBox* ScaleBox_Leto; // 0x2b8(0x08)
	struct FGameplayTagContainer HideOnMenuTags; // 0x2c0(0x20)
	struct FGameplayTagContainer TagsToShow; // 0x2e0(0x20)
	struct UAthenaGameOverDisplay* GameOverScreenClass; // 0x300(0x08)
	struct UFortPostGameScreenRoot* PostGameScreenRootClass; // 0x308(0x08)
	struct UFortPostGameScreenRoot* PostGameScreenRoot; // 0x310(0x08)
	bool bShowingGameOverScreen; // 0x318(0x01)
	bool bShowingWinnerScreen; // 0x319(0x01)
	bool bStartedPostGame; // 0x31a(0x01)
	char pad_31B[0x5]; // 0x31b(0x05)
	struct UAthenaGameOverDisplay* GameOverScreen; // 0x320(0x08)
	struct UUserWidget* InventoryPanelOverride; // 0x328(0x08)
	struct TArray<SoftClassProperty> UndismissableModalSoftClasses; // 0x330(0x10)
	struct TArray<struct UCommonActivatableWidget*> UndismissableModalClasses; // 0x340(0x10)
	char pad_350[0x10]; // 0x350(0x10)

	void StartPostGame(); // Function FortniteUI.AthenaHUDMenu.StartPostGame // (Final|Native|Public|BlueprintCallable) // @ game+0x6a29a4c
	void SetInventoryPanelOverride(struct UUserWidget* InInventoryPanelOverride); // Function FortniteUI.AthenaHUDMenu.SetInventoryPanelOverride // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2987c
	void RecoverFromPostGame(); // Function FortniteUI.AthenaHUDMenu.RecoverFromPostGame // (Final|Native|Public|BlueprintCallable) // @ game+0x6a29868
	void PostBindCheckConditions(); // Function FortniteUI.AthenaHUDMenu.PostBindCheckConditions // (Final|Native|Private) // @ game+0x1d463e0
	void OnWidgetStackCleared(); // Function FortniteUI.AthenaHUDMenu.OnWidgetStackCleared // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void NativeHandleCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, struct UUserWidget* CursorModeContentWidget); // Function FortniteUI.AthenaHUDMenu.NativeHandleCursorModeChanged // (Final|Native|Private) // @ game+0x1a7cb08
	void HandlePreviewScreenshotCameraActivated(bool bActivated); // Function FortniteUI.AthenaHUDMenu.HandlePreviewScreenshotCameraActivated // (Final|Native|Private) // @ game+0x6a29750
	void HandleMinigameStateChanged(struct AFortMinigame* Minigame, enum class EFortMinigameState MinigameState); // Function FortniteUI.AthenaHUDMenu.HandleMinigameStateChanged // (Final|Native|Private) // @ game+0x6a29668
	void HandleLocalPlayerRevived(); // Function FortniteUI.AthenaHUDMenu.HandleLocalPlayerRevived // (Final|Native|Private|BlueprintCallable) // @ game+0x6a29654
	void HandleLocalPlayerOrTeamWon(); // Function FortniteUI.AthenaHUDMenu.HandleLocalPlayerOrTeamWon // (Final|Native|Private|BlueprintCallable) // @ game+0x6a29640
	void HandleLocalPlayerLost(enum class EEndOfMatchReason LostReason); // Function FortniteUI.AthenaHUDMenu.HandleLocalPlayerLost // (Final|Native|Private) // @ game+0x6a295a8
	void HandleLocalPlayerDied(struct FFortPlayerDeathReport DeathReport); // Function FortniteUI.AthenaHUDMenu.HandleLocalPlayerDied // (Final|Native|Private|HasOutParms|BlueprintCallable) // @ game+0x6a294e4
	struct UAthenaGameOverDisplay* CreateOrShowGameOverScreen(); // Function FortniteUI.AthenaHUDMenu.CreateOrShowGameOverScreen // (Final|Native|Private|BlueprintCallable) // @ game+0x6a29280
	void ClearGameOverScreen(); // Function FortniteUI.AthenaHUDMenu.ClearGameOverScreen // (Final|Native|Private|BlueprintCallable) // @ game+0x6a2926c
	void BP_OnPostGameStarted(); // Function FortniteUI.AthenaHUDMenu.BP_OnPostGameStarted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void BP_OnPostGameEnded(); // Function FortniteUI.AthenaHUDMenu.BP_OnPostGameEnded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaHUDPlayerActionAlertBase
// Size: 0x2e8 (Inherited: 0x2c8)
struct UAthenaHUDPlayerActionAlertBase : UFortHUDElementWidget {
	char pad_2C8[0x20]; // 0x2c8(0x20)

	void RequestNextAlert(); // Function FortniteUI.AthenaHUDPlayerActionAlertBase.RequestNextAlert // (Final|Native|Protected|BlueprintCallable) // @ game+0x1bc3b40
	void BP_ShowAlert(enum class EAthenaPlayerActionAlert Alert, struct FText DetailText); // Function FortniteUI.AthenaHUDPlayerActionAlertBase.BP_ShowAlert // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void BP_OnAlertsCleared(); // Function FortniteUI.AthenaHUDPlayerActionAlertBase.BP_OnAlertsCleared // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.FortPrimaryContentInterface
// Size: 0x28 (Inherited: 0x28)
struct UFortPrimaryContentInterface : UInterface {
};

// Class FortniteUI.AthenaHUDPrimaryContentInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaHUDPrimaryContentInterface : UFortPrimaryContentInterface {
};

// Class FortniteUI.AthenaIGMPartyMemberWidget
// Size: 0x2b0 (Inherited: 0x288)
struct UAthenaIGMPartyMemberWidget : UCommonUserWidget {
	bool bIsLocalPlayerSlot; // 0x288(0x01)
	bool bIsInGameSlot; // 0x289(0x01)
	char pad_28A[0x6]; // 0x28a(0x06)
	struct UFortSocialAvatarIcon* AvatarIconWidget; // 0x290(0x08)
	struct USocialNameTextBlock* Text_SocialName; // 0x298(0x08)
	struct UFortVoiceChatStatusIcon* VoiceIcon_Status; // 0x2a0(0x08)
	struct UFortPartyMember* CachedPartyMember; // 0x2a8(0x08)

	void OnWidgetReset(); // Function FortniteUI.AthenaIGMPartyMemberWidget.OnWidgetReset // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnUserSet(); // Function FortniteUI.AthenaIGMPartyMemberWidget.OnUserSet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnNewReadiness(enum class EGameReadiness GameReadiness); // Function FortniteUI.AthenaIGMPartyMemberWidget.OnNewReadiness // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnNewLocation(enum class EFortPartyMemberLocation NewLocation); // Function FortniteUI.AthenaIGMPartyMemberWidget.OnNewLocation // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnIsPartyLeaderChanged(bool bIsPartyLeader); // Function FortniteUI.AthenaIGMPartyMemberWidget.OnIsPartyLeaderChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	bool IsPlayingFortnite(); // Function FortniteUI.AthenaIGMPartyMemberWidget.IsPlayingFortnite // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2980c
	bool IsEmptySlot(); // Function FortniteUI.AthenaIGMPartyMemberWidget.IsEmptySlot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a297f0
	bool GetIsLocalPlayerSlot(); // Function FortniteUI.AthenaIGMPartyMemberWidget.GetIsLocalPlayerSlot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3b54c38
	bool GetIsInGameSlot(); // Function FortniteUI.AthenaIGMPartyMemberWidget.GetIsInGameSlot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a292a4
};

// Class FortniteUI.AthenaIndicatorLayerBase
// Size: 0x398 (Inherited: 0x2c8)
struct UAthenaIndicatorLayerBase : UFortHUDElementWidget {
	struct UFortActorCanvas* GeneralIndicators; // 0x2c8(0x08)
	struct UFortActorCanvas* NameIndicators; // 0x2d0(0x08)
	struct UAthenaPlayerIndicatorBase* PlayerIndicatorClass; // 0x2d8(0x08)
	int32_t PlayerIndicatorPoolSize; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct FUserWidgetPool PlayerIndicatorWidgetPool; // 0x2e8(0x88)
	struct UAthenaPlayerViewModel* PlayerVM; // 0x370(0x08)
	struct USlateVectorArtData* TeamIndicatorMesh; // 0x378(0x08)
	bool bWasTargeting; // 0x380(0x01)
	char pad_381[0x17]; // 0x381(0x17)

	void OnTargetingChanged(bool bTargeting); // Function FortniteUI.AthenaIndicatorLayerBase.OnTargetingChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaInventoryContext
// Size: 0x90 (Inherited: 0x30)
struct UAthenaInventoryContext : UBlueprintContextBase {
	struct FMulticastInlineDelegate OnInventoryItemSelected; // 0x30(0x10)
	struct FMulticastInlineDelegate OnInventorySwapStarted; // 0x40(0x10)
	struct FMulticastInlineDelegate OnInventorySwapComplete; // 0x50(0x10)
	char pad_60[0x30]; // 0x60(0x30)

	void StartOrFinishSwap(int32_t SlotIndex); // Function FortniteUI.AthenaInventoryContext.StartOrFinishSwap // (Final|Native|Public|BlueprintCallable) // @ game+0x6a299b4
	void SetSelectedInventoryItem(struct UFortItem* Item); // Function FortniteUI.AthenaInventoryContext.SetSelectedInventoryItem // (Final|Native|Public|BlueprintCallable) // @ game+0x6a29918
	void OnAthenaInventorySwapStarted__DelegateSignature(int32_t SlotIndex); // DelegateFunction FortniteUI.AthenaInventoryContext.OnAthenaInventorySwapStarted__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnAthenaInventorySwapComplete__DelegateSignature(); // DelegateFunction FortniteUI.AthenaInventoryContext.OnAthenaInventorySwapComplete__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	void OnAthenaInventoryItemSelected__DelegateSignature(struct UFortItem* Item); // DelegateFunction FortniteUI.AthenaInventoryContext.OnAthenaInventoryItemSelected__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0xda7c34
	bool IsSwapping(); // Function FortniteUI.AthenaInventoryContext.IsSwapping // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a29854
	struct UFortItem* GetSelectedInventoryItem(); // Function FortniteUI.AthenaInventoryContext.GetSelectedInventoryItem // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a29338
	void CancelSwap(); // Function FortniteUI.AthenaInventoryContext.CancelSwap // (Final|Native|Public|BlueprintCallable) // @ game+0x6a29258
};

// Class FortniteUI.AthenaInventoryEquipButtonBase
// Size: 0xc48 (Inherited: 0xc20)
struct UAthenaInventoryEquipButtonBase : UCommonButtonLegacy {
	struct UFortMultiSizeItemCard* ItemWidget; // 0xc20(0x08)
	struct UWidget* EmptyImage; // 0xc28(0x08)
	int32_t SlotIndex; // 0xc30(0x04)
	char pad_C34[0x4]; // 0xc34(0x04)
	struct TArray<struct FVector2D> ButtonSizeBySlotUsage; // 0xc38(0x10)
};

// Class FortniteUI.AthenaItemElementWidgetBase
// Size: 0x290 (Inherited: 0x288)
struct UAthenaItemElementWidgetBase : UCommonUserWidget {
	char pad_288[0x8]; // 0x288(0x08)

	void SetItemToRepresent(struct UFortItem* ItemToRepresent); // Function FortniteUI.AthenaItemElementWidgetBase.SetItemToRepresent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x6a293ac
	void OnPreItemToRepresentChanged(struct UFortItem* ItemToRepresent); // Function FortniteUI.AthenaItemElementWidgetBase.OnPreItemToRepresentChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPostItemToRepresentChanged(struct UFortItem* ItemToRepresent); // Function FortniteUI.AthenaItemElementWidgetBase.OnPostItemToRepresentChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemRarityUpdated(enum class EFortRarity ItemRarity, struct FFortRarityItemData RarityItemData); // Function FortniteUI.AthenaItemElementWidgetBase.OnItemRarityUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	struct UFortItem* GetItemToRepresent(); // Function FortniteUI.AthenaItemElementWidgetBase.GetItemToRepresent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2a328
};

// Class FortniteUI.AthenaInventoryItemInfo
// Size: 0x378 (Inherited: 0x290)
struct UAthenaInventoryItemInfo : UAthenaItemElementWidgetBase {
	char pad_290[0x70]; // 0x290(0x70)
	struct UCommonTextBlock* Text_ItemName; // 0x300(0x08)
	struct UCommonTextBlock* Text_ItemDescription; // 0x308(0x08)
	struct UCommonTextBlock* Text_ItemRarity; // 0x310(0x08)
	struct UCommonTextBlock* Text_ItemCategory; // 0x318(0x08)
	struct UImage* Image_ItemCategory; // 0x320(0x08)
	struct UAthenaItemIcon* ItemIcon; // 0x328(0x08)
	struct UAthenaItemTierWidget* ItemTierWidget; // 0x330(0x08)
	struct UAthenaInventoryItemStatsWidget* ItemStatsWidget; // 0x338(0x08)
	struct FDataTableRowHandle InspectItemInputRowHandle; // 0x340(0x10)
	struct FText ItemRarityTextFormat; // 0x350(0x18)
	struct FName CategoryIconTextureParamName; // 0x368(0x08)
	char pad_370[0x8]; // 0x370(0x08)

	void OnOwnerDeactivated(); // Function FortniteUI.AthenaInventoryItemInfo.OnOwnerDeactivated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemRarityTextUpdated(); // Function FortniteUI.AthenaInventoryItemInfo.OnItemRarityTextUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemNameTextUpdated(); // Function FortniteUI.AthenaInventoryItemInfo.OnItemNameTextUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemDescriptionTextUpdated(); // Function FortniteUI.AthenaInventoryItemInfo.OnItemDescriptionTextUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemCategoryTextUpdated(); // Function FortniteUI.AthenaInventoryItemInfo.OnItemCategoryTextUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemCategoryIconUpdated(bool bHasCategoryIcon); // Function FortniteUI.AthenaInventoryItemInfo.OnItemCategoryIconUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnInspectItemInput(bool bPressed); // Function FortniteUI.AthenaInventoryItemInfo.OnInspectItemInput // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnExtensionWidgetAdded(struct UUserWidget* ExtensionWidget); // Function FortniteUI.AthenaInventoryItemInfo.OnExtensionWidgetAdded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleInventoryItemSelected(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaInventoryItemInfo.HandleInventoryItemSelected // (Final|Native|Private) // @ game+0x6a293ac
};

// Class FortniteUI.AthenaInventoryItemStatEntry
// Size: 0x2b8 (Inherited: 0x288)
struct UAthenaInventoryItemStatEntry : UCommonUserWidget {
	struct UCommonTextBlock* Text_StatName; // 0x288(0x08)
	struct UCommonTextBlock* Text_StatValue; // 0x290(0x08)
	struct UCommonTextBlock* Text_StatDeltaValue; // 0x298(0x08)
	struct FText StatDeltaTextFormat; // 0x2a0(0x18)

	void OnStatInitialized(float Value, float ComparisonValue, float MinValue, float MaxValue); // Function FortniteUI.AthenaInventoryItemStatEntry.OnStatInitialized // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemRaritySet(enum class EFortRarity ItemRarity, struct FFortRarityItemData RarityItemData); // Function FortniteUI.AthenaInventoryItemStatEntry.OnItemRaritySet // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaInventoryItemStatsWidget
// Size: 0x298 (Inherited: 0x288)
struct UAthenaInventoryItemStatsWidget : UCommonUserWidget {
	struct UDynamicEntryBox* EntryBox_Stats; // 0x288(0x08)
	struct UDataTable* ItemStatsBoundsTable; // 0x290(0x08)
};

// Class FortniteUI.AthenaInventoryItemTileButton
// Size: 0xc38 (Inherited: 0xc20)
struct UAthenaInventoryItemTileButton : UCommonButtonLegacy {
	char pad_C20[0x8]; // 0xc20(0x08)
	struct UAthenaItemIcon* ItemIcon; // 0xc28(0x08)
	char pad_C30[0x8]; // 0xc30(0x08)

	void OnItemChanged(struct UFortItem* Item); // Function FortniteUI.AthenaInventoryItemTileButton.OnItemChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	struct UFortItem* GetItemToRepresent(); // Function FortniteUI.AthenaInventoryItemTileButton.GetItemToRepresent // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a292bc
};

// Class FortniteUI.AthenaInventoryPanel
// Size: 0x598 (Inherited: 0x320)
struct UAthenaInventoryPanel : UCommonActivatableWidget {
	char pad_320[0x8]; // 0x320(0x08)
	struct FName TabNameID; // 0x328(0x08)
	struct FFortTabButtonLabelInfo TabButtonLabelInfo; // 0x330(0xa0)
	struct FFortTabButtonLabelInfo CreativeTabButtonLabelInfo; // 0x3d0(0xa0)
	struct UFortQuantitySelector* QuantitySelectorClass; // 0x470(0x08)
	struct UDataTable* StackSizeDataTable; // 0x478(0x08)
	struct FDataTableRowHandle DropItemInputRowHandle; // 0x480(0x10)
	struct FDataTableRowHandle DropAllInputRowHandle; // 0x490(0x10)
	struct FDataTableRowHandle DropStackInputRowHandle; // 0x4a0(0x10)
	struct FDataTableRowHandle DropHalfInputRowHandle; // 0x4b0(0x10)
	struct FText DropItemsText; // 0x4c0(0x18)
	struct FText ConfirmDropText; // 0x4d8(0x18)
	struct FText DropStackTextFormat; // 0x4f0(0x18)
	struct FGameplayTagContainer CurrencyItemTags; // 0x508(0x20)
	struct FGameplayTagContainer IngredientItemTags; // 0x528(0x20)
	struct UFortItemTileView* CurrencyView; // 0x548(0x08)
	struct UFortItemTileView* IngredientView; // 0x550(0x08)
	struct UFortItemTileView* ResourceView; // 0x558(0x08)
	struct UFortItemTileView* AmmoView; // 0x560(0x08)
	struct UAthenaQuickbarEditorBase* QuickbarEditor; // 0x568(0x08)
	struct TArray<struct UFortItemTileView*> InventorySections; // 0x570(0x10)
	char pad_580[0x18]; // 0x580(0x18)

	void HandleInventoryItemSelected(struct UFortItem* SelectedInventoryItem); // Function FortniteUI.AthenaInventoryPanel.HandleInventoryItemSelected // (Final|Native|Private) // @ game+0x6a29448
};

// Class FortniteUI.AthenaInventoryPanelContainer
// Size: 0x470 (Inherited: 0x320)
struct UAthenaInventoryPanelContainer : UCommonActivatableWidget {
	char pad_320[0x78]; // 0x320(0x78)
	struct FName TabNameID; // 0x398(0x08)
	struct FFortTabButtonLabelInfo TabButtonLabelInfo; // 0x3a0(0xa0)
	struct UCommonButtonLegacy* TabButtonClass; // 0x440(0x08)
	struct UFortTabListWidgetBase* TabList; // 0x448(0x08)
	struct UCommonWidgetSwitcherLegacy* Switcher_Tabs; // 0x450(0x08)
	struct UAthenaInventoryItemInfo* ItemInfoWidget; // 0x458(0x08)
	char pad_460[0x10]; // 0x460(0x10)

	void HandleInventoryTabChanged(struct UWidget* NewActiveWidget, int32_t WidgetIndex); // Function FortniteUI.AthenaInventoryPanelContainer.HandleInventoryTabChanged // (Final|Native|Private) // @ game+0x221187c
};

// Class FortniteUI.AthenaInventoryQuickBarSlotButton
// Size: 0xc50 (Inherited: 0xbe0)
struct UAthenaInventoryQuickBarSlotButton : UAthenaQuickBarSlotButtonBase {
	char pad_BE0[0x70]; // 0xbe0(0x70)

	void OnSwapStarted(); // Function FortniteUI.AthenaInventoryQuickBarSlotButton.OnSwapStarted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnSwapComplete(); // Function FortniteUI.AthenaInventoryQuickBarSlotButton.OnSwapComplete // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnExtensionWidgetAdded(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* ExtensionWidget); // Function FortniteUI.AthenaInventoryQuickBarSlotButton.OnExtensionWidgetAdded // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleInventorySwapStarted(int32_t SwapSlotIndex); // Function FortniteUI.AthenaInventoryQuickBarSlotButton.HandleInventorySwapStarted // (Final|Native|Private) // @ game+0x6a2a618
	void HandleInventorySwapComplete(); // Function FortniteUI.AthenaInventoryQuickBarSlotButton.HandleInventorySwapComplete // (Final|Native|Private) // @ game+0x6a2a5d0
};

// Class FortniteUI.AthenaInventoryScreenContainer
// Size: 0x5b8 (Inherited: 0x490)
struct UAthenaInventoryScreenContainer : UFortActivatablePanel {
	char pad_490[0x8]; // 0x490(0x08)
	SoftClassProperty MyIslandWidgetClass; // 0x498(0x28)
	SoftClassProperty CreativeInventoryWidgetClass; // 0x4c0(0x28)
	struct UCommonButtonLegacy* TabButtonClass; // 0x4e8(0x08)
	struct UFortCreativeItemListPanelData* ItemListPanelDataClass; // 0x4f0(0x08)
	struct FName TabId_Creative; // 0x4f8(0x08)
	struct FName TabId_MyIsland; // 0x500(0x08)
	struct TArray<struct FName> BlockedInputActions; // 0x508(0x10)
	struct TArray<struct FName> AdditionalBlockedInputActions; // 0x518(0x10)
	struct UScaleBox* ScaleBox_Leto; // 0x528(0x08)
	struct UFortTabListWidgetBase* TabList_Inventory; // 0x530(0x08)
	struct UCommonWidgetSwitcherLegacy* Switcher_InventoryTabs; // 0x538(0x08)
	struct UPanelWidget* Panel_MyIslandHost; // 0x540(0x08)
	struct UPanelWidget* Panel_CreativeInventoryHost; // 0x548(0x08)
	struct UFortCreativeSettingsFlow* MyIslandWidget; // 0x550(0x08)
	struct UFortCreativeItemListMenu* CreativeInventoryWidget; // 0x558(0x08)
	struct UInputComponent* InventoryScreenInputComponent; // 0x560(0x08)
	char pad_568[0x50]; // 0x568(0x50)

	void OnExtensionWidgetCreated(enum class EUIExtensionSlot ExtensionSlot, struct UUserWidget* ExtensionWidget); // Function FortniteUI.AthenaInventoryScreenContainer.OnExtensionWidgetCreated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	struct UUserWidget* GetMyIslandWidget(); // Function FortniteUI.AthenaInventoryScreenContainer.GetMyIslandWidget // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6a2a3a4
	struct UUserWidget* GetCreativeInventoryWidget(); // Function FortniteUI.AthenaInventoryScreenContainer.GetCreativeInventoryWidget // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x6a2a2f8
	void CloseScreen(); // Function FortniteUI.AthenaInventoryScreenContainer.CloseScreen // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a148
};

// Class FortniteUI.AthenaItemIcon
// Size: 0x2f0 (Inherited: 0x290)
struct UAthenaItemIcon : UAthenaItemElementWidgetBase {
	char pad_290[0x10]; // 0x290(0x10)
	struct UImage* Image_ItemIcon; // 0x2a0(0x08)
	struct UCommonTextBlock* Text_StackCount; // 0x2a8(0x08)
	struct UImage* Image_AmmoIcon; // 0x2b0(0x08)
	struct UAthenaItemTierWidget* ItemTierWidget; // 0x2b8(0x08)
	bool bUseLargePreviewImage; // 0x2c0(0x01)
	char pad_2C1[0x3]; // 0x2c1(0x03)
	struct FName ItemIconTextureParamName; // 0x2c4(0x08)
	struct FName AmmoIconTextureParamName; // 0x2cc(0x08)
	char pad_2D4[0x4]; // 0x2d4(0x04)
	struct FText InfiniteStackCountText; // 0x2d8(0x18)

	void OnStackCountTextUpdated(bool bIsInfinite); // Function FortniteUI.AthenaItemIcon.OnStackCountTextUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnItemIconUpdated(bool bHasItemIcon); // Function FortniteUI.AthenaItemIcon.OnItemIconUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnAmmoIconUpdated(bool bHasAmmoIcon); // Function FortniteUI.AthenaItemIcon.OnAmmoIconUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaItemListWidget
// Size: 0x360 (Inherited: 0x2c8)
struct UAthenaItemListWidget : UFortHUDElementWidget {
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct FFortItemFilterDefinition ItemFilter; // 0x2d0(0x60)
	struct FGameplayTagContainer ItemFilterTags; // 0x330(0x20)
	enum class EInventoryContentSortType ItemSortType; // 0x350(0x01)
	char pad_351[0x7]; // 0x351(0x07)
	struct UFortItemListView* ItemListView; // 0x358(0x08)

	void OnInventoryUpdated(); // Function FortniteUI.AthenaItemListWidget.OnInventoryUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleInventoryUpdated(); // Function FortniteUI.AthenaItemListWidget.HandleInventoryUpdated // (Final|Native|Private) // @ game+0x6a2a6b0
};

// Class FortniteUI.AthenaItemReceivedPreMessageBase
// Size: 0x340 (Inherited: 0x320)
struct UAthenaItemReceivedPreMessageBase : UCommonActivatableWidget {
	struct UFortGiftBoxItem* GiftBox; // 0x320(0x08)
	char pad_328[0x18]; // 0x328(0x18)
};

// Class FortniteUI.AthenaUpgradedPreMessage
// Size: 0x340 (Inherited: 0x340)
struct UAthenaUpgradedPreMessage : UAthenaItemReceivedPreMessageBase {

	void OnPresentationFinished(); // Function FortniteUI.AthenaUpgradedPreMessage.OnPresentationFinished // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2ac08
};

// Class FortniteUI.AthenaItemSelectorScreenBase
// Size: 0x7e0 (Inherited: 0x5b0)
struct UAthenaItemSelectorScreenBase : UFortItemPreviewScreen {
	char pad_5B0[0x10]; // 0x5b0(0x10)
	struct UCommonButtonLegacy* TabButtonType; // 0x5c0(0x08)
	struct TMap<enum class EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo; // 0x5c8(0x50)
	struct FFortTabButtonLabelInfo VariantButtonLabelInfo; // 0x618(0xa0)
	struct FDataTableRowHandle ApplyToAllInputActionRow; // 0x6b8(0x10)
	struct FDataTableRowHandle ToggleFavoriteActionRow; // 0x6c8(0x10)
	struct FDataTableRowHandle ToggleBackActionRow; // 0x6d8(0x10)
	struct UCommonButtonLegacy* Button_ConfirmSelection; // 0x6e8(0x08)
	struct UCommonButtonLegacy* Button_EditStyle; // 0x6f0(0x08)
	struct UCommonButtonLegacy* Button_ConfirmStyle; // 0x6f8(0x08)
	struct UAthenaCustomizationPicker* Picker_ItemSelector; // 0x700(0x08)
	struct UVerticalBox* ItemInfo; // 0x708(0x08)
	struct UFortItemBaseWidget* Item_HeaderInfo; // 0x710(0x08)
	bool bVariantZoomUsesSnap; // 0x718(0x01)
	char pad_719[0x7]; // 0x719(0x07)
	struct UFortItem* CurrentPreviewItem; // 0x720(0x08)
	struct UAthenaCosmeticItemDefinition* CurrentPreviewItemDef; // 0x728(0x08)
	struct TArray<struct FMcpVariantChannelInfo> CurrentPreviewVariantChannels; // 0x730(0x10)
	struct TArray<struct FMcpVariantChannelInfo> CachedVariantChannels; // 0x740(0x10)
	char pad_750[0x8]; // 0x750(0x08)
	struct UFortVariantPicker* Picker_VariantSelector; // 0x758(0x08)
	struct UAthenaCosmeticUnlockingInfo* UnlockingInfo; // 0x760(0x08)
	char pad_768[0x70]; // 0x768(0x70)
	enum class EAthenaCustomizationCategory CustomizeCategory; // 0x7d8(0x01)
	char pad_7D9[0x3]; // 0x7d9(0x03)
	int32_t SubslotIndex; // 0x7dc(0x04)

	void StartItemCustomization(struct FAthenaCustomizationParams Params); // Function FortniteUI.AthenaItemSelectorScreenBase.StartItemCustomization // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x6a2b00c
	void SaveAndExit_ApplyToAllSlots(); // Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit_ApplyToAllSlots // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2ad9c
	void SaveAndExit(bool bApplyToAllSlots); // Function FortniteUI.AthenaItemSelectorScreenBase.SaveAndExit // (Final|Native|Protected) // @ game+0x6a2ad00
	void OnVariantSelectionChangedBP(struct FMcpVariantChannelInfo InVariant); // Function FortniteUI.AthenaItemSelectorScreenBase.OnVariantSelectionChangedBP // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnUpdateExclusiveItemCallout(bool bShouldShow, struct FText CalloutText); // Function FortniteUI.AthenaItemSelectorScreenBase.OnUpdateExclusiveItemCallout // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnTabSelectionChanged(bool bShowingVariants); // Function FortniteUI.AthenaItemSelectorScreenBase.OnTabSelectionChanged // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnSavingItemStarted(); // Function FortniteUI.AthenaItemSelectorScreenBase.OnSavingItemStarted // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnItemSelectionCommited(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectionCommited // (Final|Native|Protected) // @ game+0x6a2ab70
	void OnItemSelectedChanged(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectedChanged // (Final|Native|Protected) // @ game+0x6a2aad4
	void OnHideItemInfoHeader(bool bShouldHide); // Function FortniteUI.AthenaItemSelectorScreenBase.OnHideItemInfoHeader // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnFinsihedItemSave(); // Function FortniteUI.AthenaItemSelectorScreenBase.OnFinsihedItemSave // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnFinishedItemSetup(struct FText CategoryDisplayName, struct FText ItemDisplayTypeName, enum class EAthenaCustomizationCategory SelectedCategory, struct UMaterialInstance* OverrideSlotImage); // Function FortniteUI.AthenaItemSelectorScreenBase.OnFinishedItemSetup // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	void OnCurrentItemChanged(struct UFortItem* SelectedItem); // Function FortniteUI.AthenaItemSelectorScreenBase.OnCurrentItemChanged // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	bool IsItemOwned(struct UFortItem* Item); // Function FortniteUI.AthenaItemSelectorScreenBase.IsItemOwned // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2aa18
	void IsInTextSearchChanged(bool bEnteredTextSearch); // Function FortniteUI.AthenaItemSelectorScreenBase.IsInTextSearchChanged // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a964
	void HandleSearchTextChanged(struct FText NewText); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleSearchTextChanged // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x6a2a8a0
	void HandleScreenAnalytics(bool bItemChanged); // Function FortniteUI.AthenaItemSelectorScreenBase.HandleScreenAnalytics // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a80c
	struct UFortItem* GetCurrentItem(); // Function FortniteUI.AthenaItemSelectorScreenBase.GetCurrentItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2a310
	void ExitEditStyle(); // Function FortniteUI.AthenaItemSelectorScreenBase.ExitEditStyle // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a1ac
	void EnterEditStyle(); // Function FortniteUI.AthenaItemSelectorScreenBase.EnterEditStyle // (Final|Native|Protected) // @ game+0x6a2a198
	void BP_HandleBack(); // Function FortniteUI.AthenaItemSelectorScreenBase.BP_HandleBack // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaItemShopCarousel
// Size: 0x428 (Inherited: 0x288)
struct UAthenaItemShopCarousel : UCommonUserWidget {
	char pad_288[0x98]; // 0x288(0x98)
	SoftClassProperty CarouselTileClass; // 0x320(0x28)
	struct UOverlay* Container_CurrentTile; // 0x348(0x08)
	struct UOverlay* Container_NextTileToShow; // 0x350(0x08)
	struct UFortClickThroughButton* MobileClickThroughButton; // 0x358(0x08)
	struct UPanelWidget* HBox_NavigationButtons; // 0x360(0x08)
	struct UCommonTextBlock* Text_NextItem; // 0x368(0x08)
	struct UCommonTextBlock* Text_PreviousItem; // 0x370(0x08)
	struct UImage* Image_AutoScrollProgress; // 0x378(0x08)
	struct UDynamicEntryBox* EntryBox_Pips; // 0x380(0x08)
	struct UFortSwipePanel* SwipePanel_ItemsNavigation; // 0x388(0x08)
	struct UCommonButtonGroupLegacy* ButtonGroup_Pips; // 0x390(0x08)
	struct TArray<struct UAthenaItemShopCarouselTile*> Tiles; // 0x398(0x10)
	struct FTimerHandle TileSeenTimerHandle; // 0x3a8(0x08)
	int32_t SelectedItemIndex; // 0x3b0(0x04)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct UAthenaItemShopCarouselTile* NextTileToShow; // 0x3b8(0x08)
	struct UAthenaItemShopCarouselTile* CurrentTile; // 0x3c0(0x08)
	char pad_3C8[0x60]; // 0x3c8(0x60)

	void SelectPrevItem(); // Function FortniteUI.AthenaItemShopCarousel.SelectPrevItem // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2ae5c
	void SelectNextItem(); // Function FortniteUI.AthenaItemShopCarousel.SelectNextItem // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2ae48
	void SelectItemAtIndex(int32_t ItemIndex); // Function FortniteUI.AthenaItemShopCarousel.SelectItemAtIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2adb0
	void OnTransitionToPreviousTile(); // Function FortniteUI.AthenaItemShopCarousel.OnTransitionToPreviousTile // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnTransitionToNextTile(); // Function FortniteUI.AthenaItemShopCarousel.OnTransitionToNextTile // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnTransitionCompleted(); // Function FortniteUI.AthenaItemShopCarousel.OnTransitionCompleted // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2ac1c
	void OnSelectionChanged(bool bInIsSelected); // Function FortniteUI.AthenaItemShopCarousel.OnSelectionChanged // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnIntroAnim(); // Function FortniteUI.AthenaItemShopCarousel.OnIntroAnim // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	int32_t GetSelectedIndex(); // Function FortniteUI.AthenaItemShopCarousel.GetSelectedIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2a520
};

// Class FortniteUI.AthenaItemShopCarouselTile
// Size: 0xd08 (Inherited: 0xc20)
struct UAthenaItemShopCarouselTile : UCommonButtonLegacy {
	char pad_C20[0x8]; // 0xc20(0x08)
	struct UCommonTextBlock* Text_Title; // 0xc28(0x08)
	struct UImage* Image_Background; // 0xc30(0x08)
	struct UImage* Image_Foreground; // 0xc38(0x08)
	char pad_C40[0xb8]; // 0xc40(0xb8)
	struct UTexture2D* ExternalMedia; // 0xcf8(0x08)
	char pad_D00[0x8]; // 0xd00(0x08)

	void OnPeekStateChanged(bool bIsInPeekState); // Function FortniteUI.AthenaItemShopCarouselTile.OnPeekStateChanged // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnIntro(); // Function FortniteUI.AthenaItemShopCarouselTile.OnIntro // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnFadeOutTransitionToPrevious(); // Function FortniteUI.AthenaItemShopCarouselTile.OnFadeOutTransitionToPrevious // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnFadeOutTransitionToNext(); // Function FortniteUI.AthenaItemShopCarouselTile.OnFadeOutTransitionToNext // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnFadeInTransitionToPrevious(); // Function FortniteUI.AthenaItemShopCarouselTile.OnFadeInTransitionToPrevious // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnFadeInTransitionToNext(); // Function FortniteUI.AthenaItemShopCarouselTile.OnFadeInTransitionToNext // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnActiveStateChanged(bool bIsSelected); // Function FortniteUI.AthenaItemShopCarouselTile.OnActiveStateChanged // (Event|Public|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaItemShopConfiguration
// Size: 0x198 (Inherited: 0x30)
struct UAthenaItemShopConfiguration : UDataAsset {
	struct FString SubscriptionOfferId; // 0x30(0x10)
	struct TArray<struct FName> LimitedTimeStorefrontNames; // 0x40(0x10)
	struct FAthenaItemShopReloadMtxInfo ItemShopReloadMtxInfo; // 0x50(0xb8)
	struct FName BattlePassSectionId; // 0x108(0x08)
	struct FName SubscriptionSectionId; // 0x110(0x08)
	struct UCatalogMessaging* TileViolatorTextTable; // 0x118(0x08)
	SoftClassProperty SubscriptionManagementScreenClass; // 0x120(0x28)
	SoftClassProperty SectionWidgetClass; // 0x148(0x28)
	SoftClassProperty CarouselWidgetClass; // 0x170(0x28)
};

// Class FortniteUI.AthenaItemShopNavigationButton
// Size: 0xc30 (Inherited: 0xc20)
struct UAthenaItemShopNavigationButton : UCommonButtonLegacy {
	char pad_C20[0x8]; // 0xc20(0x08)
	struct UCommonTextBlock* Text_Section; // 0xc28(0x08)
};

// Class FortniteUI.AthenaItemShopOfferDetailsWidgetBase
// Size: 0x428 (Inherited: 0x320)
struct UAthenaItemShopOfferDetailsWidgetBase : UCommonActivatableWidget {
	char pad_320[0x20]; // 0x320(0x20)
	struct TArray<struct UFortStoreFrontOfferInfo*> PagedItems; // 0x340(0x10)
	struct UFortStoreFrontOfferInfo* OfferData; // 0x350(0x08)
	struct UCommonTextBlock* Text_CosmeticWarning; // 0x358(0x08)
	struct UCommonTextBlock* TextUndoAvailability; // 0x360(0x08)
	struct UCommonTextBlock* Text_UndoBottomBarWarning; // 0x368(0x08)
	struct UCommonButtonLegacy* Button_Undo; // 0x370(0x08)
	struct FDataTableRowHandle UndoAction; // 0x378(0x10)
	char pad_388[0x4]; // 0x388(0x04)
	bool bImmediatelyPurchased; // 0x38c(0x01)
	char pad_38D[0x33]; // 0x38d(0x33)
	struct UAthenaItemShopPurchaseOverlayModal* PurchaseModalClass; // 0x3c0(0x08)
	struct UFortProgressModal* ProgressModalClass; // 0x3c8(0x08)
	struct UFortProgressModal* ProgressModal; // 0x3d0(0x08)
	char pad_3D8[0x38]; // 0x3d8(0x38)
	bool bShowRefundWarningWhileMatchmaking; // 0x410(0x01)
	bool bShowRefundWarningWhileInZone; // 0x411(0x01)
	char pad_412[0x16]; // 0x412(0x16)

	void ShowPurchasedOverlayWidget(int32_t QuantityPurchased, struct TArray<struct FPurchasedItemInfo> PurchasedItems, bool bShowAsRefund, struct FString OfferId); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.ShowPurchasedOverlayWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2cacc
	void ShowItemPresentationScreen(struct TArray<struct FPurchasedItemInfo> PurchasedItems); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.ShowItemPresentationScreen // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x6a2ca1c
	bool ShouldShowReloadVBucks(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.ShouldShowReloadVBucks // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2c9f8
	bool ShouldShowDynamicReloadVBucks(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.ShouldShowDynamicReloadVBucks // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2c9d4
	bool ShouldHavePurchaseConfirmation(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.ShouldHavePurchaseConfirmation // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2c998
	void SetOffer(struct UFortStoreFrontOfferInfo* InOfferData); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.SetOffer // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2c804
	void SendShopInteractionAnalytic(struct FString Interaction); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.SendShopInteractionAnalytic // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x6a2c6c4
	void SendRealMoneyPurchase(int32_t PriceIndex, int32_t Quantity); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.SendRealMoneyPurchase // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2c5dc
	void RefreshUndoState(struct UFortStoreFrontOfferInfo* OfferPurchased); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.RefreshUndoState // (Final|Native|Public|BlueprintCallable) // @ game+0x6a2c4f0
	void RefreshOfferInfo(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.RefreshOfferInfo // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2c4dc
	void PurchaseOffer(struct FDelegate Callback, int32_t Quantity); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.PurchaseOffer // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x6a2c3cc
	void PurchaseAmountRight(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.PurchaseAmountRight // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void PurchaseAmountLeft(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.PurchaseAmountLeft // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void OnUpdateStatus(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.OnUpdateStatus // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnUndoAction(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.OnUndoAction // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnPurchasingStarted(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.OnPurchasingStarted // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void HandleUndoAction(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.HandleUndoAction // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2c088
	void HandleRealMoneyPurchaseComplete(bool bSuccess, struct TArray<struct FPurchasedItemInfo> PurchasedItems); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.HandleRealMoneyPurchaseComplete // (Final|Native|Private|HasOutParms) // @ game+0x6a2bf64
	void HandleGiftingItemPurchaseComplete(bool bSuccess, struct TArray<struct FPurchasedItemInfo> PurchasedItems, struct FString OfferId); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.HandleGiftingItemPurchaseComplete // (Final|Native|Private|HasOutParms) // @ game+0x6a2b97c
	void HandleCurrentlyViewedAccountInfoChanged(struct FFortPublicAccountInfo NewInfo); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.HandleCurrentlyViewedAccountInfoChanged // (Final|Native|Protected) // @ game+0x6a2b8b4
	struct UFortStoreFrontOfferInfo* GetOfferInfoById(struct FString OfferId); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.GetOfferInfoById // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2b650
	struct UFortStoreFrontOfferInfo* GetOfferInfo(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.GetOfferInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2b638
	void BP_OnSetOffer(); // Function FortniteUI.AthenaItemShopOfferDetailsWidgetBase.BP_OnSetOffer // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
};

// Class FortniteUI.AthenaItemShopOfferDetailsPreviewWidget
// Size: 0x4f8 (Inherited: 0x428)
struct UAthenaItemShopOfferDetailsPreviewWidget : UAthenaItemShopOfferDetailsWidgetBase {
	struct FDataTableRowHandle BackAction; // 0x428(0x10)
	struct UFortItemPreviewScreen* ItemPreview_Widget; // 0x438(0x08)
	struct UFortItemBaseWidget* Item_InfoHeader; // 0x440(0x08)
	char pad_448[0x18]; // 0x448(0x18)
	float TimeBetweenVariantsRestart; // 0x460(0x04)
	float TimeBetweenVariants; // 0x464(0x04)
	char pad_468[0x48]; // 0x468(0x48)
	struct UFortItem* ItemToRepresent; // 0x4b0(0x08)
	struct FUnlockableVariantPreviewInfo VariantPreviewInfo; // 0x4b8(0x28)
	struct UAthenaItemShopOfferInspectionNavigator* OfferNavigator_ArrowNavigation; // 0x4e0(0x08)
	struct UFortStoreSkinDetailsPopup* StorePopup_Details; // 0x4e8(0x08)
	struct UCommonButtonLegacy* Button_SendGift; // 0x4f0(0x08)

	void UpdateSwipeButtonsVisibility(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.UpdateSwipeButtonsVisibility // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2b194
	void UpdatePreviewFromOffer(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.UpdatePreviewFromOffer // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2b180
	void TryDismiss(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.TryDismiss // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2b148
	void TriggerPurchaseChoiceRequest(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.TriggerPurchaseChoiceRequest // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2b0fc
	void ShowItemFromItemReward(struct UFortAthenaReward* InItemReward); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.ShowItemFromItemReward // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2af64
	bool ShouldDisplayOfferPurchasedOverlay(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.ShouldDisplayOfferPurchasedOverlay // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2af0c
	void SetItemToRepresent(struct UFortItem* InItemToRepresent); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.SetItemToRepresent // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2ae70
	void SetIsPurchasing(bool bInIsPurchasing); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.SetIsPurchasing // (Final|Native|Protected|BlueprintCallable) // @ game+0x5e8408c
	void RegisterItemRewardInteraction(struct UFortAthenaReward* InItemReward); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.RegisterItemRewardInteraction // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2ac30
	void OnVariantPreviewInfoUpdated(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.OnVariantPreviewInfoUpdated // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	void OnUpdateItemRestrictionCallout(bool bShouldShow, struct FText RestrictionText); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.OnUpdateItemRestrictionCallout // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xda7c34
	bool IsMultiplePriceRealMoneyOffer(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.IsMultiplePriceRealMoneyOffer // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2aab0
	void HandleReloadStaticMtxClicked(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.HandleReloadStaticMtxClicked // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a7f8
	void HandleReloadDynamicMtxClicked(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.HandleReloadDynamicMtxClicked // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a7e4
	void HandleItemShown(struct UFortAccountItemDefinition* AccountItemDef); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.HandleItemShown // (Final|Native|Protected) // @ game+0x6a2a6f8
	void HandleGetVBucksClicked(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.HandleGetVBucksClicked // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a5bc
	void HandleBackAction(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.HandleBackAction // (Event|Protected|BlueprintEvent) // @ game+0xda7c34
	struct FUnlockableVariantPreviewInfo GetVariantPreviewInfo(); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.GetVariantPreviewInfo // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a538
	bool GetSalePriceFromLastAppStore(int32_t PriceIndex, struct FText SalePrice, int32_t ItemQuantity); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.GetSalePriceFromLastAppStore // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x6a2a3bc
	void FocusOnWidget(struct UWidget* WidgetToFocus); // Function FortniteUI.AthenaItemShopOfferDetailsPreviewWidget.FocusOnWidget // (Final|Native|Protected|BlueprintCallable) // @ game+0x6a2a1c0
};

// Class FortniteUI.FortStoreFrontOfferInfo
// Size: 0x60 (Inherited: 0x28)
struct UFortStoreFrontOfferInfo : UObject {
	char pad_28[0x18]; // 0x28(0x18)
	struct UFortMtxOfferData* OfferDisplayAsset; // 0x40(0x08)
	char pad_48[0x18]; // 0x48(0x18)

	bool WasPrerollItemSeen(); // Function FortniteUI.FortStoreFrontOfferInfo.WasPrerollItemSeen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab6d98
	bool OfferHasDenyRequirements(); // Function FortniteUI.FortStoreFrontOfferInfo.OfferHasDenyRequirements // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab67b0
	void MarkPrerollAsSeen(); // Function FortniteUI.FortStoreFrontOfferInfo.MarkPrerollAsSeen // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x6ab679c
	bool IsVotingOffer(); // Function FortniteUI.FortStoreFrontOfferInfo.IsVotingOffer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab6778
	bool IsValidOffer(); // Function FortniteUI.FortStoreFrontOfferInfo.IsValidOffer // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab6754
	bool IsUnique(); // Function FortniteUI.FortStoreFrontOfferInfo.IsUnique // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab6730
	bool IsSubscriptionOffer(); // Function FortniteUI.FortStoreFrontOfferInfo.IsSubscriptionOffer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab670c
	bool IsRefundable(); // Function FortniteUI.FortStoreFrontOfferInfo.IsRefundable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab66f0
	bool IsPurchasingAvailable(); // Function FortniteUI.FortStoreFrontOfferInfo.IsPurchasingAvailable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab66cc
	bool IsPriceInRealMoney(int32_t PriceIndex); // Function FortniteUI.FortStoreFrontOfferInfo.IsPriceInRealMoney // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab6624
	bool IsPriceInMTX(int32_t PriceIndex); // Function FortniteUI.FortStoreFrontOfferInfo.IsPriceInMTX // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab657c
	bool IsPriceInGameItems(int32_t PriceIndex); // Function FortniteUI.FortStoreFrontOfferInfo.IsPriceInGameItems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab64d4
	bool IsPrerollOffer(); // Function FortniteUI.FortStoreFrontOfferInfo.IsPrerollOffer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x6ab64a8
