// UserDefinedStruct FortUIStylesheet.FortUIStylesheet
// Size: 0x280 (Inherited: 0x00)
struct FFortUIStylesheet {
	struct FFortUITheme Theme-Default_91_015CB18F413B4A467B38CB93E8734A68; // 0x00(0x60)
	struct FFortUITheme Theme-Emphasis_94_962F11A944E9DF11F547FBBDB98DD4BE; // 0x60(0x60)
	struct FFortUITheme Theme-Critical_97_43F63D0C4E71395016AE00B41BB7BA0C; // 0xc0(0x60)
	struct FLinearColor Color-Buff_145_AC063FB242D9ECBD0B6306BBE205C7F7; // 0x120(0x10)
	struct FLinearColor Color-Debuff_146_0402338944FCC3DED4C90E9A78FD8BC5; // 0x130(0x10)
	struct FLinearColor Color-Unique_150_B15CF0C9436988001F70B4B8F9D32E5B; // 0x140(0x10)
	struct FLinearColor Color-FireElemental_152_FBAFDA0C445A96F1B689E880A707069C; // 0x150(0x10)
	struct FLinearColor Color-IceElemental_154_FDA209D8429DF768ABA53EBA24C4B505; // 0x160(0x10)
	struct FLinearColor Color-BoltElemental_156_10AEFEC147C25B2DEE47619E4AB4ABC7; // 0x170(0x10)
	struct FLinearColor Color-HarvestWeakPoint_159_AE0CF44C4731DAF69193D4B4E59B0E7E; // 0x180(0x10)
	struct TMap<enum class EFortBrushSize, struct FVector2D> Standard-Icon-Size_174_E90B59CC4EF046AEDF28A0BA360D7D71; // 0x190(0x50)
	struct TMap<enum class EFortBrushSize, struct FVector2D> Item-Size_173_B43931B34EEE416F836301A3A3573E09; // 0x1e0(0x50)
	struct TMap<enum class EFortBrushSize, struct FVector2D> Item-Icon-Size_172_93F895F043E3487E9AF205B72C3EF84B; // 0x230(0x50)
};

