// AnimBlueprintGeneratedClass GhostRockLayerAnimBP.GhostRockLayerAnimBP_C
// Size: 0x439c (Inherited: 0x3f0)
struct UGhostRockLayerAnimBP_C : UFortItemLayerAnimInstance_FullLocomotion {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3f0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_35; // 0x3f8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_18; // 0x428(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_34; // 0x540(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_17; // 0x570(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_33; // 0x688(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_16; // 0x6b8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_15; // 0x7d0(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_32; // 0x8e8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_14; // 0x918(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_31; // 0xa30(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_30; // 0xa60(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_29; // 0xa90(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_28; // 0xac0(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_27; // 0xaf0(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_26; // 0xb20(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_13; // 0xb50(0x118)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0xc68(0x18)
	struct FAnimNode_Root AnimGraphNode_Root_25; // 0xc80(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_12; // 0xcb0(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_24; // 0xdc8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_11; // 0xdf8(0x118)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xf10(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xfd8(0xe8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x10c0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x10e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1168(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x1198(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1218(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1248(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_23; // 0x12f8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_10; // 0x1328(0x118)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x1440(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x14c0(0xa0)
	struct FAnimNode_Root AnimGraphNode_Root_22; // 0x1560(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_21; // 0x1590(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_20; // 0x15c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x15f0(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_19; // 0x1670(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x16a0(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_18; // 0x1720(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x1750(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_17; // 0x17d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x1800(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x1880(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1900(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x19a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x1a40(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_16; // 0x1ac0(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_15; // 0x1af0(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_14; // 0x1b20(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_13; // 0x1b50(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_12; // 0x1b80(0x30)
	struct FAnimNode_Root AnimGraphNode_Root_11; // 0x1bb0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_9; // 0x1be0(0x118)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x1cf8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x1da8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x1e28(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1ea8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1f28(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_10; // 0x1fa8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8; // 0x1fd8(0x118)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x20f0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x21a0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x2220(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x22a0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x2320(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_9; // 0x23a0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7; // 0x23d0(0x118)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x24e8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x2598(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2618(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x2698(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x2718(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x2798(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6; // 0x27c8(0x118)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x28e0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x2990(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x2a10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x2a90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x2b10(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x2b90(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0x2bc0(0x118)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2cd8(0xe8)
	struct FFortAnimNode_SpeedWarping FortAnimGraphNode_SpeedWarping; // 0x2dc0(0x1b8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2f78(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2f98(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x2fb8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x2fe8(0x118)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x3100(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x31a0(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x3240(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x32e0(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x3380(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x3430(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x34b0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x3530(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x35b0(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x3630(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x3660(0x118)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x3778(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x3828(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x38a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x3928(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x39a8(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x3a28(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x3a58(0x118)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x3b70(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x3c20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x3ca0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x3d20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x3da0(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x3e20(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3e50(0x118)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3f68(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x4018(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x4098(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4118(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4198(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x4218(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x4248(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x4360(0x30)
	float JogStartPosition; // 0x4390(0x04)
	float StartBlendTime; // 0x4394(0x04)
	float PivotAnimBlendTime; // 0x4398(0x04)

	void ItemPreIK(struct FPoseLink InPose_PreIK, struct FPoseLink ItemPreIK); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemPreIK // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink ItemFullBodyOverride); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemAimOffset(struct FPoseLink InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, struct FPoseLink InPose_UpperLowerPreMeleeAO, struct FPoseLink ItemAimOffset); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemAimOffset // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemSkeletalControl(struct FPoseLink InPose, struct FPoseLink ItemSkeletalControl); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemSkeletalControl // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemSwimJumpSurfaceEnd(struct FPoseLink ItemSwimJumpSurfaceEnd); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemSwimJumpSurfaceEnd // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemSwimJumpSurfaceLoop(struct FPoseLink ItemSwimJumpSurfaceLoop); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemSwimJumpSurfaceLoop // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemSwimJumpFallLoop(struct FPoseLink ItemSwimJumpFallLoop); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemSwimJumpFallLoop // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemSwimJumpStartLoop(struct FPoseLink ItemSwimJumpStartLoop); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemSwimJumpStartLoop // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemSwimJumpStart(struct FPoseLink ItemSwimJumpStart); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemSwimJumpStart // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemLowerBodyLeanAdditive(struct FPoseLink InPoseLowerBodyLeanAdditive, struct FPoseLink ItemLowerBodyLeanAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyLeanAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemUpperBody(struct FPoseLink InPoseUpperBody, struct FFortAnimInput_AdjustedAim InputParam, struct FPoseLink ItemUpperBody); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemUpperBody // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemFullBodySprint(struct FPoseLink InPoseSprint, struct FPoseLink ItemFullBodySprint); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFullBodySprint // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemIdleAdditive(struct FPoseLink InPoseIdleAdditive, struct FPoseLink ItemIdleAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemIdleAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemCrouchTurningAdditive(struct FPoseLink ItemCrouchTurningAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemCrouchTurningAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemSlopeSliding(struct FPoseLink ItemSlopeSliding); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemSlopeSliding // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemJumpUpAdditive(struct FPoseLink ItemJumpUpAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJumpUpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemJumpLoopAdditive(struct FPoseLink ItemJumpLoopAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJumpLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemFallAdditive(struct FPoseLink ItemFallAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFallAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemFallLandAdditive(struct FPoseLink ItemFallLandAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFallLandAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemJetPackStartAdditive(struct FPoseLink ItemJetPackStartAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJetPackStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemJetPackJumpAdditive(struct FPoseLink ItemJetPackJumpAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJetPackJumpAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemZipLineStartAdditive(struct FPoseLink ItemZipLineStartAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemZipLineStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemFlyModeStartAdditive(struct FPoseLink ItemFlyModeStartAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFlyModeStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemFlyModeLoopAdditive(struct FPoseLink ItemFlyModeLoopAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFlyModeLoopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemJogStartAdditive(struct FPoseLink InPoseJogStartAdditive, struct FPoseLink ItemJogStartAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJogStartAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemJogStopAdditive(struct FPoseLink InPoseJogStopAdditive, struct FPoseLink ItemJogStopAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJogStopAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemJogPrePivotAdditive(struct FPoseLink InPosePrePivotAdditive, struct FPoseLink ItemJogPrePivotAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJogPrePivotAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemJogPostPivotAdditive(struct FPoseLink InPosePostPivotAdditive, struct FPoseLink ItemJogPostPivotAdditive); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJogPostPivotAdditive // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemLowerBodyMovement(struct FPoseLink InPoseLowerBodyMovement, struct FPoseLink ItemLowerBodyMovement); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyMovement // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemLowerBodyJogStart(struct FPoseLink InPoseLowerBodyJogStart, struct FPoseLink ItemLowerBodyJogStart); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyJogStart // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemLowerBodyJogStop(struct FPoseLink InPoseLowerBodyJogStop, struct FPoseLink ItemLowerBodyJogStop); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyJogStop // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemLowerBodyJogPrePivot(struct FPoseLink InPoseLowerBodyJogPrePivot, struct FPoseLink ItemLowerBodyJogPrePivot); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyJogPrePivot // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemLowerBodyJogPostPivot(struct FPoseLink InPoseLowerBodyJogPostPivot, struct FPoseLink ItemLowerBodyJogPostPivot); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyJogPostPivot // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void ItemRelaxedEntry(struct FPoseLink InPoseRelaxedEntry, struct FPoseLink ItemRelaxedEntry); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemRelaxedEntry // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void AnimGraph(struct FPoseLink AnimGraph); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void ExecuteUbergraph_GhostRockLayerAnimBP(int32_t EntryPoint); // Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ExecuteUbergraph_GhostRockLayerAnimBP // (Final|UbergraphFunction) // @ game+0xda7c34
};

