// WidgetBlueprintGeneratedClass LoginCredentialSelect.LoginCredentialSelect_C
// Size: 0x360 (Inherited: 0x300)
struct ULoginCredentialSelect_C : UFortLoginCredentialSelect {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x300(0x08)
	struct UCommonWidgetSwitcherLegacy* CommonWidgetSwitcher_1; // 0x308(0x08)
	struct UCommonTextBlock* Erebus_Title; // 0x310(0x08)
	struct UCommonTextBlock* ErebusType; // 0x318(0x08)
	struct UImage* Image_1; // 0x320(0x08)
	struct UImage* Image_2; // 0x328(0x08)
	struct UImage* Image_3; // 0x330(0x08)
	struct UImage* Image_4; // 0x338(0x08)
	struct UImage* Image_5; // 0x340(0x08)
	struct UImage* Image_6; // 0x348(0x08)
	struct UImage* Image_49; // 0x350(0x08)
	struct UBorder* TrademarksBorder; // 0x358(0x08)

	void Construct(); // Function LoginCredentialSelect.LoginCredentialSelect_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xda7c34
	void ExecuteUbergraph_LoginCredentialSelect(int32_t EntryPoint); // Function LoginCredentialSelect.LoginCredentialSelect_C.ExecuteUbergraph_LoginCredentialSelect // (Final|UbergraphFunction) // @ game+0xda7c34
};

