// AnimBlueprintGeneratedClass SwimmingAnimBP.SwimmingAnimBP_C
// Size: 0x7405 (Inherited: 0x710)
struct USwimmingAnimBP_C : UFortSwimmingLayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x710(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_10; // 0x718(0x30)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x748(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x7e8(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x978(0x190)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_15; // 0xb08(0x118)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0xc20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0xc48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0xc70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0xc98(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xcc0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0xd40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xd70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0xdf0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xe20(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0xea0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0xed0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0xf80(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x10d8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x1178(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x11a0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1260(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1288(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x1308(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x13d0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x1528(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x1550(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1600(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x1628(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x16f0(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_9; // 0x1770(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_14; // 0x17a0(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x18b8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x18e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x1910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x1938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x1960(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x1988(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x19b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x19d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x1a00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x1a28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x1a50(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1a78(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x1af8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x1b28(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x1c10(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x1c40(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1d28(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1d58(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x1dd8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x1e08(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x1e30(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x1e60(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1f48(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x1f78(0xb0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_13; // 0x2028(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x2140(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_12; // 0x2298(0x118)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x23b0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x2450(0xc0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_3; // 0x2510(0x18)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_11; // 0x2528(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x2640(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x2798(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x27c0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x2918(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x2940(0xc0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_2; // 0x2a00(0x18)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2a18(0xc0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2ad8(0x18)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2af0(0xc8)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_10; // 0x2bb8(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x2cd0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x2e28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x2e50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x2e78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x2ea0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x2ec8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x2ef0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x2f18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x2f40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x2f68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x2f90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x2fb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x2fe0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x3008(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x3030(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x3058(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x3080(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x30a8(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x30d0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x30f0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x31f8(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x3218(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x3240(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x3268(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x3290(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x32b8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x3338(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x33d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x3458(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x3488(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x3570(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x35a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x3620(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x3650(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x3700(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x3730(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x3758(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x37d8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x3808(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x3830(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x3860(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x3888(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x38b8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x3968(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_9; // 0x3ac0(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x3bd8(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x3d30(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x3df8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x3e28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3e50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x3e78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x3ea0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x3ec8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x3ef0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x3f18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x3f40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x3f68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3f90(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3fb8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x4038(0x30)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x4068(0x190)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x41f8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x4218(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x4320(0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x4340(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x4428(0x30)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x4458(0x190)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x45e8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x4608(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x4710(0x20)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x4730(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x4818(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x4848(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x48c8(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x48f8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x4a00(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x4a20(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x4a40(0x108)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x4b48(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x4ba0(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x4bc8(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x4c90(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x4cb8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x4d58(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x4d80(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x4e20(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x4e40(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x4e60(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x4f68(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4f90(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x4fc0(0xb0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8; // 0x5070(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x5188(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7; // 0x52e0(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x53f8(0x158)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x5550(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x5638(0xa0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6; // 0x56d8(0x118)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x57f0(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x58b8(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x58e8(0x50)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0x5938(0x118)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x5a50(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x5b18(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x5b48(0x50)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x5b98(0x118)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x5cb0(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x5d78(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x5da8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x5e90(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x5f78(0xa0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x6018(0x118)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x6130(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x61f8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x6228(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x6250(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x6278(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x62a0(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x62c8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x63b0(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x63e0(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x64c8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x6578(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x6660(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x6690(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6778(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6828(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x6910(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x6940(0xb0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x69f0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x6a10(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6b18(0x20)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x6b38(0xa0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x6bd8(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6cf0(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6e48(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x6f08(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x6f30(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6fd0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x6ff8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x7078(0xc8)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x7140(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x7170(0x118)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7288(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7328(0x80)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x73a8(0x30)
	enum class EFortPlayerAnimBodyType AnimBodyTypePassThrough; // 0x73d8(0x01)
	char pad_73D9[0x3]; // 0x73d9(0x03)
	float MainInstanceDiveJumpLayerAlpha; // 0x73dc(0x04)
	bool IsHidingInPropLayer2; // 0x73e0(0x01)
	char pad_73E1[0x3]; // 0x73e1(0x03)
	float MainInstanceAdditiveLayerAlpha; // 0x73e4(0x04)
	float LocomotionAdditiveAlphaLayer; // 0x73e8(0x04)
	float DisableIKRootAdditiveCurveAlphaLayer; // 0x73ec(0x04)
	float DisableArmsHeadAdditiveCurveAlphaLayer; // 0x73f0(0x04)
	float PlayMeleeAttackAOLayer; // 0x73f4(0x04)
	bool IsHidingInPropLayer; // 0x73f8(0x01)
	bool AllowSprintStop; // 0x73f9(0x01)
	bool ChangeMovementToVelocityFromAccel; // 0x73fa(0x01)
	char pad_73FB[0x1]; // 0x73fb(0x01)
	float LocalAccelYawAngleAtStart; // 0x73fc(0x04)
	float PivotAngle; // 0x7400(0x04)
	enum class EFortWeaponCoreAnimation WeaponCoreAnim; // 0x7404(0x01)

	void SwimmingDiveJumpingLayer(struct FPoseLink PassThroughSwimmingDiveJumping, bool IsHidingInPropLayer2, float MainInstanceDiveJumpLayerAlpha, enum class EFortPlayerAnimBodyType AnimBodyTypePassThrough, struct FPoseLink SwimmingDiveJumpingLayer); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingDiveJumpingLayer // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void SwimmingFullBodyAdditiveLayer(struct FPoseLink PassThroughFullBodyAdditive, struct FPoseLink SwimmingFullBodyAdditiveLayer); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingFullBodyAdditiveLayer // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void SwimmingAdditiveLayer(struct FPoseLink IdleAdditive Cache, struct FPoseLink MovementAdditiveLayerPose Cache, struct FPoseLink FullBody, float PlayMeleeAttackAOLayer, float DisableArmsHeadAdditiveCurveAlphaLayer, float DisableIKRootAdditiveCurveAlphaLayer, float LocomotionAdditiveAlphaLayer, float MainInstanceAdditiveLayerAlpha, struct FPoseLink UpperAndLowerBody Cache, struct FPoseLink SprintingPose_PostMask_Cache, struct FPoseLink SwimmingAdditiveLayer); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingAdditiveLayer // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void SwimmingLowerBodyLayer(struct FPoseLink UpperBody Cache, struct FPoseLink PreUpperBodySlot Cache, struct FPoseLink PassThroughSwimmingLowerBody, struct FPoseLink SwimmingLowerBodyLayer); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingLowerBodyLayer // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void SwimmingUpperBodyPoseNonTargetingLayer(struct FPoseLink PassThroughSwimmingUpperBodyPoseNonTargeting, struct FPoseLink SwimmingUpperBodyPoseNonTargetingLayer); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingUpperBodyPoseNonTargetingLayer // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void SwimmingUpperBodyPoseTargetingLayer(struct FPoseLink PassThroughSwimmingUpperBodyPoseTargeting, struct FPoseLink SwimmingUpperBodyPoseTargetingLayer); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingUpperBodyPoseTargetingLayer // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void SwimmingMovementAdditiveLayerPose(struct FPoseLink PassThroughSwimmingMovementAdditive, struct FPoseLink SwimmingMovementAdditiveLayerPose); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingMovementAdditiveLayerPose // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void SwimmingSprintLayer(struct FPoseLink PassThroughSwimmingSprint, bool IsHidingInPropLayer, struct FPoseLink SwimmingSprintLayer); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingSprintLayer // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void SwimmingLayer(struct FPoseLink MainPlayerAnimBP, struct FPoseLink SwimmingLayer); // Function SwimmingAnimBP.SwimmingAnimBP_C.SwimmingLayer // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void AnimGraph(struct FPoseLink AnimGraph); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_5830B69443C9B79B5F980CAE5DEC8E36(); // Function SwimmingAnimBP.SwimmingAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_5830B69443C9B79B5F980CAE5DEC8E36 // (BlueprintEvent) // @ game+0xda7c34
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_E6B49F01423E469AF176989D25F6BA2A(); // Function SwimmingAnimBP.SwimmingAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SwimmingAnimBP_AnimGraphNode_TransitionResult_E6B49F01423E469AF176989D25F6BA2A // (BlueprintEvent) // @ game+0xda7c34
	void AnimNotify_SwimSprintStart_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintStart_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void AnimNotify_SwimSprintStart_Exited_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintStart_Exited_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void AnimNotify_SwimSprint_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprint_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void AnimNotify_SwimSprintSlow_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimSprintSlow_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void AnimNotify_SwimStartAdditive_Entered_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimStartAdditive_Entered_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void AnimNotify_SwimMovementAccelAdditive_Exited_Layer(); // Function SwimmingAnimBP.SwimmingAnimBP_C.AnimNotify_SwimMovementAccelAdditive_Exited_Layer // (BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void ExecuteUbergraph_SwimmingAnimBP(int32_t EntryPoint); // Function SwimmingAnimBP.SwimmingAnimBP_C.ExecuteUbergraph_SwimmingAnimBP // (Final|UbergraphFunction) // @ game+0xda7c34
};

