// AnimBlueprintGeneratedClass ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C
// Size: 0x2ead (Inherited: 0x670)
struct UValetVehicle_Driver_AnimBP_C : UFortVehicleOccupantAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x670(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x678(0x30)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_3; // 0x6a8(0xf8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2; // 0x7a0(0xf8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x898(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x8b8(0x108)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x9c0(0xf8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xab8(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xad8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xbe0(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xce8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xd30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xd58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xd80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xda8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xdd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xdf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xe20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xe48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xe70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xe98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xec0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xee8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xf10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xf38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xf60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xf88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xfb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xfd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1000(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1028(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1050(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1078(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x10a0(0x80)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x1120(0x190)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x12b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x12e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1360(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1390(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1410(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1440(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x14c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x14f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1570(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x15a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1620(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1650(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x16d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1700(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1780(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x1800(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x18a0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1968(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1990(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x19c0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x1a40(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1b08(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1b30(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1b60(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1b88(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x1bb8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1c68(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1ce8(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1d68(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1d90(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x1db8(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1e80(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1f20(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1fc0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1ff0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x20a0(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x21f8(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x2278(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2340(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x23c0(0xc8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x24b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x24d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2500(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2528(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x25a8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x25d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2658(0x30)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x2688(0x18)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x26a0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x26d0(0xb0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x2780(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2848(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x28e8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2988(0x158)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2ae0(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x2ba8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x2bf8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x2c48(0x50)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2c98(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2e28(0x80)
	float StartPosition; // 0x2ea8(0x04)
	bool AimOffsetEnable; // 0x2eac(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void AnimNotify_OnEnableAimOffset(); // Function ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimNotify_OnEnableAimOffset // (BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void AnimNotify_OnDisableAimOffset(); // Function ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimNotify_OnDisableAimOffset // (BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void ExecuteUbergraph_ValetVehicle_Driver_AnimBP(int32_t EntryPoint); // Function ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.ExecuteUbergraph_ValetVehicle_Driver_AnimBP // (Final|UbergraphFunction) // @ game+0xda7c34
};

