// AnimBlueprintGeneratedClass ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C
// Size: 0x516b (Inherited: 0x6e0)
struct UValetVehiclePassengerLayerAnimBP_C : UFortValetPassengerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6e0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x6e8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7; // 0x718(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6; // 0x830(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x948(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0xaa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xac8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xaf0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0xb18(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0xb98(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_11; // 0xc38(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0xcd8(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xd58(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0xd78(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xd98(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xea0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xed0(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xef8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xf18(0x20)
	struct FAnimNode_ResetRoot AnimGraphNode_ResetRoot; // 0xf38(0xd8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x1010(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x11a0(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1330(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1358(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x1388(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x1408(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x14d0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x1550(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x1618(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x1698(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1738(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x17b8(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_10; // 0x1858(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x18f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1978(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x19a8(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1a58(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1a78(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1a98(0x108)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x1ba0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1bd0(0x28)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_9; // 0x1bf8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1c98(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1cc8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x1d78(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1e18(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1e40(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1f00(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_8; // 0x1f80(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2020(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2178(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x21a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x2240(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x22c0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x2388(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2408(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x24d0(0x80)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x2550(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0x2580(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x2698(0x118)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x27b0(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x2850(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x2878(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x28a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x28c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x28f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x2918(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x2940(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x2968(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x2990(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x29b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x29e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x2a08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2a30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x2a58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2a80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x2aa8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x2ad0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2af8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2b20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x2b48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x2b70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x2b98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2bc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2be8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2c10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2c38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2c60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2c88(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x2cb0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x2d30(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2dd0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x2e50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x2e80(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x2f00(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x2fa0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x3020(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x3050(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x30d0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x3170(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x31f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x3220(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x32a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x3340(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x33c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x33f0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x3470(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x3510(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x3590(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x35c0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x3640(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x36e0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_7; // 0x3760(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_6; // 0x3800(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x38a0(0x190)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x3a30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x3a60(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x3ae0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x3b80(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x3c00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x3c30(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x3cb0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x3d50(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_5; // 0x3dd0(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x3e70(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x3f10(0x190)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x40a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x40d0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x4150(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x41f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4270(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x42a0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x4320(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x43c0(0x80)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x4440(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x44e0(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x4580(0x190)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4710(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x4740(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x47c0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x4860(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x48e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4910(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4990(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4a30(0x80)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x4ab0(0x190)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x4c40(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4c70(0xb0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x4d20(0xa0)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x4dc0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x4df0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x4f08(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x5020(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x5138(0x30)
	bool bIsSportsCar; // 0x5168(0x01)
	bool bIsBasicTruck; // 0x5169(0x01)
	bool IsThrowConsumable_2; // 0x516a(0x01)

	void VehicleFullBodyOverride(struct FPoseLink InPoseFullBody, struct FPoseLink InPoseUpperAndLowerCachePose, struct FPoseLink VehicleFullBodyOverride); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleFullBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void VehicleLowerBodyOverride(struct FPoseLink InPoseLowerBodyDefault, struct FPoseLink InPoseUpperBody, struct FPoseLink VehicleLowerBodyOverride); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleLowerBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void VehicleSplitBodyOverride(struct FPoseLink InPoseSplitBody, struct FPoseLink InPoseUpperAndLowerBody, struct FFortAnimInput_TurnInPlace TurnInPlace, struct FPoseLink InPoseUpperAndLowerBodyRemoveRoot, struct FPoseLink VehicleSplitBodyOverride); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleSplitBodyOverride // (HasOutParms|BlueprintCallable) // @ game+0xda7c34
	void AnimGraph(struct FPoseLink AnimGraph); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void BlueprintInitializeAnimation(); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0xda7c34
	void ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP(int32_t EntryPoint); // Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0xda7c34
};

