// SolarisGeneratedClass VerseFortnite_StormController_storm_phase.storm_phase
// Size: 0x58 (Inherited: 0x28)
struct Ustorm_phase : UObject {
	float __verse_0x4CDBEC4D_waitTime; // 0x28(0x04)
	float __verse_0xDFEF9A4E_shrinkTime; // 0x2c(0x04)
	float __verse_0x96A9475A_endRadius; // 0x30(0x04)
	float __verse_0x61AAA523_endRadiusPercentage; // 0x34(0x04)
	int32_t __verse_0x7781DBF3_damageIndex; // 0x38(0x04)
	char __verse_0x3902DD0B_moves : 1; // 0x3c(0x01)
	char pad_3C_1 : 7; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	float __verse_0xA376E20D_minMovementDistance; // 0x40(0x04)
	float __verse_0x2C327F1D_maxMovementDistance; // 0x44(0x04)
	float __verse_0xDA5EE7C4_minMovementDistancePercentage; // 0x48(0x04)
	float __verse_0x7B63CDBA_maxMovementDistancePercentage; // 0x4c(0x04)
	struct Uvector4_v* __verse_0xD6F5A7B7_endLocation; // 0x50(0x08)

	void $InitCDO(); // Function VerseFortnite_StormController_storm_phase.storm_phase.$InitCDO // (None) // @ game+0xda7c34
};

