// WidgetBlueprintGeneratedClass Violator_ActiveFriends.Violator_ActiveFriends_C
// Size: 0x2d8 (Inherited: 0x290)
struct UViolator_ActiveFriends_C : UFortActiveFriendsViolator {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x290(0x08)
	struct UWidgetAnimation* Reset-Off; // 0x298(0x08)
	struct UWidgetAnimation* Update-Down; // 0x2a0(0x08)
	struct UWidgetAnimation* Update-Up; // 0x2a8(0x08)
	struct UWidgetAnimation* Intro; // 0x2b0(0x08)
	struct UImage* Image_UpdateFlare; // 0x2b8(0x08)
	struct UImage* SocialIcon; // 0x2c0(0x08)
	struct UCommonTextBlock* Text_DeltaChange; // 0x2c8(0x08)
	struct UImage* YellowBox; // 0x2d0(0x08)

	void CallOut Hide(); // Function Violator_ActiveFriends.Violator_ActiveFriends_C.CallOut Hide // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void CallOut Surface(); // Function Violator_ActiveFriends.Violator_ActiveFriends_C.CallOut Surface // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void UpdateData(); // Function Violator_ActiveFriends.Violator_ActiveFriends_C.UpdateData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xda7c34
	void PreConstruct(bool IsDesignTime); // Function Violator_ActiveFriends.Violator_ActiveFriends_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xda7c34
	void Construct(); // Function Violator_ActiveFriends.Violator_ActiveFriends_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0xda7c34
	void ExecuteUbergraph_Violator_ActiveFriends(int32_t EntryPoint); // Function Violator_ActiveFriends.Violator_ActiveFriends_C.ExecuteUbergraph_Violator_ActiveFriends // (Final|UbergraphFunction) // @ game+0xda7c34
};

