// WidgetBlueprintGeneratedClass XpBarToolTip.XpBarToolTip_C
// Size: 0x350 (Inherited: 0x288)
struct UXpBarToolTip_C : UCommonUserWidget {
	struct UCommonTextBlock* CommonTextBlock_1; // 0x288(0x08)
	struct UCommonTextBlock* CommonTextBlock_3; // 0x290(0x08)
	struct UCommonTextBlock* CommonTextBlock_30; // 0x298(0x08)
	struct UCommonTextBlock* CommonTextBlock_31; // 0x2a0(0x08)
	struct UCommonTextBlock* CommonTextBlock_32; // 0x2a8(0x08)
	struct UImage* Image_1; // 0x2b0(0x08)
	struct UImage* Image_2; // 0x2b8(0x08)
	struct UImage* Image_3; // 0x2c0(0x08)
	struct UImage* Image_4; // 0x2c8(0x08)
	struct UImage* Image_6; // 0x2d0(0x08)
	struct FText HeaderText; // 0x2d8(0x18)
	struct FText CommanderXPText; // 0x2f0(0x18)
	struct FText BoostXPText; // 0x308(0x18)
	struct FText RestedXPText; // 0x320(0x18)
	struct FText BodyText; // 0x338(0x18)

	struct FText GetBodyText(); // Function XpBarToolTip.XpBarToolTip_C.GetBodyText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xda7c34
	struct FText GetRestedXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetRestedXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xda7c34
	struct FText GetBoostXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetBoostXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xda7c34
	struct FText GetCommanderXPText(); // Function XpBarToolTip.XpBarToolTip_C.GetCommanderXPText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xda7c34
	struct FText GetHeaderText(); // Function XpBarToolTip.XpBarToolTip_C.GetHeaderText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xda7c34
};

